{
    "errors": "",
    "warnings": "",
    "elementNames": "Riya\n    Riya De Moor\n    Miss Riya\n    Lady Riya\n    Lady Riya the Warrior\n    Miss Riya De Moor\nOmicron\n    Mr. Omicron\n    Hey Omicron\n    Omicron Wonderbuck\nAchilles\nSable Crow\nViolet\n    Violet Connah\n    Lady Violet\nBrimble\n    Detective Inspector Brimble\n    Mr. Brimble\nPrice\n    Constable Price\n    Bronwyn Price\nDoes Arianrhod\nArawn\nPrivate Nez\nTwo Gen\nRight\nRussia\nJock\nOld English\nTis\nEgor\nDewey Nevitt\nIraq\nSt. Pyr\nBronwyn\n    Hey Bronwyn\nSure\nGauntlet of Camelot\nNaveen\nSomething\nTwenty\nShort History of Nearly Everything\nMerlin\nOh\nThree\nTurkish\nErklik\nHello\nOld Welsh\nTom Bombadil\nNissan Titan\n",
    "profanityReport": "profanity rating:\n red flags       0\n pg              34\n                     1 dammit\n                     13 damn\n                     1 damnation\n                     5 damned\n                     1 goddamn\n                     13 shit\n cuss words      19\n                     1 arse\n                     1 bastard\n                     13 hell\n                     1 humped\n                     1 piss\n                     1 pissed\n                     1 queer\n possibles       3\n recommended age 13",
    "unknowns": [
        "achi",
        "achiya",
        "achiyalatopa",
        "achiyalatopas",
        "ahold",
        "cowpats",
        "dreamcatchers",
        "dunno",
        "earth'll",
        "fairytales",
        "gwyllgi",
        "headshot",
        "hello",
        "helluva",
        "henwen",
        "imprisoners",
        "kinda",
        "kiva",
        "landmine",
        "lotta",
        "m'lady",
        "motorway",
        "nostos",
        "nuttin",
        "ooph",
        "outta",
        "paleoamerican",
        "petroglyphs",
        "pinyon",
        "pronghorns",
        "ryan",
        "skorpios",
        "smokey",
        "stratus",
        "tele",
        "terracotta",
        "timelapse",
        "tis",
        "twas",
        "twould",
        "typhon",
        "vortexes",
        "wanagi",
        "wanna",
        "wikipedia"
    ],
    "scenes": [
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section1>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- Age of Omicron -->\n<!-- Prologue -->\n<!-- ### -->\n<p>Arianrhod walked across the endless sea, her bare feet scarcely touching the surface of the green waters. Her hair, her gown, and her cheeks shone with windswept beads of moonlight.</p>\n<p>And then she was a bird, drifting on white wings beneath the starry sky. Then a silver wheel, mixing water with darkness as it revolved. At last, a woman again, with flame-colored hair and a jewel-green gown to match her eyes.</p>\n<p>The goddess reached the black sands and halted on the beach. She raised a hand in greeting.</p>\n<p>&ldquo;Good morning, cousin!&rdquo;</p>\n<p>Arawn sat hunched in his throne by the water&rsquo;s edge, leaned over the mess of yellowed papers, spilled ink, broken quills, and scattered bones atop his desk.</p>\n<p>&ldquo;Morning?&rdquo; he grumbled. &ldquo;You come to Annwn speaking of morning? It is always midnight here, Arianrhod. Surely it has not been so long since your last visit to the lands of Death that you have forgotten that.&rdquo;</p>\n<p>Arianrhod laughed&mdash;a splash of silver in that dark place. &ldquo;Am I not a goddess of dawn? Wherever my feet do tread, there is morning.&rdquo;</p>\n<p>&ldquo;Goddess of dawn?&rdquo; he sneered, setting down his quill and steepling his fingers on the desktop. &ldquo;I thought it was the moon and stars, the womb, rebirth. And what else was it the old priestesses credited you for? Ah yes: <i>the flow of time and fate</i>. Which is it, cousin?&rdquo;</p>\n<p>&ldquo;Like you, I have many talents,&rdquo; said Arianrhod.</p>\n<p>&ldquo;You are nothing like me.&rdquo;</p>\n<p>&ldquo;We are both&hellip;romantics,&rdquo; she mused, stepping closer to her cousin&rsquo;s throne. &ldquo;In our own ways, of course. <i>I</i> find beauty in the morning fog, in the cry of a babe, in the first kiss and the last kiss. And you? You seek it in other forms&mdash;in turmoil, war, and chaos.&rdquo;</p>\n<p>She peered over Arawn&rsquo;s bent head, past the black beach to the heart of Annwn. A forest of souls loomed in the distance like the silhouettes of broken dolls, limbs limp, shadows swaying in a breeze that was not there.</p>\n<p>&ldquo;<i>Chaos</i>.&rdquo; Arawn whispered the word like a prayer. He looked up through smiling eyes the shade of storm clouds and turned to face his cousin. She saw him then, not as a pale and gangly man, but as a beast of bone and fur beneath a cloak of human skins. &ldquo;Chaos is the spring that birthed both gods and mortals, <i>and</i> the ocean to which all lively currents flow. Origin and finale. That is the undeniable truth, fair cousin. Yet still, you resist the inescapable End. I would think a goddess who helped set the ocean currents into motion would see how futile it is to rage against the tide.&rdquo;</p>\n<p>&ldquo;I will persist to the last,&rdquo; said Arianrhod.</p>\n<p>&ldquo;As will I.&rdquo;</p>\n<p>&ldquo;I know. That is why I&rsquo;ve come.&rdquo; Arianrhod began to pace around Arawn&rsquo;s desk. From the left side, Arawn appeared as a glittering obsidian cauldron, putrid vapors rising from its base. She moved another few inches; the man Arawn was back, bent and brooding.</p>\n<p>&ldquo;Subtlety was never one of your charms, Arawn. There are rumors throughout the Realm about this latest scheme of yours. I know what you are planning.&rdquo;</p>\n<p>He shrugged a bony shoulder. &ldquo;So what? It is done! I have already sent my black sparks to the Other Side. The flames will kindle. The cages will open. There is nothing you can do to stop it.&rdquo;</p>\n<p>&ldquo;Isn&rsquo;t there?&rdquo; jeered Arianrhod, one eyebrow arching playfully. &ldquo;I have stopped you in the past, remember?&rdquo;</p>\n<p>&ldquo;Long ago, when heroes walked the Earth. But have you peered through your windows lately? Humanity has grown soft, weak, blind. You will find no ally worthy of taking up your cause, Arianrhod. You waste your time coming here today.&rdquo;</p>\n<p>&ldquo;So confident?&rdquo; She leaned over the desk and whispered, &ldquo;You&rsquo;re not the only one who&rsquo;s been sitting alone these past ages, plotting in the dark, waiting for the perfect moment to flex your powers once more.&rdquo;</p>\n<p>Arawn stiffened and turned his face away from her, sniffing. He licked his blue lips and breathed deep, then turned back to address her, but Arianrhod was already gone&mdash;a white bird in the distance, soaring over the emerald sea, raining feathers as it flew.</p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section2>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- Episode 1: “Obovoid” -->\n<!-- ### -->\n<p>&ldquo;Shut your textbooks. Ignore the timeline on the wall. Forget the dates. Forget the battles. Forget the miserable results on your practice exams. Now, I want you all to ask yourselves: <i>What is history</i>? Yes, Katie?&rdquo;</p>\n<p>&ldquo;Innit like all that stuff you just said? Like kings and crowns and the dates of battles?&rdquo;</p>\n<p>Riya De Moor hopped up to sit on the front of her desk, palms against its edge, legs swinging gently. She smiled at her students. &ldquo;That&rsquo;s just a tiny part of it. History is the accumulation of lives. It&rsquo;s the story of people like you. That medieval crown in your book was forged by human hands and placed on a human head. That ancient jar behind glass at the British Museum was used to carry water into someone&rsquo;s home. The mummified pharaoh on the tele was just like you guys. He laughed at jokes, argued with friends, daydreamed, had secrets. Keep that in mind, and history&hellip;&rdquo; She let her gaze wander the room, locking eyes with the teenagers leaning back in their chairs or slumped over their desks, seeking connection. &ldquo;History comes alive.&rdquo;</p>\n<p>The bell rang. Riya slid stiffly off the desk.</p>\n<p>&ldquo;Remember all that when you&rsquo;re revising!&rdquo; Riya called out over the shuffling of books, rucksacks, and chairs. &ldquo;It might not actually help, but I thought it sounded pretty damn good. Have a safe weekend, guys! Bye, Katie. Bye, Violet. Don&rsquo;t forget your bag, Rhys. Bye.&rdquo;</p>\n<p>&ldquo;Laters, Miss Riya!&rdquo;</p>\n<p>As the sea of blue school jumpers receded to the back of the classroom and trickled out the door, Riya limped around her desk, fell into her chair, and sipped at her tepid tea. A bit of commotion at the door caught her eye. Two neon vests were squeezing into the room through the retreating students like chartreuse sails on the blue jumper sea. The vests were framed in black uniforms and two badges gleamed.</p>\n<p>A pair of police constables approached the teacher&rsquo;s desk.</p>\n<p>&ldquo;Hello, Constable Price,&rdquo; Riya said to the first, pulling herself to her feet. &ldquo;Haven&rsquo;t seen you in a while.&rdquo;</p>\n<p>Bronwyn Price&mdash;short, mousy-haired, chinless&mdash;removed her bowler hat and tucked it under an arm. &ldquo;&lsquo;Lo, Riya! Hope you&rsquo;re well. Have you met DI Brimble here? Brimble, this is Riya De Moor.&rdquo;</p>\n<p>Riya looked from her friend to the second constable, a wide-set man with enough chins for the whole of the Welsh police force. She shook his massive hand. &ldquo;Don&rsquo;t think I&rsquo;ve had the pleasure.&rdquo;</p>\n<p>Detective Inspector Brimble responded with a grunt.</p>\n<p>&ldquo;I&rsquo;ve just been telling DI Brimble about you,&rdquo; said Constable Price. &ldquo;Best teacher in St. Pyr, so I said! Her pupils really trust her. Why, whenever a teen goes missing, there&rsquo;s a good bet Miss Riya will track them down and make things right. Isn&rsquo;t that so, Riya?&rdquo;</p>\n<p>&ldquo;I do what I can,&rdquo; said Riya. &ldquo;What brings you down here?&rdquo;</p>\n<p>&ldquo;Ah. Well. It&rsquo;s been a bit of an odd day, to tell you true,&rdquo; stammered Price. &ldquo;You know that farmer, lives up near the ruins, name of Dewey Nevitt?&rdquo;</p>\n<p>&ldquo;Only by reputation. Supposed to be a rather eccentric character.&rdquo;</p>\n<p>&ldquo;Hm. Well, yes. Seems Nevitt took his digger out this morning to make himself a new potato patch, and the old chap struck something in the soil. At first he thought it was just a big rock, but as he went to dig the thing out, it proved to be&hellip;something else.&rdquo;</p>\n<p>&ldquo;What is it?&rdquo;</p>\n<p>&ldquo;We&rsquo;re not sure, but whatever it is, it&rsquo;s&mdash;how do I put it?&mdash;<i>an object of historical and archaeological significance</i>.&rdquo;</p>\n<p>Riya crossed her arms, her interest piqued. &ldquo;No kidding.&rdquo;</p>\n<p>Price nodded vigorously. &ldquo;Oh yes! Really something. Problem is, old Nevitt is determined to get rid of the thing and plant his damn potatoes. We called the Archeological Council down in Cardiff, but they can&rsquo;t send a team up to investigate until Monday. The chief&rsquo;s worried. She asked if we knew any local historians who could come have a look, and I mentioned <i>your</i> name, Riya.&rdquo;</p>\n<p>DI Brimble cleared his throat and grumbled, &ldquo;<i>Local</i>.&rdquo;</p>\n<p>Riya was used to this sort of thing. Despite having lived in the Welsh village of St. Pyr for the past six years, she was still known as &lsquo;the Londoner&rsquo; to the locals, and probably always would be.</p>\n<p>&ldquo;I&rsquo;d be happy to take a look,&rdquo; Riya assured them, snatching her coat from her chair and grabbing her cane. The appearance of the cane seemed to draw DI Brimble&rsquo;s interest in a way nothing else had, and it wasn&rsquo;t just the rare sight of a thirty-four-year-old with a limp.</p>\n<p>Brimble went slightly blue, opened his mouth to speak, shut it again, then spluttered, &ldquo;Did you really get injured in Iraq? Constable Price told me you did two tours with the Royal Marines!&rdquo;</p>\n<p>&ldquo;I was in the Royal Military Police, actually,&rdquo; Riya corrected him, pulling on her coat. &ldquo;But yeah, I was attached to the Marines in Command 44 starting in &lsquo;07. Though I&rsquo;m not sure the second tour counts. While on my first patrol back in Iraq, a landmine went off ten feet from where I was standing. Ended my military career with a flash and a roar and a hunk of shrapnel to the lower spine.&rdquo;</p>\n<p>Riya switched off the light and locked up on their way out.</p>\n<p>&ldquo;Couldn&rsquo;t you have stayed in the service?&rdquo; asked Price as they walked down the hall. &ldquo;Been a trainer or recruiter or something?&rdquo;</p>\n<p>&ldquo;I didn&rsquo;t fancy it. I miss the uniform, but wearing one behind a desk wasn&rsquo;t for me. And I like teaching. And I like St. Pyr.&rdquo;</p>\n<p>Heavy clouds hung in pewter curtains over a crisp March afternoon as they set off across the car park. They must have made a strange sight ambling through the chattering ranks of teens: Bronwyn Price bouncing along energetically, an eager cop in her early twenties; DI Brimble, surly, burly, and pushing fifty; Riya De Moor leaning on her cane, keen-eyed and olive-skinned, raven-haired except around the ears where she was going gray.</p>\n<p>They took Price&rsquo;s patrol car and headed north up the winding, cottage-lined road, out of town and into the chilly hills. Riya stared out the back seat window at the old hedge roves, the somber copses of pine, and the grassy slopes, their colors trapped between winter and spring, a soggy mix of beige and marigold.</p>\n<p>It began to rain, soft but steady, blurring Riya&rsquo;s view of the countryside into an oily canvas like those of the impressionist masters.</p>\n<p>&ldquo;So!&rdquo; croaked DI Brimble, breaking the silence. &ldquo;How does one get a name like <i>Riya De Moor</i>, anyway?&rdquo;</p>\n<p>&ldquo;By having a Sikh mother and a Dutch father,&rdquo; said Riya. &ldquo;Aren&rsquo;t you supposed to turn right here?&rdquo;</p>\n<p>&ldquo;Oh yeah! Cheers,&rdquo; chirped Price. She turned the car off the pavement, over a cattle grid, and down a muddy gravel road.</p>\n<p>They reached the farmstead and Price parked between a low barn and an old farmhouse. Riya stepped out onto the slick rocks and pulled her hood up. Rain patted a tattoo on the car, dripped off the wonky edges of the barn roof, gathered in puddles and soaked into cowpats. Brimble led the way around the corner of the farmhouse, his broad back blocking the women&rsquo;s view so that Riya&rsquo;s first impression of the strange scene was auditory. Engines groaned and bumped. Someone shouted curses and instructions, first in English, then in Welsh. Finally Brimble stopped and Riya stepped around him.</p>\n<p>An expanse of tilled earth lay between the back of the farmhouse and a field with a broken fence. Two diggers&mdash;great big rusted excavating machines, coughing smoke&mdash;faced each other, booms extended, buckets lowered, struggling like giant mantises battling over a mate. A pair of chains had been attached to each bucket and ran down to wrap around a very large, very odd object dangling precariously a few feet in the air.</p>\n<p>&ldquo;Damn it all!&rdquo; boomed Brimble. &ldquo;They&rsquo;ve gone and dug the thing right out of the ground!&rdquo;</p>\n<p>The drivers of the two diggers had excavated a great hole in the ground and were attempting to haul the discovery out of it. Riya examined the object where it hung between the diggers. It was ten feet tall and five feet wide, its top half rounded like a sphere, its bottom half tapering off in a sharp curve. Riya thought it looked like a gargantuan terra cotta easter egg.</p>\n<p>&ldquo;My, my,&rdquo; marveled Price, shaking her head. &ldquo;Will you look at that, will you? How am I supposed to describe the ruddy thing in my report? Egg-shaped? Is there a technical term for egg-shaped?&rdquo;</p>\n<p>&ldquo;Ovoid,&rdquo; Riya told the constable. &ldquo;But when it&rsquo;s an upside-down egg shape, the term is <i>obovoid</i>. My god. What is this thing?&rdquo;</p>\n<p>She moved closer, her cane sticking in the mud, and moved to the edge of the hole to stare up at the dangling obovoid. The diggers roared, as did farmer Nevitt and DI Brimble, but Riya was all smiles.</p>\n<p>&ldquo;Look, Bronwyn!&rdquo; she shouted. &ldquo;Do you see those markings there below the chains! Old Gaelic, unless I&rsquo;m mistaken. Could be as old as the sixth century. But then&hellip; No! Those symbols down there look almost like&hellip; It can&rsquo;t be Egyptian hieroglyphics!&rdquo;</p>\n<p>Riya took a step back and stabbed at the wet ground with her cane.</p>\n<p>&ldquo;What the hell is this?&rdquo; she whispered, awestruck. &ldquo;Where&rsquo;s it come from? <i>When</i>&rsquo;s it come from?&rdquo;</p>\n<p>&ldquo;I say, look out!&rdquo; shouted Brimble.</p>\n<p>Riya looked around and saw both constables running toward her, hands outstretched. She turned back in time to see one of the diggers tilt and fall onto its side. One chain snapped and spit bits of rusty metal. She flinched and ducked as the liberated chain whipped over her head.</p>\n<p>The giant clay egg was squeezed in the remaining chains. A web of cracks appeared over its surface. The bottom of the obovoid burst open, spewing dust and clay down into the hole. Straw streamed into the mud. Riya saw what looked like a small box tumble free, then&hellip;</p>\n<p>She gasped.</p>\n<p>A limp human body had slid from the broken egg and into the hole. A moment later, it was lost from view beneath the rain of hay.</p>\n<p>&ldquo;Good lord!&rdquo; yelped Price. &ldquo;Did you see that?&rdquo;</p>\n<p>&ldquo;I saw it!&rdquo; shouted Brimble. &ldquo;Dewey, you old twit, get those drivers to move it out of the way! We need to get down there!&rdquo;</p>\n<p>But farmer Nevitt turned on his heel and ran for the front door of the farmhouse, shouting, &ldquo;I don&rsquo;t want nuttin to do with this!&rdquo;</p>\n<p>Price came to Riya&rsquo;s side. They stared at the fallen digger. Only one chain remained holding it to the damaged obovoid, and as they watched, it broke. The other digger careened backward, wheels spinning in the mud, yanking on the obovoid. The egg shattered into heavy pieces.</p>\n<p>&ldquo;Come on,&rdquo; said Riya, stepping to the edge of the hole and sliding down its slope on the seat of her trousers. Price and Brimble followed clumsily. The three began scooping up mud, straw, and pieces of clay, searching. They found a foot, a shoulder, a face. Soon the mess was cleared away and they crouched, breathing hard, over the naked body of a wrinkled old man.</p>\n<p>&ldquo;Damn and blast,&rdquo; said Brimble. &ldquo;We don&rsquo;t need a historian, we need a bloody coroner! This is a crime scene. A murder! No wonder Nevitt ran, the scoundrel.&rdquo;</p>\n<p>&ldquo;I don&rsquo;t think so,&rdquo; objected Riya, shifting a strand of straw to better look at the corpse&rsquo;s face. &ldquo;This obovoid has been buried for a long time, Mr. Brimble. A <i>very </i>long time.&rdquo;</p>\n<p>&ldquo;Codswallop! Look at the body. It looks as though he died this morning.&rdquo;</p>\n<p>&ldquo;He could have been preserved somehow, I suppose,&rdquo; said Riya, but she didn&rsquo;t think this was likely either. There were no signs of mummification, the limbs were limp, the skin soft.</p>\n<p>Overall, the body was in pristine condition. The man was of average height but thin and lanky, and by the way he lay twisted in the fetal position, he looked almost like a child. His head was bald at the top with a great mop of golden-gray curls around the sides and back. His face had once been handsome but now featured a diamond pattern of cracks and wrinkles. He had bristly eyebrows like fat, black caterpillars, a curly white beard, and a great flowing mustache. The ghost of a smile was etched onto his thin lips.</p>\n<p>&ldquo;Fascinating,&rdquo; said Riya, squinting into the peaceful face. &ldquo;What&rsquo;s your story, then?&rdquo;</p>\n<p>The eyes snapped open.</p>\n<p>The old man gasped for breath.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section3>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>&ldquo;Bloody ridiculous,&rdquo; whined Detective Inspector Brimble. &ldquo;This is the most insane thing I&rsquo;ve done in my whole career. We should be bringing this man straight to the station for booking!&rdquo;</p>\n<p>&ldquo;On what crime? Trespassing?&rdquo; asked Price. &ldquo;Besides, he&rsquo;s a human being, sir, and he said he was hungry.&rdquo;</p>\n<p>&ldquo;Is that what he said? All I heard was a lot of blabbering nonsense. And don&rsquo;t go telling me it was Old English, Miss De Moor! I know English and that wasn&rsquo;t it. As far as I can tell, this senile twit is just looking for a free meal after that little stunt with the egg. He&rsquo;s completely nutty in the head.&rdquo;</p>\n<p>&ldquo;Don&rsquo;t you mean scrambled, sir?&rdquo; quipped Price.</p>\n<p>&ldquo;<i>Humph</i>.&rdquo;</p>\n<p>&ldquo;Well, crazy or not,&rdquo; Riya told the constables, &ldquo;I&rsquo;m ordering him some supper.&rdquo;</p>\n<p>She left Price and Brimble standing by the cafe entrance and walked over to the booth where the old man was seated. He looked up at her curiously. He was dressed in faded flannel and denim from Dewey Nevitt&rsquo;s moth-ridden wardrobe, and the baggy clothes made his thin form seem almost skeletal. His eyes were large and glassy, one chocolate brown, one forest green. Riya&rsquo;s grandmother&rsquo;s eyes had been like that, mismatched and beautiful.</p>\n<p>His gaze darted around the cafe, from the faces of other patrons, to the whizzing ceiling fans, to the daily specials scribbled in pink chalk across the blackboard menu above the counter.</p>\n<p>&ldquo;It&rsquo;s a lovely cafe,&rdquo; Riya began, hoping to coax a response beyond the rambling grumbles he had uttered back at the farm. He hadn&rsquo;t spoken a word since they helped him into the back seat of Price&rsquo;s car. &ldquo;Like I said before, I&rsquo;m Riya. Do you have a name?&rdquo;</p>\n<p>He met her eyes and blinked a few times. Then, as if a light was switched on behind his mismatched corneas, his eyes brightened.</p>\n<p>&ldquo;Nay, m&rsquo;lady!&rdquo; the man trilled brightly, in a voice so strong and clear that Riya jumped. &ldquo;I have many names.&rdquo;</p>\n<p>Riya straightened up. By the door, Price and Brimble stopped their bickering to listen in.</p>\n<p>&ldquo;Oh! Many names, you say?&rdquo; stammered Riya, clearing her throat. &ldquo;Then what should I call you?&rdquo;</p>\n<p>He leaned back in the booth and rolled up his baggy sleeves, considering the question for a few seconds. &ldquo;<i>Omicron!</i> Aye, aye. &lsquo;Tis appropriate. Call me Omicron.&rdquo;</p>\n<p>&ldquo;It&rsquo;s good to meet you, Omicron. And is that your first name or your last name?&rdquo;</p>\n<p>&ldquo;Neither, m&rsquo;lady.&rdquo;</p>\n<p>&ldquo;Okay then,&rdquo; said Riya slowly, looking over at Price for support. The constable shrugged. &ldquo;What are some of your other names?&rdquo;</p>\n<p>&ldquo;Oh, let me think.&rdquo; Omicron rubbed a palm across the shiny top of his head. &ldquo;Here in Britain, most knew me as Merlin. In the Netherlands, they called me Witte Draak. I would tell you what the Franks called me, but&rdquo;&mdash;he glanced at a nearby booth with a cluster of chattering children and their flustered parents&mdash;&ldquo;I&rsquo;m not sure &rsquo;twould be appropriate.&rdquo;</p>\n<p>&ldquo;Did you say <i>Merlin</i>?&rdquo; asked Riya. &ldquo;You think you&rsquo;re Merlin, as in&hellip;as in King Arthur&rsquo;s magical assistant?&rdquo;</p>\n<p>&ldquo;Magical assistant?&rdquo; bellowed Omicron, smacking a hand onto the table so that the salt shaker toppled to the floor. &ldquo;You save the world a dozen times and unlock magics forgotten for an age, and they remember you as a magical assistant? Magical assistant, indeed!&rdquo;</p>\n<p>He took a deep breath and steadied himself. &ldquo;Pardon the outburst, m&rsquo;lady. I&rsquo;ve a frightful headache. Centuries below the earth&rsquo;ll do that to a man.&rdquo;</p>\n<p>As he spoke, a waiter came to take their order. The waiter was a young man named Naveen whom Riya had taught a few years back.</p>\n<p>&ldquo;Er&mdash;Hey,&rdquo; said Naveen, bending to pick up the salt shaker. &ldquo;So what would you guys like?&rdquo;</p>\n<p>&ldquo;You mean to say this queer, small room is what passes for a Great Hall these days?&rdquo; gasped Omicron.</p>\n<p>Naveen looked over at Riya. &ldquo;Is he, like, okay?&rdquo;</p>\n<p>Riya sighed. &ldquo;I&rsquo;m not sure. Omicron, sir, what would&mdash;&rdquo;</p>\n<p>&ldquo;No <i>sir</i>,&rdquo; the old man corrected. &ldquo;Not a knight myself, though I&rsquo;m friends with many. As for my selection of vittles, I am famished! I&rsquo;ll begin with a smoky leg of mutton, naturally, and I do rather fancy a pigeon and woodcock pie. Tell me, lad! Can this establishment procure any fine vintages of mead? I&rsquo;ve never been much of an ale man, myself.&rdquo;</p>\n<p>&ldquo;We...have Coke.&rdquo;</p>\n<p>Riya put her elbows on the table and leaned into her hands. &ldquo;Just bring fish and chips and a water. Thanks, Naveen.&rdquo;</p>\n<p>&ldquo;Whatever.&rdquo; Naveen lumbered back to the kitchen.</p>\n<p>&ldquo;Alright,&rdquo; Riya said to herself, summoning that special brand of patience unique to teachers. &ldquo;Omicron. You were saying you believe yourself to be a medieval sorcerer, I think.&rdquo;</p>\n<p>He nodded brightly.</p>\n<p>&ldquo;Could you show me some magic?&rdquo; she asked.</p>\n<p>&ldquo;Ah, a doubting Thomas! Alas, nay, m&rsquo;lady. I&rsquo;ve not the energy, magical or otherwise, to display sorcery at this time. Perhaps with some meat and spirits in my stomach.&rdquo;</p>\n<p>&ldquo;Uh-huh,&rdquo; said Riya. &ldquo;Then tell me, do you remember why you were inside that thing? The clay egg?&rdquo;</p>\n<p>&ldquo;Of course I remember! I instructed my apprentices to place spells of frozen death upon my person and seal me in the sacred shape. My present work as Servant of Order was complete, you see, and fearing that my accomplishments would one day be undone by future forces of evil, I preserved myself until I was needed again. And here I am!&rdquo;</p>\n<p>&ldquo;For someone from the Middle Ages, you speak modern English pretty well.&rdquo;</p>\n<p>&ldquo;&lsquo;Tis easily explained. I am a panglot. I can speak <i>every</i> language, though thrust into a new era like this, it took me a few hours to acclimate.&rdquo;</p>\n<p>&ldquo;<i>Every</i> language? Quite the talent.&rdquo;</p>\n<p>&ldquo;Thank you. The real challenge is mastering the <i>First Words</i>&mdash;that is, the mother of all languages taught to the first peoples by the gods. After that, &lsquo;tis merely a matter of aligning one&rsquo;s mind with the evolutionary paths of the child languages. Your <i>modern English</i> is just a twisted bough on a tree I know like an old friend.&rdquo;</p>\n<p>&ldquo;I see,&rdquo; said Riya, standing. &ldquo;Would you excuse me, Omicron? I need to consult with my colleagues.&rdquo;</p>\n<p>She walked over to the police constables. &ldquo;What do you think?&rdquo;</p>\n<p>&ldquo;Certifiable,&rdquo; said Brimble.</p>\n<p>&ldquo;I would tend to agree,&rdquo; said Riya, &ldquo;<i>if</i> we hadn&rsquo;t just seen him emerge from the ground.&rdquo;</p>\n<p>&ldquo;Even so!&rdquo;</p>\n<p>&ldquo;Well, maybe it&rsquo;s one of them internet pranks?&rdquo; suggested Price. &ldquo;Maybe some YouTuberist will pop up and yell <i>surprise</i>!&rdquo;</p>\n<p>&ldquo;Surprise?&rdquo; repeated Riya, shaking her head. &ldquo;Surprise as in, <i>Surprise! We baked an old man into a giant egg and buried him in a field!</i> That kind of surprise? What kind of YouTube channels are you watching?&rdquo;</p>\n<p>Price&rsquo;s cheeks burned pink. &ldquo;Well, I was only thinking out loud.&rdquo;</p>\n<p>Naveen returned to the booth and set the fish and chips before Omicron, who thanked him, sniffed at the fish, and began to eat.</p>\n<p>&ldquo;Try the chips,&rdquo; offered Riya, returning to the booth. &ldquo;They&rsquo;re made of potatoes. New World food. Never would have been served at the Round Table.&rdquo;</p>\n<p>Omicron nibbled at one chip, then began shoving them into his mouth, three at a time. In less than a minute, the meal was gone and he was gulping the water. He finished with a flourish, wiped his lips with a sleeve, and abruptly stood.</p>\n<p>&ldquo;Let us away, m&rsquo;lady!&rdquo; he announced, marching for the door. &ldquo;I need someone to show me the ins and outs of this neoteric world.&rdquo;</p>\n<p>Brimble started to protest. Riya pulled herself up and tossed a ten pound note onto the table. She grabbed her cane and legged it after Omicron.</p>\n<p>&ldquo;It&rsquo;s okay!&rdquo; Riya assured the Detective Inspector. &ldquo;I&rsquo;ll stay with him. Bronwyn has my number. We&rsquo;ll be in contact.&rdquo;</p>\n<p>&ldquo;But I still say&mdash;&rdquo; Brimble complained as Omicron slid past him and out the door.</p>\n<p>&ldquo;Riya can take care of the old bloke over the weekend,&rdquo; said Price. &ldquo;Just don&rsquo;t leave the village, Riya. We&rsquo;ll reconnect when the archaeological team comes up on Monday.&rdquo;</p>\n<p>&ldquo;Right! Cheers, Bronwyn!&rdquo; Riya called over her shoulder.</p>\n<p>She hurried along the edge of the alley, trying to keep up with the spritely old man in baggy flannel. He moved like an excited child, staring at everything, touching everything, agog, befuddled, and amused at each new sight.</p>\n<p>&ldquo;Tell me!&rdquo; Omicron shouted to the dusk air. &ldquo;Is there a lord or monarch nearby with a library I might use? I need to catch up on the events of recent centuries.&rdquo;</p>\n<p>&ldquo;Oh,&rdquo; wheezed Riya, wincing as she hobbled along beside him. &ldquo;The village library is closed for renovations.&rdquo;</p>\n<p>&ldquo;And your own abode, does it not have a collection of manuscripts, maps, histories?&rdquo;</p>\n<p>&ldquo;Sure, but&mdash;&ldquo;</p>\n<p>&ldquo;Splendid! Then we shall start there.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section4>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>There would be a full moon in two days time, but already the moon shone down on St. Pyr with alarming brilliance. A silver wheel in an onyx sky. Riya&rsquo;s cottage was just south of the village, tucked between a forest and a grassy knoll. The knoll was the main reason she had bought the place. Atop its round crest stood a row of megaliths, like the plates on a stegosaurus&rsquo; back. She spent many mornings and evenings staring at the tall stones, and sometimes climbed the hill to get a closer look. She wandered among the megaliths, pondering their primeval purpose and examining with mingled curiosity and annoyance the centuries of graffiti carvings on their granite faces: the sketch of a ship, a vulgar word in Old Welsh, a wonky heart with &ldquo;T + V&rdquo; scribbled in its center.</p>\n<p>As she stood on the porch and stared at the moonborn shadows of the stones stretched across the knoll and her garden, Riya heard someone walking down the driveway.</p>\n<p>&ldquo;Hello?&rdquo; she called out, nervous from the day&rsquo;s unexpected excitement. &ldquo;Who&rsquo;s there?&rdquo;</p>\n<p>&ldquo;Why you shouting?&rdquo; responded a familiar young voice.</p>\n<p>Riya relaxed. &ldquo;Oh, it&rsquo;s you, Violet. Sorry.&rdquo;</p>\n<p>Violet Connah emerged from the shadows and walked across the moonlit garden, rucksack swinging, sandals flipping and flopping. Her strawberry hair was tied into its usual messy bun, and in silhouette Riya thought it looked like her fifteen-year-old student was wearing a bird&rsquo;s nest for a hat.</p>\n<p>&ldquo;I gotta stay here tonight,&rdquo; said Violet, skipping up the two stairs to the porch. &ldquo;One of those nights at home, you know. And I need help with this effing report for Lit class. You know <i>Gilgamesh</i>?&rdquo;</p>\n<p>&ldquo;Huh? Oh, not really. Listen, Violet,&rdquo; said Riya, sidestepping to halt the girl&rsquo;s progress, &ldquo;it&rsquo;s actually not a great night for me either.&rdquo;</p>\n<p>Violet&rsquo;s shoulders sank a few inches. She stared at her feet. &ldquo;I can&rsquo;t stay? You never said no before, Miss Riya.&rdquo;</p>\n<p>&ldquo;Well, yes, but&hellip;&rdquo;</p>\n<p>By the tungsten glow of the porch light, Riya noticed Violet&rsquo;s face. A splotch of foundation failed to hide a bruise on the girl&rsquo;s right cheek.</p>\n<p>&ldquo;Oh, Violet. I&rsquo;m sorry. I&rsquo;ve been distracted. I wasn&rsquo;t thinking. Of course I&rsquo;ll help you! But I really can&rsquo;t have you <i>here</i>. Could I drive you over to Trev&rsquo;s place?&rdquo;</p>\n<p>&ldquo;We broke up again.&rdquo;</p>\n<p>&ldquo;Course you did. Er&mdash;Your aunt&rsquo;s in Liverpool? I could get you a ticket.&rdquo;</p>\n<p>&ldquo;She&rsquo;s in France with her boyfriend.&rdquo;</p>\n<p>Riya exhaled. &ldquo;Come on in then. But you should know there&rsquo;s someone else staying for the night.&rdquo;</p>\n<p>Violet looked up, eyes wide. &ldquo;Someone else? <i>A man</i> someone else? Oooh! How effing scandalous! And we all thought you were one of those asexual cat ladies.&rdquo;</p>\n<p>&ldquo;What&rsquo;s wrong with asexual cat ladies? Besides, it&rsquo;s not like that. He&rsquo;s very old, for one thing.&rdquo;</p>\n<p>&ldquo;What, like forty?&rdquo;</p>\n<p>Violet hopped past Riya and strolled into the cottage. Riya followed, emerging from the low hall into the sitting room right behind Violet, at which point several things happened in quick succession. Violet spotted Omicron stretched leisurely across the book-strewn carpet, shrieked in surprise, and dropped her bag, causing Riya&rsquo;s cat, Tom Bombadil, to double front flip off the sofa where he had been napping and land atop Omicron&rsquo;s head. The man started so violently that the copy of <i>A Short History of Nearly Everything</i> he had been reading shot from his hand, soared majestically through the air, and knocked a framed photograph off the wall.</p>\n<p>&ldquo;But!&rdquo; gasped Violet, clutching a hand over her heart, &ldquo;he&rsquo;s&hellip;<i>ancient</i>!&rdquo;</p>\n<p>Omicron dislodged the cat from his head, set the hissing animal aside, and stood. &ldquo;At last, someone perceptive!&rdquo; He beamed at Violet and bowed low. &ldquo;Omicron, at your service, m&rsquo;lady.&rdquo;</p>\n<p>&ldquo;My lady?&rdquo; echoed Violet. She smiled. &ldquo;I think I like that. He&rsquo;s a bit charming, he is.&rdquo; She turned and whispered, rather loudly, &ldquo;Though I still think you could do better, Miss Riya.&rdquo;</p>\n<p>Omicron chuckled. &ldquo;Aha! The young lady has the wrong idea of Lady Riya&rsquo;s and my relationship. You see, although Lady Riya certainly seems a very&hellip;a very able sort of person&mdash;&rdquo;</p>\n<p>&ldquo;Ooh! Ouch,&rdquo; muttered Violet.</p>\n<p>&ldquo;&mdash;My affections lean more toward the masculine.&rdquo;</p>\n<p>&ldquo;Oh, you&rsquo;re gay!&rdquo; gushed Violet. &ldquo;Well <i>that </i>makes more sense! I&rsquo;s wondering why Miss Riya had a man over.&rdquo;</p>\n<p>&ldquo;Ouch,&rdquo; said Riya.</p>\n<p>&ldquo;Tell me, Mr. Omicron,&rdquo; said Violet. &ldquo;Are you a teacher, too?&rdquo;</p>\n<p>&ldquo;No!&rdquo; cut in Riya. &ldquo;He&rsquo;s just a, er&mdash;&rdquo;</p>\n<p>&ldquo;Medieval wizard,&rdquo; answered Omicron.</p>\n<p>&ldquo;&hellip;Oh,&rdquo; trilled Violet, her voice several pitches higher than usual. She had managed to retain her smile, though the bun on her head had gone extra frizzy. &ldquo;Neat, that.&rdquo; She turned, teeth clenched in an awkward grin, and mumbled to Riya, &ldquo;Where&rsquo;d you find this guy?&rdquo;</p>\n<p>Riya hung her head. &ldquo;He popped out of an egg.&rdquo;</p>\n<p>Violet&rsquo;s hair went frizzier still. &ldquo;I think I&rsquo;ll get a lemonade,&rdquo; she said, shuffling off to the kitchen.</p>\n<p>Omicron leaned over to pick up the fallen photograph. He stared at it as he collected pieces of glass.</p>\n<p>&ldquo;What scene is this, m&rsquo;lady? It appears to be a military regiment of sorts.&rdquo;</p>\n<p>Riya crouched beside him. &ldquo;That picture was taken when I was in the Royal Military Police.&rdquo; She pointed to herself on the edge of the statuesque brigade, all donning cherry-red berets. &ldquo;And that woman in the middle is Queen Elizabeth.&rdquo;</p>\n<p>&ldquo;Current monarch of Britain? <i>And</i> you&rsquo;re a former warrior? You continue to surprise me, m&rsquo;lady.&rdquo;</p>\n<p>&ldquo;Don&rsquo;t worry about the glass. I can clean it up later.&rdquo;</p>\n<p>&ldquo;No bother.&rdquo;</p>\n<p>As Riya watched, he set shattered pieces on the picture in their approximate places, mumbled something, and snapped his fingers. The shards jerked together like puzzle pieces, their edges melting into one another. The frame looked good as new.</p>\n<p>Riya jerked to her feet, dizzy.</p>\n<p>&ldquo;Wait&hellip;&rdquo; she moaned. &ldquo;What? What!&rdquo;</p>\n<p>Omicron replaced the frame on its hook. &ldquo;Ah good. I figured my powers simply needed a few hours to recharge.&rdquo;</p>\n<p>&ldquo;Omicron,&rdquo; said Riya slowly. &ldquo;You just&hellip; How did you do that?&rdquo;</p>\n<p>&ldquo;What? The repair? Old Egyptian trick.&rdquo;</p>\n<p>&ldquo;Trick?&rdquo;</p>\n<p>&ldquo;Well, spell.&rdquo;</p>\n<p>Violet came back into the room, popped open her can, and tossed herself onto the sofa. Tom Bombadil jumped up beside her and pushed his whiskered cheek against her leg, eyeing Omicron with clear kitty disdain.</p>\n<p>&ldquo;Why you gone all pale, Miss Riya?&rdquo; asked Violet, taking a loud sip of lemonade.</p>\n<p>When Riya only continued to stare at the magically repaired frame, Omicron said, &ldquo;Say, Lady Violet&mdash;&rdquo;</p>\n<p>&ldquo;Call me Vi.&rdquo;</p>\n<p>&ldquo;Lady Vi, would you like to see a demonstration of my magic? I could use the practice.&rdquo;</p>\n<p>Violet snickered behind her drink. &ldquo;Go for it.&rdquo;</p>\n<p>Omicron took a deep breath, set his feet firmly on the carpet, and cracked his knuckles. He began twisting his hips this way and that, tilting his neck, blinking very fast.</p>\n<p>&ldquo;Quite good magic that,&rdquo; Violet articulated, like a proud preschool teacher.</p>\n<p>Then all at once, Omicron began to change. His body quivered and he fell forward onto hands and knees. The wrinkles in his face stretched as his head elongated, his ears slid upward, his eyes turned outward. Fine brown fur sprouted from his skin. Antlers erupted from his brow, branched, sharpened. His clothes tore away as his torso bulged and his limbs stretched. His hands and feet were hooves, stamping haughtily. His cotton-white tail flicked madly. And from his huge nostrils, steamy breath issued in grunts.</p>\n<p>Violet stood up so fast that the poor cat went flying once more.</p>\n<p>&ldquo;Uh, Miss Riya?&rdquo;</p>\n<p>Riya was frozen in place, her mouth hanging open.&ldquo;Yes, Violet?&rdquo;</p>\n<p>&ldquo;The old guy turned into a deer.&rdquo;</p>\n<p>&ldquo;Yes, Violet.&rdquo;</p>\n<p>&ldquo;He&rsquo;s a deer now.&rdquo;</p>\n<p>&ldquo;Yes, Violet.&rdquo;</p>\n<p>&ldquo;Why is he a deer now?&rdquo;</p>\n<p>The deer stamped and snorted. Tom Bombadil hissed and ran for the hall. Violet took a great gulp of lemonade.</p>\n<p>Omicron veered back onto his hind legs, antlers scraping the ceiling, and a moment later he was human again, though his appearance had traded one type of &lsquo;buck&rsquo; for another.</p>\n<p>&ldquo;Ta-da!&rdquo; he sang, arms flung to the sides. &ldquo;What do you think?&rdquo;</p>\n<p>&ldquo;I think you&rsquo;re naked, Omicron!&rdquo; shouted Riya, shaking herself back to reality and rushing Violet from the room. She returned with a flowered dressing gown and thrust it at Omicron. &ldquo;And I think you&rsquo;re&hellip;you&rsquo;re&hellip; Bloody hell. I can&rsquo;t even&hellip; You&rsquo;re the real thing, aren&rsquo;t you?&rdquo;</p>\n<p>He pulled on the gown. &ldquo;Aye. I am.&rdquo;</p>\n<p>She took a step closer. The room seemed somehow smaller and dimmer to Riya, and Omicron seemed larger, taller, stronger, even younger&mdash;some of his wrinkles had faded.</p>\n<p>&ldquo;This can&rsquo;t be happening,&rdquo; said Riya, her voice a scratch in the back of her throat. &ldquo;What&rsquo;s going on? Why are you here?&rdquo;</p>\n<p>His smile faded. &ldquo;I&rsquo;ll tell you, m&rsquo;lady, but you might want to sit down.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section5>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>&ldquo;So,&rdquo; concluded Riya, taking a deep breath, &ldquo;you&rsquo;re telling me that it&rsquo;s all real&mdash;the old legends, the gods, all that magic and mayhem.&rdquo;</p>\n<p>Omicron finished his third cup of tea with a smack of the lips. &ldquo;Aye, they&rsquo;re real. But &lsquo;tis different now. The gods are far away and have limited ways of affecting life on Earth. But there <i>are</i> ways, and that&rsquo;s where people like me come into play. Servants of Order. Gate-sealers. Monster-hunters. Secret-keepers.&rdquo;</p>\n<p>&ldquo;But you make it sound like some divine will woke you up today&mdash;or was it <i>yesterday</i>? I&rsquo;ve lost track of time. That farmer found your obovoid by accident.&rdquo;</p>\n<p>&ldquo;By accident? You think so?&rdquo; The old man smirked knowingly. &ldquo;I&rsquo;ve yet to determine with certainty the <i>why</i> of my resurrection, but I believe the <i>who</i> behind it is obvious. <i>Arianrhod</i>.&rdquo;</p>\n<p>Riya shook her head. &ldquo;I don&rsquo;t know what that is. Ah-ryan-rod?&rdquo;</p>\n<p>&ldquo;Arianrhod is the Celtic goddess of rebirth. I have had dealings with her before, long ago. Delightful spirit! I suspect &lsquo;twas by her sacred power that I have awoken.&rdquo;</p>\n<p>&ldquo;But why?&rdquo;</p>\n<p>Omicron twirled one of his golden-gray curls around a finger. They could hear Violet snoring gently on the sitting room sofa.</p>\n<p>&ldquo;Why indeed,&rdquo; mused Omicron. &ldquo;I can only guess at the moment. But I sense a sort of&hellip;energy, like an itch beneath my skin. An imbalance in the atmosphere. I&rsquo;ve felt it ever since I awoke, and it&rsquo;s getting stronger. It seems we&rsquo;ve reached another tipping point in the history of gods and humankind. Powers are blossoming. Both sides ready themselves for a struggle. Therein lies my purpose. I don&rsquo;t know what it is the goddess wishes me to do, but I suspect it will take place in this region.&rdquo;</p>\n<p>&ldquo;In the village or just in Wales?&rdquo;</p>\n<p>&ldquo;I don&rsquo;t yet know. Say, might I beg for one final cup of this splendid tea?&rdquo;</p>\n<p>&ldquo;Sure.&rdquo; Riya stood and walked to the stove. &ldquo;What are your immediate plans?&rdquo;</p>\n<p>&ldquo;To act fast. I&rsquo;ve wasted enough time already. I must prepare myself and retrieve the tools of my trade. Speaking of which, does m&rsquo;lady remember seeing a small chest in the obovoid&rsquo;s remains?&rdquo;</p>\n<p>Riya yawned into the back of a hand. &ldquo;Hm? Yeah, I do. A wooden box. It fell out right before you did.&rdquo;</p>\n<p>&ldquo;Where is it now?&rdquo;</p>\n<p>&ldquo;The inspector picked it up. He couldn&rsquo;t open it. I suppose it&rsquo;s back at the police station.&rdquo;</p>\n<p>&ldquo;Then that&rsquo;s where I&rsquo;m headed, as soon as I&rsquo;ve finished my tea, of course.&rdquo;</p>\n<p>&ldquo;The station&rsquo;s closed. You&rsquo;ll have to wait until Monday.&rdquo;</p>\n<p>The kettle whistled and Riya hurried to pull it off the burner before it woke Violet. She filled a mug, then on reflection, a second and third.</p>\n<p>&ldquo;Something tells me I won&rsquo;t be able to talk you out of marching down to the station tonight, will I?&rdquo; asked Riya.</p>\n<p>&ldquo;Nay, m&rsquo;lady.&rdquo;</p>\n<p>&ldquo;Then I&rsquo;m coming too. I promised Bronwyn that I&rsquo;d watch after you.&rdquo;</p>\n<p>&ldquo;Your presence would be gladly welcome.&rdquo;</p>\n<p>&ldquo;Wh-what about me?&rdquo; asked a groggy Violet, stumbling into the kitchen. &ldquo;Heard the tea&hellip; What time is it? Where you going?&rdquo;</p>\n<p>&ldquo;It&rsquo;s two in the morning,&rdquo; said Riya, checking the microwave clock. &ldquo;Sorry to wake you, Violet. Omicron needs something down at the police station.&rdquo;</p>\n<p>Omicron rubbed his hands together excitedly. &ldquo;We&rsquo;re robbing a constable&rsquo;s keep!&rdquo;</p>\n<p>&ldquo;Well, alright then!&rdquo; said Violet, perking up. &ldquo;Sounds like fun. I&rsquo;m in!&rdquo;</p>\n<p>&ldquo;We are <i>not</i> going to break in,&rdquo; said Riya. &ldquo;I&rsquo;ll call Bronwyn on the way and have her meet us there. And if you insist on tagging along, Violet, you <i>will </i>wait in the car.&rdquo;</p>\n<p>&ldquo;Ah, no! Not that smelly old Nova,&rdquo; the girl whined.</p>\n<p>&ldquo;I&rsquo;ll be sure to upgrade to an Aston Martin when I get my next raise.&rdquo;</p>\n<p>&ldquo;Just let me go in with you two, Miss Riya!&rdquo;</p>\n<p>&ldquo;You&rsquo;ll wait in the car.&rdquo;</p>\n<p>Recharged with Earl Gray, they all pulled on winter coats and left the cottage to squeeze into Riya&rsquo;s mustard-colored &rsquo;93 Vauxhall Nova.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section6>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>Riya parked around the corner from the police station and jammed a finger onto her phone screen irritably.</p>\n<p>&ldquo;Why isn&rsquo;t she answering!&rdquo; She shoved the phone into her coat pocket.</p>\n<p>Omicron opened the passenger side door and stepped out. &ldquo;You tried contacting your constable friend, but now &lsquo;tis time I go in.&rdquo;</p>\n<p>&ldquo;You can&rsquo;t. It&rsquo;ll be locked.&rdquo;</p>\n<p>Omicron chortled. &ldquo;Poppycock.&rdquo;</p>\n<p>As he sauntered off, Riya groaned and opened her own door. &ldquo;Stay here, Violet,&rdquo; she said to the back seat. &ldquo;And&mdash;Are you posting something online? You know you could get me fired!&rdquo;</p>\n<p>&ldquo;I&rsquo;s only texting Trev. I think we might be getting back together.&rdquo;</p>\n<p>&ldquo;Course you are.&rdquo;</p>\n<p>She shut her door gently and walked along the cobblestone road, the click of her cane echoing through the claustrophobic labyrinth of alleyways, storefronts, rubbish bins, parked cars, and empty windows that made up the center of the village.</p>\n<p>&ldquo;Are you chatting with that door handle, Omicron?&rdquo; Riya asked in a whisper as she approached the front of the station.</p>\n<p>Omicron shushed her and gave the door a little stroke. &ldquo;Not chatting, <i>charming</i>,&rdquo; he said, and snapped his fingers. The doorknob clicked and twisted on its own. The door swung inward.</p>\n<p>Riya reached out and grabbed the door before Omicron could enter. &ldquo;You can&rsquo;t just go busting into places! We&rsquo;ll both get arrested.&rdquo;</p>\n<p>&ldquo;Arrested?&rdquo; The airiness and mirth had gone from his voice. &ldquo;You said it yourself, m&rsquo;lady. Gods, magic, mayhem. All real. All dangerous. That is what we&rsquo;re up against. Not local ordinances. If you wish to continue being a part of this misadventure, you best expand your mind and get your priorities straight.&rdquo;</p>\n<p>He ducked under her arm and slipped inside. After a moment, Riya followed.</p>\n<p>&ldquo;Don&rsquo;t turn on the lights,&rdquo; she said. &ldquo;It&rsquo;ll alert the neighbors. Here, I brought a torch.&rdquo;</p>\n<p>She turned on the torch and they moved about the room, peering behind the reception desk, into the cubicles, and into the empty cells. While searching the chief constable&rsquo;s office in the back of the station, they found the wooden chest tucked away in a corner beneath a neon vest.</p>\n<p>&ldquo;Ah, there you are, darling!&rdquo; Omicron lifted the chest onto the chief&rsquo;s desk.</p>\n<p>Riya was about to ask how to open the chest, not seeing any lid, but Omicron had already done so&mdash;somehow. He was pulling out folded garments of silk and leather.</p>\n<p>&ldquo;Finally, some <i>real</i> clothes again. Boots and all!&rdquo;</p>\n<p>&ldquo;We better not have broken in here just to get you some new clothes.&rdquo;</p>\n<p>&ldquo;Not just any clothes. Specifically, <i>this</i>.&rdquo; He reached into the bottom of the chest and lifted something out.</p>\n<p>Riya aimed her torch. &ldquo;What is it?&rdquo;</p>\n<p>&ldquo;The <i>Gauntlet of Camelot</i>. It is, if I do say so myself, one of the greatest devices ever dreamed up. Certainly one of <i>my </i>finest inventions.&rdquo;</p>\n<p>Riya stepped closer. She had to admit that the gauntlet was a thing of beauty. It had a leather wrist guard engraved with Celtic symbols, with leather straps and silver buckles. The guard was attached to a brass-scaled glove with leather fingers. On the back of the hand, fixed in place, was a small, egg-shaped gem, deep purple with bands of brown and black.</p>\n<p>&ldquo;You see that ovoid gem? It&rsquo;s a polished piece of petrified wood,&rdquo; whispered Omicron, wonder plain in his voice. &ldquo;And it is a piece of true legend. That gem gave King Arthur&rsquo;s sword its power. I saw a story in one of your history books, m&rsquo;lady, about the <i>sword in the stone</i>? It seems historians got it back to front. &lsquo;Twas not the sword in the stone, but the <i>stone in the sword</i>. This gem, fixed in the hilt of <i>Excalibur</i>, gave Arthur an enchanted power on the battlefield.&rdquo;</p>\n<p>Riya&rsquo;s breathing was slow, deep. Her cheeks grew warm. &ldquo;Really&hellip; I&rsquo;ll be damned. How&rsquo;d it end up in your gauntlet?&rdquo;</p>\n<p>Omicron&rsquo;s expression hardened. &ldquo;When my king was slain in the Battle of Camlann by his bastard son Mordred, Arthur&rsquo;s sword was broken. The vultures of the battlefield fought over the pieces of the blade, but I knew that its true power was in the ovoid stone. I retrieved it, and later, built this.&rdquo;</p>\n<p>&ldquo;And what does it do?&rdquo;</p>\n<p>&ldquo;If one is wearing the gauntlet, any weapon they hold in their hand will have its potency increased exponentially.&rdquo;</p>\n<p>&ldquo;Neat trick, if it works.&rdquo;</p>\n<p>&ldquo;Oh, it works.&rdquo; He set down the gauntlet and lifted a silken shirt. &ldquo;Now then, I am getting changed.&rdquo;</p>\n<p>Riya straightened up. &ldquo;Thanks for warning me this time.&rdquo;</p>\n<p>She left the office, shutting the door behind her, and stood in the main station.</p>\n<p>&ldquo;This is bloody crazy,&rdquo; she said aloud. She pulled out her phone to try Bronwyn Price again. The phone rang once, twice, three times, then <i>beep</i>ed into voicemail. &ldquo;Hey Bronwyn. It&rsquo;s Riya again. I&mdash;er&mdash;don&rsquo;t really know how to say this, but I&rsquo;m actually standing in&hellip;in&hellip; Hang on&hellip; Something&rsquo;s here&hellip; Something&hellip; Igottacallyouback&mdash;&rdquo;</p>\n<p>Riya dropped the phone and her body snapped into a defensive position. She aimed her torch like a weapon, eyes peeled. She had heard something and a fragment of her mind, locked forever in military mode, set her whole body on red alert.</p>\n<p>Spying a truncheon left out on a desk, Riya grabbed it and revolved slowly, torch beam scanning the room.</p>\n<p>A snarl. A flash of green eyes.</p>\n<p>Something huge and hairy erupted from the darkness and slammed into Riya. She tripped over a chair and cracked her head against a desk. Rolling up onto her knees and ignoring the searing pain in her lower back and her head, she swung the truncheon just as her attacker pounced. The weapon vibrated in her hand as it struck its target. The creature didn&rsquo;t budge.</p>\n<p>Riya scooted backward on her knees, squinting at the shape advancing on her, feeling on the ground for her torch. She found it and aimed the beam. For one terrifying second, she saw the light reflect in emerald-green eyes, glint off sharp teeth, play across twitching ears and a hunched back covered in thick black quills. It was like a dog, but so much larger, more gruesome, more revolting than any breed she knew. And its eyes glowed.</p>\n<p>The beast leaped at her.</p>\n<p>Riya whipped up the truncheon and held it tight in both hands as the thing fell upon her. She was flattened, pinned under its clawed feet. The creature&rsquo;s jaw fixed around the truncheon, snapping furiously, sharp teeth straining to chew their way through and sink into her face. She pushed back with all her might but already her arms were shaking. Milky saliva dripped onto Riya&rsquo;s face, sizzling hot.</p>\n<p>&ldquo;Omicron!&rdquo; Riya screamed.</p>\n<p>And he was there, standing beside her, draped in fine clothes, dark boots, and a leather cloak. Omicron raised his right hand, now donning the glittering Gauntlet of Camelot. He squeezed his hand into a fist. He struck.</p>\n<p>The blow came down like a hurricane, crashing into the creature&rsquo;s side, flinging it off of Riya and into a nearby shelf, which shattered. As the beast rose, shaking and drooling, Riya forced herself up and stood beside Omicron.</p>\n<p>&ldquo;Mind if I borrow that?&rdquo; he asked her coolly, nodding at the truncheon in her hands.</p>\n<p>She handed it over. Omicron held it out like a sword, and Riya experienced a very odd sensation. As she stared at the truncheon, she saw that it was still three feet long, black, with teeth marks on its center. Yet at the same time, it seemed to have become something else&mdash;a deadly club, six feet long, glowing blue and haloed with a fringe of rainbow. It was as if a magical, ghostly shell encased the simple weapon.</p>\n<p>The creature crouched, snarled, pounced. Omicron swung his weapon with a wordless battle cry. The creature was blasted from the air, crashed through a window, and slumped onto the street outside. Riya heard glass raining down onto the cobblestones.</p>\n<p>&ldquo;Holy shit! What is that thing?&rdquo;</p>\n<p>&ldquo;A <i>gwyllgi</i>,&rdquo; sneered Omicron. &ldquo;A hound of hell! No doubt sent through some rift in the fabric between realms to make trouble for us. It must have sensed the power of the gauntlet. Come! I can feel the presence of at least two more outside.&rdquo;</p>\n<p>&ldquo;Outside?&rdquo; gasped Riya. &ldquo;Violet!&rdquo;</p>\n<p>She ran, leaving her cane behind, out into the cold night air.</p>\n<p>&ldquo;Violet!&rdquo;</p>\n<p>&ldquo;Oi!&rdquo; Violet called back, rolling down the back seat window. &ldquo;Someone just broke a window&mdash;&rdquo;</p>\n<p>&ldquo;Start the damn car!&rdquo;</p>\n<p>Violet was looking at Riya and so didn&rsquo;t see the green eyes approaching from up the road. A gwyllgi&mdash;Riya didn&rsquo;t know if it was the one from inside or another&mdash;was crouched low and moving fast. Riya ran with awkward steps, teeth gritted against the pain in her spine. She reached the car a second before the hound. She grabbed the driver&rsquo;s side door and yanked it open into the creature&rsquo;s path. The gwyllgi snarled and bucked, wrenching off the door so that it clattered onto the street. Violet turned the key as Riya leaped behind the steering wheel, slammed the stick into reverse, and pounded her foot onto the accelerator.</p>\n<p>Riya had just noticed something rushing into sight in the rearview mirror when the car collided with a second gwyllgi. The back windscreen shattered and the beast rolled over the vehicle, landing ahead of them, legs kicking.</p>\n<p>&ldquo;Effing &lsquo;ell!&rdquo; shrieked Violet, throwing her hands over her head.</p>\n<p>&ldquo;Omicron!&rdquo; Riya shouted, watching the two hounds in the road advance once more.</p>\n<p>The backdoor opened and Omicron climbed in next to Violet, the truncheon now in his left hand and without any magical power.</p>\n<p>&ldquo;Shall we depart?&rdquo; he asked casually.</p>\n<p>The wheels squealed as the car accelerated around the snarling beasts and tore down the winding road.</p>\n<p>&ldquo;What&rsquo;s happening?&rdquo; simpered Violet. &ldquo;Did you see the size of that dog?&rdquo;</p>\n<p>&ldquo;Where are you taking us, m&rsquo;lady?&rdquo; asked Omicron.</p>\n<p>&ldquo;Go to the police!&rdquo; shouted Violet.</p>\n<p>&ldquo;We just came from the bloody police station!&rdquo; Riya shrieked, swerving the car into a shortcut that obliterated a postbox and three azalea bushes. &ldquo;We&rsquo;re going back to my place. There&rsquo;s something I need.&rdquo;</p>\n<p>In the rearview mirror, the three gwyllgi pursued them like speeding cheetahs. One caught up and ran along the car&rsquo;s left side, snapping its jaws at the windows. Another came alongside the car&rsquo;s right, glaring at Riya through the missing door with eyes like shamrock flames. Riya jerked the wheel right and left. The car swerved and tilted, slamming into one hound and then the other. Both gwyllgi fell back, yelping.</p>\n<p>&ldquo;We&rsquo;re almost there!&rdquo; shouted Riya. &ldquo;Omicron! I need you to buy me some time! Can you do that?&rdquo;</p>\n<p>&ldquo;Right ho.&rdquo;</p>\n<p>Omicron twisted in his seat, flexed the fingers of his gauntleted hand, and cupping the hand in front of his mouth, blew. His breath whistled out the shattered back windscreen. The air behind the car brightened in a magically-appearing cloud of silver shapes. The phantoms spun and danced, formless and playful, and the galloping gwyllgi leaped and snapped their jaws at the light.</p>\n<p>&ldquo;How long will it distract them?&rdquo; asked Riya, glancing at the magical shapes in her mirror.</p>\n<p>&ldquo;Perhaps a minute.&rdquo;</p>\n<p>Riya nodded. &ldquo;Okay. Okay, okay. I got this.&rdquo;</p>\n<p>She swerved down her street and the moonlit megaliths came into view. The car bumped and rattled down the hill and crunched to a stop in front of her cottage.</p>\n<p>Riya hurtled herself from the car and through the front door, then into the bedroom. She threw herself on the floor beside her bed and pulled out a locker from underneath it. She entered the code and opened the locker. Setting aside a folder of official documents detailing her unique permission to own and use the objects within, Riya lifted out a belt and holster. Rising, she fixed the belt around her waist and stomped from the cottage.</p>\n<p>&ldquo;Whoa,&rdquo; said Violet from the back seat as her teacher emerged. &ldquo;You look&hellip;different.&rdquo;</p>\n<p>Riya popped orange earplugs into her ears. She pulled a pistol from her holster, slid in a 15-round magazine, and yanked back the slide to load the first cartridge into the chamber.</p>\n<p>&ldquo;What tool is this then?&rdquo; asked Omicron, stepping from the car and eyeing the pistol doubtfully. &ldquo;An arm of fire?&rdquo;</p>\n<p>&ldquo;It&rsquo;s a Sig Sauer P226 MK25 9mm. And it&rsquo;s gonna demolish those hounds.&rdquo;</p>\n<p>&ldquo;Hm. Right,&rdquo; mumbled Omicron, moving the truncheon to his right hand so that the ghostly blue light returned.</p>\n<p>&ldquo;Cover your ears, Violet. You too, old man, if you know what&rsquo;s good for you.&rdquo;</p>\n<p>Two of the gwyllgi appeared at the end of the driveway and skidded down the hill. Riya delivered six shots in quick succession, the pistol thundering in her hand, the bullets pelting at the first hound. It squealed, fell, rolled in a spray of shimmering green blood. As it rose drunkenly and hobbled sideways, dripping blood, Riya adjusted her aim and shot three times at the second hound. It scurried off the driveway to hide in the woods. Five more shots rang out, blasting off chunks of tree bark. Spent cartridge cases rained into the grass at Riya&rsquo;s feet.</p>\n<p>&ldquo;Miss Riya!&rdquo; shouted Violet. &ldquo;On your left!&rdquo;</p>\n<p>The third and final gwyllgi darted from the darkness at the side of the garden and pounced. It soared through the air, claws extended, jaws open, and just as it was about to land on Riya&rsquo;s shoulders, she spun and fired her last bullet into its open mouth. Emerald blood misted the air. The creature flipped backward and crashed down onto the slick grass.</p>\n<p>Riya ejected the pistol&rsquo;s magazine, loaded another from her belt, and pushed the slide release.</p>\n<p>&ldquo;Ohmygod!&rdquo; squeaked Violet. &ldquo;Miss Riya&rsquo;s a badass.&rdquo;</p>\n<p>Omicron approached the fallen gwyllgi and brought his glowing truncheon down upon its bleeding head, smashing away any remaining life.</p>\n<p>Riya turned and aimed at the first two hounds, both of which stalked in menacing circles at the edge of the garden, crouched and bleeding.</p>\n<p>&ldquo;There&rsquo;s no need,&rdquo; said Omicron. &ldquo;The brutes know you&rsquo;ve won the night. They&rsquo;ll gather their dead and descend back into the darkness from whence they came.&rdquo; He looked over at Riya and shook his head, his expression dumbstruck. &ldquo;My, my. &lsquo;Tis nice to finally meet Lady Riya the Warrior.&rdquo;</p>\n<p>Riya rounded on him, sliding her pistol into its holster and glaring into his face.</p>\n<p>&ldquo;You think this is a game to me?&rdquo; she shouted. &ldquo;Violet is a child! She is one of my students. She could have been <i>killed </i>tonight!&rdquo;</p>\n<p>&ldquo;Aye, well&mdash;&rdquo; Omicron began, but Riya cut him off.</p>\n<p>&ldquo;Whatever the hell is going on here, whatever the hell you&rsquo;ve got us mixed up in, I need to know <i>everything</i>. Do you hear me, Omicron?&rdquo;</p>\n<p>&ldquo;Of course, of course.&rdquo; He watched as one of the hounds came forward, tail tucked between its legs. It bent to bite its fallen comrade&rsquo;s tail and dragged the body into the shadows. &ldquo;I had suspicions as to why Arianrhod awoke me. I thought perhaps one of the other gods was planning some sinister scheme and &lsquo;twas my job to stop them. This confirms my fears. <i>He</i> is behind tonight&rsquo;s horror.&rdquo;</p>\n<p>&ldquo;Who?&rdquo;</p>\n<p>Omicron closed his eyes and inhaled the cold night air. &ldquo;The gwyllgi have forever been the servants&hellip;of <i>Arawn</i>.&rdquo;</p>\n<p>The hair on the back of Riya&rsquo;s neck stood on end. &ldquo;I&rsquo;ve heard of that one. Celtic god of war and chaos, right? And ruler of the underworld?&rdquo;</p>\n<p>&ldquo;Indeed. Not a pleasant fellow. In the old days, he had a thing for monsters&mdash;used to breed them in his land, Annwn, and set them loose upon the Earth. Arawn must be regaining some of his old powers. He must be planning to awaken the old monsters.&rdquo;</p>\n<p>Riya patted the P226 at her side. &ldquo;Well, if his monsters can be taken out with a headshot, it shouldn&rsquo;t be too hard to handle them.&rdquo;</p>\n<p>Omicron looked at her, his lips pursed and brow furrowed. &ldquo;<i>These</i> aren&rsquo;t monsters, m&rsquo;lady! The gwyllgi are but minions, furry little henchmen to be Arawn&rsquo;s eyes as he prepares for the true assault.&rdquo;</p>\n<p>&ldquo;But you said&mdash;&rdquo;</p>\n<p>&ldquo;I said he would release a monster, probably nearby, probably soon. But he hasn&rsquo;t&hellip;yet.&rdquo;</p>\n<p>Riya peered around her garden, up the megalith-crested hill, into the trees. &ldquo;You really think there&rsquo;s some great primeval beast buried under St. Pyr, sleeping soundly?&rdquo;</p>\n<p>&ldquo;Aye, m&rsquo;lady, and if I&rsquo;m not wrong, &lsquo;tis about to wake up.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section7>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>Sunlight was slicing through the curtains when Riya awoke from a deep and dreamless sleep. She was surprised when she saw the clock. She had expected to be roused in the early morning by the sounds of sirens and the rough hands of constables dragging her out of bed and down to the ruined police station. But no. The cottage was cool, quiet, and smelled of sausages.</p>\n<p>She yawned as she stepped into the kitchen. The sink was full of dishes. Violet sat at the table, squinting at the screen of Riya&rsquo;s laptop. Past the sitting room door frame, Riya could see Omicron&rsquo;s bare feet extending over the sofa armrest.</p>\n<p>&ldquo;This is a sight to behold,&rdquo; said Riya. &ldquo;Violet Connah is reading history articles on Wikipedia, while Omicron the sorcerer eats sausage and watches&hellip; Is that Indiana Jones? Strange scene to wake up to. Say, why aren&rsquo;t we in jail?&rdquo;</p>\n<p>&ldquo;Oh that!&rdquo; Omicron paused his movie and sat up to peer into the kitchen. &ldquo;It seems this reawakened body of mine requires no sleep whatsoever. Convenient, nay? So I took the liberty of slipping out after you ladies were asleep and tidying up the station.&rdquo;</p>\n<p>&ldquo;Tidying up?&rdquo;</p>\n<p>&ldquo;Looks good as new! More or less. And I brought back your mobile telephone and cane. Oh, and I saw the file they had about my obovoid, so I made a quick call to the Cardiff Archaeological Council first thing this morning. I assured them that they wouldn&rsquo;t need to come up on Monday after all, as the events reported to them yesterday were clearly a hoax. As long as you can convince your constable friend that there&rsquo;s no need for further inquiry, I think we are in the clear to get on with our monstrous search.&rdquo;</p>\n<p>&ldquo;<i>I&rsquo;m</i> the one searching,&rdquo; complained Violet from the table. &ldquo;<i>He&rsquo;s</i> just been streaming movies all day! He might have been a genius back in the Dark Ages or whatever, but he can&rsquo;t even use a keyboard!&rdquo;</p>\n<p>Omicron nibbled the sausage on his fork and grimaced. &ldquo;&lsquo;Tis true! I&rsquo;ve no knack for this new brand of sorcery you call computer science. Besides, it is important for me to catch up on the latest ballads and epics of our world!&rdquo; He pushed play and settled back on the sofa.</p>\n<p>Riya leaned over Violet&rsquo;s shoulder. The screen showed a list of Celtic legendary creatures.</p>\n<p>&ldquo;Find anything?&rdquo;</p>\n<p>&ldquo;Lots, but most of it sounds like rubbish. But I did see something about those crazy gwiggly dog things from last night.&rdquo;</p>\n<p>Riya regarded her student carefully. &ldquo;You seem to be taking all this surprisingly well. The magic, the creatures. I feel like I can barely hold it together myself. It&rsquo;s like a dream or something.&rdquo;</p>\n<p>&ldquo;It&rsquo;s cool! And I&rsquo;s so scared last night, and so busy trying not to piss myself, that I didn&rsquo;t think to take any pics! That&rsquo;s why I want to find this monster Omicron keeps talking about. Hey Omicron, could we be looking for a <i>henwen</i>?&rdquo;</p>\n<p>&ldquo;Nay, my dear, I don&rsquo;t believe that Arawn will be resurrecting any fairy pigs. But good try! Keep searching.&rdquo;</p>\n<p>Riya ate a quick breakfast and showered.</p>\n<p>It was with a renewed sense of excitement that she, Omicron, and Violet loaded into the Nova. Omicron had magically repaired most of the damage to the car, but failing to understand the exact mechanics of it, had neglected to reattach the driver&rsquo;s side door in a manner that allowed it to be opened. Riya had to slide her stiff legs through the window and slump awkwardly into the seat. Violet found this highly amusing. Riya did not.</p>\n<p>As they drove, Omicron explained further research he wished Violet to tackle and she agreed to try when she could get online.</p>\n<p>They dropped Violet off in the village center to meet up with friends&mdash;&ldquo;I promise I won&rsquo;t tell them nothing, I won&rsquo;t. They&rsquo;d just say I had a bad trip, anyways!&rdquo;&mdash;and set off to search the area for signs of Arawn&rsquo;s monster.</p>\n<p>&ldquo;Where to first?&rdquo; asked Riya.</p>\n<p>Omicron rolled down the car window and inhaled a breath of village air. &ldquo;West and north, I think. Into the high hills. I want to look down at this landscape from above. I want to <i>see</i> it.&rdquo;</p>\n<p>They drove for an hour to the edge of Snowdonia National Park, where Omicron told Riya to pull over. He got out, paced along the road with his hands behind his back, looked into the misty faces of the forested hills, then peered over them to the distant snowy peaks.</p>\n<p>&ldquo;Higher,&rdquo; he said as he climbed back into the car.</p>\n<p>Half an hour later, Riya pulled into a petrol station. She went in to pay and go to the toilets, and when she came back to the car, she found Omicron sitting on the boot, one hand outstretched and wearing the Gauntlet of Camelot. His eyes were closed. His lips were moving. Riya looked past him but saw only a wide expanse of hilly farms, a maze of hedge roves, a foggy slice of a foggy world.</p>\n<p>&ldquo;What are you doing?&rdquo;</p>\n<p>&ldquo;Looking,&rdquo; he whispered. &ldquo;We should go east, I think! Back toward St. Pyr. The energies were stronger there.&rdquo;</p>\n<p>They drove, Riya offering ideas, pointing at signs to various castles and ruins, bringing up old legends she had half forgotten, but the old man wished only to sniff the air, to stare at trees and passing clouds, to mumble strange words to himself.</p>\n<p>They passed through the heart of St. Pyr and continued up to Dewey Nevitt&rsquo;s farm. From there, they went to the ruins of Wydstow Castle, explored the grounds, and chatted with the tour guide in the gift shop.</p>\n<p>&ldquo;He might of told us more,&rdquo; complained Riya as she slumped through the car window afterward and started the ignition, &ldquo;<i>if </i>you hadn&rsquo;t been flirting with him so much.&rdquo;</p>\n<p>&ldquo;Apologies, m&rsquo;lady. But he was so very cute.&rdquo;</p>\n<p>&ldquo;Yeah, he was.&rdquo; She turned south. &ldquo;We&rsquo;re going home for now. I&rsquo;m hungry, my back hurts, and it&rsquo;s getting late.&rdquo;</p>\n<p>Riya texted Violet when they arrived at the cottage and Violet responded with the message that she would be spending the night with Trev&mdash;&ldquo;Course you are&rdquo;&mdash;so Riya headed to her bed with a bag of crisps. She lay on top of the covers eating and listening to the television in the next room until she fell asleep.</p>\n<p>Riya awoke covered in crumbs, being shaken by an excited Omicron shouting something about sensing psychic tremors to the south. So she yawned and showered and they set off once more, this time driving through flat country and cold rain, looking for something Riya didn&rsquo;t fully understand. It was all so strange to her and had too many uncomfortable implications.</p>\n<p>Her world was a world written in books and on timelines&mdash;despite the inspiring speeches she gave to her classes&mdash;but everything Omicron was telling her challenged that perspective. It seemed that no matter how talented a historian, how passionate, how authentic their desire to learn the truth might be, they could only ever see one side of history. The other side&mdash;those realms of deities and underworlds and dark creatures&mdash;lurked between the pages of every human story, unseen, uncredited, checked only by those like Omicron. History, it seemed, was full of monsters after all.</p>\n<p>By the time they returned to Riya&rsquo;s cottage on Sunday evening, she&rsquo;d had to refill the petrol tank three times. Her back felt as though she had gone through a particularly challenging bout of physiotherapy. She needed to check over the exams for class in the morning. She needed sleep. She needed distraction. She got none of these things.</p>\n<p>&ldquo;What are we missing, goddess dammit! What haven&rsquo;t I thought of?&rdquo; huffed Omicron, collapsing onto the sofa, much to the distress of Tom Bombadil, who had been curled up asleep.</p>\n<p>&ldquo;I&rsquo;ve no idea,&rdquo; sighed Riya, pulling out her pistol from underneath her coat to secure it back in the locker for the night, &ldquo;but I&rsquo;ve got to get ready for tomorrow&rsquo;s class.&rdquo;</p>\n<p>Omicron sat up, the cat biting at the sleeve of his cloak. &ldquo;History class,&rdquo; he muttered. His eyes swiveled to look at the weapon in Riya&rsquo;s hand. &ldquo;A history scholar <i>and</i> a warrior&hellip; I wonder.&rdquo;</p>\n<p>&ldquo;What are you on about?&rdquo;</p>\n<p>He stood, a mad gleam in his eyes. &ldquo;Here I am wandering blindly around the region, looking for clues, when the search was done for me. I was already brought to where I needed to be!&rdquo;</p>\n<p>&ldquo;You mean the farm where we found you?&rdquo;</p>\n<p>&ldquo;Nay, m&rsquo;lady. I mean <i>you</i>. Riya De Moor is the answer.&rdquo;</p>\n<p>&ldquo;<i>I </i>am?&rdquo;</p>\n<p>&ldquo;You are a unique human being.&rdquo;</p>\n<p>&ldquo;Guess that&rsquo;s a step up from <i>a very able sort of person</i>.&rdquo;</p>\n<p>&ldquo;You have a unique set of talents, I mean! Talents that can, and already have, helped me. Of course! <i>You</i> were chosen, Riya De Moor! The silver-winged goddess sent you to find me, to aid me. Even the injury that made you leave your military career and settle here might have been her doing&mdash;&rdquo;</p>\n<p>&ldquo;That was a bloody landmine! You think Arianrhod visited Iraq?&rdquo;</p>\n<p>&ldquo;The ways of the gods are more wondrous and complicated than you can comprehend. Tell me! Why did you move <i>here</i>? To this cottage?&rdquo;</p>\n<p>Riya nodded in the direction of the megaliths on the grassy knoll. &ldquo;The hill, I guess. I just felt&hellip; I wanted to be near it.&rdquo;</p>\n<p>&ldquo;The hill!&rdquo; gushed Omicron. He began to bounce on the balls of his feet, cackling like a lunatic, clapping his hands. &ldquo;Of course! But how to be sure? Aha! A simple spell should do the trick.&rdquo;</p>\n<p>He dashed to the kitchen and returned with a cup of writing utensils. Snatching out a black marker, he dropped the rest and raced to the wall.</p>\n<p>&ldquo;Watch it!&rdquo; snapped Riya. &ldquo;That&rsquo;s permanent!&rdquo;</p>\n<p>But Omicron was already drawing outlandish symbols on the floral wallpaper. He sprawled them out in a five-part pattern, muttering all the while, then connected the symbols with a pentagram shape.</p>\n<p>&ldquo;Done! Now a little extra <i>oomph</i> and&hellip;&rdquo;</p>\n<p>He raised his hands, spread his fingers, spoke a silky word.</p>\n<p>The writing on the wall began to shimmer, first white, then gold, then red. It peeled off the wall like strips of fire, hung in the air, and began to float through the room.</p>\n<p>&ldquo;So much for permanent,&rdquo; muttered Riya.</p>\n<p>Omicron shushed her and moved along behind the suspended shapes. They drifted toward the front door, then seemed to melt through it. Omicron threw open the door and stepped out onto the porch, Riya right behind him.</p>\n<p>The sun had almost set. They watched the glowing shape join the dusk and drift across the garden toward the knoll. It landed on the grassy slope, blurred, disappeared.</p>\n<p>&ldquo;I should have known,&rdquo; said Omicron. &ldquo;I should have&mdash;&rdquo;</p>\n<p>The ground quaked, knocking Riya sideways into the doorframe. The very air seemed to groan. The trees shook. The cottage rattled.</p>\n<p>&ldquo;What did you do, Omicron?&rdquo;</p>\n<p>Omicron, grabbing onto the porch rail for support, said, &ldquo;&lsquo;Tis possible&mdash;<i>ooph!</i>&mdash;that in my current state of excitement, I pushed the magic in this place a bit too far. Sped up the process. Set things in motion, as it were.&rdquo;</p>\n<p>&ldquo;Look at the hill!&rdquo;</p>\n<p>The knoll was moving, rising, turning.</p>\n<p>&ldquo;It&rsquo;s not a hill,&rdquo; said Omicron, rolling up his sleeves. &ldquo;Best not put away that pistol of yours, m&rsquo;lady. We&rsquo;ve found our monster.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section8>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>Omicron&rsquo;s shaking hands scattered cutlery, dishes, and cookbooks. He lifted a kitchen knife, grunted, and set it down again.</p>\n<p>&ldquo;Don&rsquo;t you have <i>any </i>other weapons in this place?&rdquo; he shouted. &ldquo;A mace? An axe? A scythe?&rdquo;</p>\n<p>Riya peaked through the front window curtains. The knoll was tearing itself into pieces, spraying chunks of sod, dirt, and stone to every side. She thought she saw a huge, scaly leg kicking at the ground and what looked like a long curved neck struggling to free itself from the earth.</p>\n<p>&ldquo;Nothing but my pistol. Why would I own a scythe?&rdquo;</p>\n<p>&ldquo;For scything, of course!&rdquo; Omicron ran into the sitting room and began tossing aside couch cushions and the pictures on the wall.</p>\n<p>&ldquo;Now you&rsquo;re just wrecking the place,&rdquo; said Riya. &ldquo;Should I lock the front door?&rdquo;</p>\n<p>&ldquo;Oh aye, by all means, lock the front door! That&rsquo;ll stop it!&rdquo;</p>\n<p>&ldquo;No need to be nasty.&rdquo;</p>\n<p>Omicron stomped back into the kitchen to retrieve the knife. &ldquo;It&rsquo;ll have to do,&rdquo; he whimpered, sliding the blade into a cloak pocket. &ldquo;Come! We should attack at once!&rdquo;</p>\n<p>&ldquo;We don&rsquo;t have a plan. We need to get the police and military. We need to evacuate the village.&rdquo;</p>\n<p>&ldquo;No use, any of it! The best chance we have is to kill it before &lsquo;tis fully awake. I couldn&rsquo;t use my powers for a few hours after awakening. Hopefully, we see the same thing now. I doubt the monster will be able to fly or breathe flames just yet. Follow me!&rdquo;</p>\n<p>He hurried to the front door, but Riya&rsquo;s feet had glued themselves to the carpet.</p>\n<p>&ldquo;Uh. Fly? Breathe fire? So is it really a&mdash;&rdquo;</p>\n<p>&ldquo;Aye.&rdquo;</p>\n<p>&ldquo;Fan-damn-tastic.&rdquo;</p>\n<p>She took her cane in one hand and her P226 in the other and joined the wizard outside. As they moved across the trembling garden, Omicron pulled on his gauntlet and fastened it tight. He pulled the knife from his pocket with his left hand, weighed the blade in his palm, then flipped it in the air to catch in his gauntleted right hand. Riya stared at the eight inches of steel and the plastic handle&mdash;<i>and</i> at the gleaming ghost of a blue-silver sword projected over and around it, casting ethereal light across the darkening garden.</p>\n<p>She took a deep breath, let her cane fall to the ground, and raised her pistol.</p>\n<p>The knoll was gone, its scattered remains tumbled into the garden and surrounding woods. In its place loomed a crouching monster, seventy feet from smoking snout to terrible tail. Much of its body was still covered in dirt and rock, but where exposed, its scales were red&mdash;as bright and garish as the dragon on the Welsh flag. It groaned, beat a clawed foot against the ground, and began to pull itself upright. Leathery wings folded against its side, streaked with gray slime. Its ghastly head reared and snorted, red eyes blinking. Its horns were like spikes of granite. Its back was lined with a row of megaliths along the spine, each scratched with centuries of graffiti.</p>\n<p>Omicron raised his magic blade in both hands.</p>\n<p>&ldquo;Awake, ye pest of night! Awake and look with eyes of fire on the source of your destruction! See the blade that will sever your hideous head from its scaly shoulders! This blade&hellip;&rdquo; He paused and looked over at Riya. &ldquo;What do you call it?&rdquo;</p>\n<p>&ldquo;It&rsquo;s a bread knife.&rdquo;</p>\n<p>Omicron scowled and turned back to the dragon. &ldquo;The deadly blade of&hellip;of Bread Knife will be the last thing you see before your demon soul is flung down into the Abyssal Sea! Here stands Omicron! Reawakened Servant of Order! Wielder of the Gauntlet of Camelot! And beside me stands the infamous Riya De Moor! She&hellip; Well&hellip;&rdquo;</p>\n<p>&ldquo;I teach at the local secondary school. Sixth form history.&rdquo;</p>\n<p>&ldquo;Well that&rsquo;s not going to intimidate it!&rdquo; he hissed back.</p>\n<p>The dragon gave a great smokey cough, beat its neck from side to side, flapped its huge wings feebly.</p>\n<p>&ldquo;Awake and face Death!&rdquo; bellowed Omicron, taking a step forward. &ldquo;Or else turn, lay yourself down, drift back into your diabolical dreams. We will cover you with earth. We will cover you with flowers. You do not have to die today, dragon! You do not have to die for the foul schemes of your master. Arawn is not here to torture you with whips of fire. He is trapped in Annwn, far away. He cannot harm you here!&rdquo;</p>\n<p>For a moment the dragon was silent and still, then its nostrils blew geysers of hot steam and its eyes widened. Its vast jaws opened&mdash;all gleaming teeth, drooling gums, snaking tongue&mdash;and it roared at them.</p>\n<p>Riya put her hands over her ears. The blast of sound knocked her a pace backward.</p>\n<p>&ldquo;Can I try shooting it now?&rdquo; she asked, when the roaring ceased.</p>\n<p>&ldquo;By all means,&rdquo; said Omicron.</p>\n<p>He launched himself forward and to the left, running with a speed and agility any Royal Marine would be jealous of. Riya aimed her pistol into the dragon&rsquo;s face and fired one shot after another, limping forward as her finger squeezed the trigger, ears ringing. The bullets pinged off the dragon&rsquo;s scales in a shower of sparks. It sneered, snarled, looked from Omicron to Riya and back again, then turned its colossal body and charged for the old man.</p>\n<p>Omicron ducked and rolled under its galloping legs. He slid on his knees behind the dragon and spun to his feet.</p>\n<p>&ldquo;Watch the tail!&rdquo; Riya shouted, still firing.</p>\n<p>Omicron sidestepped as the great barbed tail whipped down beside him, shaking the ground. He stabbed his glowing blade deep into the flesh of the tail. The dragon belched a ball of black smoke. It swung its tail upward, flinging Omicron high in the air. He tumbled onto the ground, shook himself, stood.</p>\n<p>His weapon, now an ordinary bread knife, remained lodged in the dragon&rsquo;s tail, swinging twenty feet off the ground.</p>\n<p>&ldquo;I need a weapon!&rdquo; he shouted.</p>\n<p>Riya reloaded and began emptying her next magazine at the dragon&rsquo;s belly, its shoulders, its ears, trying to find a weak spot. &ldquo;Aren&rsquo;t you a ruddy sorcerer?&rdquo;</p>\n<p>&ldquo;Oh, right ho!&rdquo;</p>\n<p>Omicron fell to his hands and knees, arched his back, stretched his neck. Fur sprouted across his skin and his limbs stretched. Antlers forked into being. Hooves kicked off his boots and gauntlet. Most of his other clothes tore away, but the leather cloak remained hooked around his neck, and as the deer galloped forward and charged the dragon from behind, the cloak flowed like a cape.</p>\n<p>Riya stopped firing as Omicron galloped into her line of sight. The deer ducked gracefully below another swipe of the tail and leaped onto the dragon&rsquo;s back. It drove its sharp antlers into the monster, right between its wings, bucking, tearing, spraying ruby blood into the evening air. The dragon reared onto its hind legs, rocking its body forward and backward, then with one mighty beat of its wings, it flew ten feet off the ground, tilted backward, and let itself fall with a great crunch.</p>\n<p>&ldquo;Omicron!&rdquo; Riya screamed, limping forward as the dragon rolled back to its feet. The wounded form of the wizard, now half man, half deer, lay among the stone and sod, twitching under his cloak.</p>\n<p>The dragon let out a cough of victorious smoke and turned on the woman. It crouched low to the ground and leered its head forward, jaws snapping. Riya spun, the rough snout scraping along her tumbling body, and managed to grab hold of a tooth. She pulled herself up against the side of the dragon&rsquo;s head, placed the barrel of her pistol against its right eye, and pulled the trigger.</p>\n<p>She had time for three blood-splattering shots before the dragon yanked back its head and she fell to her knees. As the dragon roared and scraped with a clawed foot at its ruined eye, Riya pulled herself up and limped as fast as she could to where Omicron&rsquo;s clothes lay in tatters. She set down her pistol, lifted the Gauntlet of Camelot, and slammed it onto her right hand.</p>\n<p>&ldquo;This had better work,&rdquo; she grunted, tightening the buckles and grabbing her P226 in her left hand.</p>\n<p>She stood with a groan.</p>\n<p>The dragon faced her, erect and fuming, blood streaming from its marred right eye. It opened its mouth and Riya felt the heat building, saw an orange glow in the back of the throat, smelled sulfur on the air.</p>\n<p>She shifted the gun to her right hand, tightened her gauntleted fingers on the grip, and felt her hand go strangely numb and warm.</p>\n<p>&ldquo;History came alive.&rdquo; She raised the pistol, marveling at the magical cannon it had become, etched with swirls of ghost-blue light, shining in her fist. &ldquo;And now I&rsquo;m gonna blow its goddess-damn head off.&rdquo;</p>\n<p>The phantasmal gun roared. The magically-enhanced bullet flew. It struck with a <i>crack!</i> between the monster&rsquo;s eyes and split the great skull in two. Blood rained. The dragon&rsquo;s smoking throat released a gurgling growl, and the great beast slumped to the side, crushing pines as it fell.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section9>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>The wizard groaned and sat up slowly on the sofa.</p>\n<p>&ldquo;Good goddess!&rdquo; he moaned. &ldquo;What happened?&rdquo;</p>\n<p>Riya came in with two steaming mugs. &ldquo;A dragon fell on you. I&rsquo;m amazed you&rsquo;re still alive. Tea?&rdquo;</p>\n<p>He shook his head, cringing with the gesture.</p>\n<p>All the energy and strength Omicron had gained since his dramatic arrival in the present had vanished. He looked thin and hunched again, bruised, more wrinkled than ever.</p>\n<p>&ldquo;Did we win?&rdquo; he asked weakly.</p>\n<p>&ldquo;<i>I </i>won. With a headshot, I&rsquo;ll have you know. Though the gauntlet helped.&rdquo;</p>\n<p>He slid his trembling legs over the edge of the sofa and tried to stand.</p>\n<p>&ldquo;Whoa. Slow down. You need rest,&rdquo; said Riya, setting down the mugs and rushing to help him. &ldquo;It&rsquo;s done. The monster&rsquo;s dead.&rdquo;</p>\n<p>&ldquo;<i>One</i> monster. But how many more to go?&rdquo; He looked at Riya, and though his brown and green eyes were tired, there was an undeniable twinkle in the gaze. &ldquo;Did you really think it&rsquo;d be as easy as that, m&rsquo;lady? Nay, nay. Arawn began his assault in lands where he used to be worshipped&mdash;far simpler that way&mdash;but he&rsquo;s only just getting started. This globe will rock with the pounding of monstrous paws.&rdquo;</p>\n<p>Riya took his hand and helped him to his feet, then wrapped the sheet around him like a toga.</p>\n<p>&ldquo;Does Arianrhod really expect one old sorcerer to deal with all that?&rdquo; asked Riya.</p>\n<p>&ldquo;Of course not! One monster in Wales, one resurrected warrior. That&rsquo;s how it will go. Wherever Arawn awakens a monster, there too, Arianrhod will have a warrior ready. God versus Goddess. Beast versus hero. And we must be there to greet the heroes when they emerge from their deep slumbers and help them with their hunts.&rdquo;</p>\n<p>&ldquo;We?&rdquo;</p>\n<p>Outside, the sound of a siren grew louder. Riya glanced at the curtains and saw flashes of blue light through the cloth.</p>\n<p>She sighed. &ldquo;Shit. Now I have to explain why there&rsquo;s a dragon corpse in my garden.&rdquo;</p>\n<p>Helping one another with arms draped over shoulders, Riya and Omicron hobbled onto the porch, shielding their eyes from the glare of headlights shining in the night. A lone patrol car pulled to a stop in the driveway.</p>\n<p>&ldquo;Riya? Are you alright? There was an earthquake! Can you believe it?&rdquo; called out Bronwyn Price&rsquo;s voice. The constable walked to the porch. She was alone. &ldquo;What happened to you two? You look terrible!&rdquo;</p>\n<p>Riya tried to grin. &ldquo;Long story.&rdquo;</p>\n<p>Price lifted a torch from her belt and scanned the property. &ldquo;Good lord! The quake took down the old hill, it did! Incredible! And&hellip;er...Riya?&rdquo; She pointed at the colossal gruesome shape of the dragon. It lay in the grass, belly up, neck twisted, wings stuck in the branches of ruined trees. &ldquo;I don&rsquo;t&hellip; What is&hellip;?&rdquo;</p>\n<p>Riya reached out a hand and gently pushed the torch down to aim at their feet.</p>\n<p>&ldquo;Bronwyn. You can&rsquo;t&hellip; I mean, it&rsquo;s complicated.&rdquo;</p>\n<p>Price&rsquo;s body had gone stiff. &ldquo;Complicated? Oh. But&hellip; Do I&hellip;do I want to know what happened here?&rdquo;</p>\n<p>Riya exhaled. &ldquo;No, I don&rsquo;t think you do. It&rsquo;s best you move along. This is something we need to handle. Trust me. You check on the neighbors. I&rsquo;m sure they&rsquo;re shaken from the&hellip;the earthquake.&rdquo;</p>\n<p>&ldquo;Okay then&hellip; Right.&rdquo;</p>\n<p>Price did not blink or look in the direction of the dragon as she hurried to her car and climbed in. She reversed at high speed, wheels squealing.</p>\n<p>&ldquo;What are we supposed to do about the dragon, anyway?&rdquo; Riya asked Omicron.</p>\n<p>&ldquo;I&rsquo;ve got some old colleagues I can call. They&rsquo;ll take care of it.&rdquo;</p>\n<p>&ldquo;Oi!&rdquo; shouted a voice from the darkness. &ldquo;Watch where you&rsquo;re driving, you daft copper!&rdquo;</p>\n<p>Violet was at the end of the driveway sidestepping the reversing patrol car.</p>\n<p>&ldquo;What&rsquo;s she doing here?&rdquo; said Riya, walking down the steps to meet the girl.</p>\n<p>&ldquo;When the whole bloody ground started shaking, I knew it had to be <i>you two</i>,&rdquo; asserted Violet, strolling toward them. &ldquo;Cheese and crackers! Look at that thing! It real?&rdquo;</p>\n<p>&ldquo;Sure is.&rdquo;</p>\n<p>&ldquo;Wow. Here let me&hellip; Oh crap! My battery&rsquo;s dead!&rdquo;</p>\n<p>&ldquo;What are you doing here, Violet?&rdquo;</p>\n<p>&ldquo;Well I came to check on you, Miss Riya, didn&rsquo;t I? Besides, I finished up that research for Omicron. Here! I think<i> this </i>is what you&rsquo;re after.&rdquo;</p>\n<p>She handed Omicron a few folded sheets of printed paper, eyeing his bruises and wrinkles with mingled concern and horror.</p>\n<p>&ldquo;Many thanks, Lady Vi! Let&rsquo;s see here.&rdquo; Omicron squinted in the porchlight and scanned each page in turn, mumbling as he read. &ldquo;Trinity Site&hellip; Twenty-two kilotons&hellip; Ancient burial ground&hellip; Aye, aye. This looks right. This confirms my feelings.&rdquo;</p>\n<p>&ldquo;What are you on about now?&rdquo; asked Riya.</p>\n<p>&ldquo;Our next destination, m&rsquo;lady!&rdquo; said Omicron, some of the life and color returning to his cheeks. &ldquo;We will leave as soon as a passage can be arranged.&rdquo;</p>\n<p>&ldquo;Well<i> I </i>can&rsquo;t just leave!&rdquo; Riya protested. &ldquo;I have my classes! There&rsquo;re exams in the morning.&rdquo;</p>\n<p>&ldquo;Exams! Bah!&rdquo; laughed Omicron. &ldquo;All this talk about studying history, and I&rsquo;m giving you the chance of changing history! Can the two really compare?&rdquo;</p>\n<p>&ldquo;Where would we be going anyway?&rdquo;</p>\n<p>He jabbed a finger at the paper. &ldquo;To the land of enchantment!&rdquo;</p>\n<p>&ldquo;Where&rsquo;s that? Avalon?&rdquo;</p>\n<p>&ldquo;Nay, not bloody Avalon! <i>The land of enchantment</i> is the state motto for New Mexico in America. So pack a bag, Lady Riya! We&rsquo;re off to the New World.&rdquo;</p>\n<p>Omicron strutted back to the porch, tugging on his makeshift toga.</p>\n<p>Riya&rsquo;s fingers still tingled from firing the magic pistol. She scanned the night around her. The damaged trees. The ruined garden. The missing hill. And the corpse, so undeniably <i>real</i>, with broken wings and toppled, claw-rimmed limbs. The head was splayed open like a gruesome flower, gooey innards just visible in moonlit bands of color, the odor rich, pungent, sickly sweet.</p>\n<p>&ldquo;You alright, Miss Riya?&rdquo;</p>\n<p>&ldquo;I think so, Vi. Yeah. Well, come on. Let&rsquo;s get inside. I&rsquo;ll put the kettle on. Looks like I&rsquo;ve got some plans to make.&rdquo;</p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section10>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- Episode 2: “Wanagi” -->\n<!-- ### -->\n<p><i>5:28 a.m.</i></p>\n<p><i>16 July 1945</i></p>\n<p><i>Jornada Del Muerto Desert, 230 miles south of Los Alamos, New Mexico</i></p>\n<p></p>\n<p></p>\n<p>Private Nez stuck a cigarette between his chapped lips. The heavy black goggles he and his fellow soldiers were instructed to wear itched horribly. Over the tinny speakers, the countdown continued.</p>\n<p>&ldquo;Twenty-seven. Twenty-six. Twenty-five. Twenty-four&hellip;&rdquo;</p>\n<p>&ldquo;You ready for this shit?&rdquo; someone asked.</p>\n<p>Nez shrugged. He didn&rsquo;t care much either way and half expected the experiment to go belly-up. Wouldn&rsquo;t that show the top brass, all those pompous officers and featherbrained scientists. All Nez wanted was for the assignment to be complete so he could get a break from the unforgiving New Mexican sun.</p>\n<p>&ldquo;Thirteen. Twelve. Eleven. Ten&hellip;&rdquo;</p>\n<p>They called it the Manhattan Project, but there was nothing cosmopolitan about this assignment. Nez and the other soldiers were sworn to secrecy; they couldn&rsquo;t even call their sweethearts. Long hours hauling equipment off trucks and over rocks. Sweaty nights. Lukewarm beer. The end couldn&rsquo;t come soon enough.</p>\n<p>Nez lit his cigarette with a Zippo and took a drag. He leaned forward beside the others, his elbows against the bunker&rsquo;s sandbag wall. All of their goggles were aimed over the flat expanse of sand, cactus, and juniper.</p>\n<p>&ldquo;Four. Three. Two. One&mdash;&rdquo;</p>\n<p>Cold light. Hot wind. A flash and a wheeze and a growing rumble.</p>\n<p>&ldquo;Holy shit,&rdquo; someone whimpered. &ldquo;Will ya look at that?&rdquo;</p>\n<p>The starburst of orange melted into a towering mushroom cloud, a mountain of energy crowned with rings of dazzling white. The landscape rippled&mdash;a spreading sandstorm preceded by a deadly shock wave.</p>\n<p>&ldquo;Whoa. Check out the&hellip; Nez? Nez!&rdquo;</p>\n<p>Some of the others had finally noticed Private Nez. He lay twitching at the foot of the sandbags, goggles askew, foamy saliva spilling from his mouth. On the ground beside his trembling body, his cigarette issued a thread of twisting smoke.</p>\n<p>&ldquo;Shit, Nez! What&rsquo;s happening?&rdquo;</p>\n<p>Gloved hands pulled him to a sitting position. The bunker was vibrating like a bell, but Nez was shaking even harder.</p>\n<p>&ldquo;See them&hellip;&rdquo; he moaned. &ldquo;Did you&hellip;see them?&rdquo;</p>\n<p>&ldquo;You been drinking, Nezzie? What&rsquo;s happening, man? Stay with us.&rdquo;</p>\n<p>They took off his goggles and forced a canteen to his mouth. He spluttered and coughed.</p>\n<p>&ldquo;In the explosion!&rdquo; Nez shrieked. &ldquo;Rising up. Giants, spirits. I saw their bodies! Shoulders, breasts, bright eyes!&rdquo;</p>\n<p>&ldquo;Damn, Nez! You&rsquo;re gonna get yourself thrown in a padded room, man, talking like that.&rdquo;</p>\n<p>&ldquo;Don&rsquo;t you understand!&rdquo; he screamed. &ldquo;We did something! That goddamn bomb did something. Woke something up. Released them. Twinned beauty and terror.&rdquo;</p>\n<p>The other soldiers exchanged anxious glances.</p>\n<p>&ldquo;This Indian&rsquo;s been out in the sun too long,&rdquo; someone grunted rudely.</p>\n<p>Nez&rsquo;s teeth chattered. Tears fell, unchecked, from his bloodshot eyes. A line of dark blood ran from his left nostril and trickled over his cracked lips.</p>\n<p>&ldquo;I saw,&rdquo; he repeated. &ldquo;And I heard&hellip;I heard her laughing.&rdquo;</p>\n<p>And then he was laughing, too. A crazy laugh that cut through the shrill nuclear blare all around them and died in the sand-swept air.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section11>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p><i>Present day</i></p>\n<p></p>\n<p>Riya peered through the airplane window at the gently curved horizon where the Atlantic met the sky. She pulled down the plastic shade and settled back in her seat. In the seat beside her, Omicron hummed quietly to himself as he read a comic book.</p>\n<p>Reaching into her jacket pocket, Riya slid out two items and looked them over, considering. The first was a shiny black credit card with a gold etching of a scarab. Omicron had simply called it &lsquo;the company card.&rsquo; Riya had successfully used the card to purchase their tickets at Heathrow. The second item was a burgundy UK Passport.</p>\n<p>&ldquo;Omicron. Where exactly did you get these?&rdquo;</p>\n<p>He looked up from his comic. &ldquo;I told you. From my colleagues. Does m&rsquo;lady think I&rsquo;m the only magical person around?&rdquo;</p>\n<p>&ldquo;And these...these people, they&rsquo;re going to pay for all this? Just because you asked?&rdquo;</p>\n<p>&ldquo;They do more than that. They keep an eye on things.&rdquo;</p>\n<p>&ldquo;And occasionally bury slaughtered dragons before the public can find them?&rdquo;</p>\n<p>&ldquo;Precisely.&rdquo;</p>\n<p>She opened the passport. &ldquo;I doubted this thing would even work. When you gave it to security, the agent had the strangest expression. I thought we were going to get arrested and&hellip; Oh come on! No wonder! This thing says your name is <i>Omicron Wonderbuck</i>!&rdquo;</p>\n<p>Omicron&rsquo;s wrinkles deepened as his face broke into a wide smile. &ldquo;Mm-hm. Just what I asked them to print. Cool beans, nay?&rdquo;</p>\n<p>&ldquo;Nay! Not cool beans. It&rsquo;s absurd. Nobody&rsquo;s called Omicron Wonderbuck! I thought you wanted to travel inconspicuously. Why didn&rsquo;t you pick a name like&hellip; I dunno. Any other name! Literally <i>any</i> other name&mdash;&rdquo;</p>\n<p>&ldquo;Indiana Jo&mdash;&rdquo;</p>\n<p>&ldquo;No, not bloody Indiana Jones!&rdquo; Riya jammed the passport back into her pocket. &ldquo;You sir&mdash;<i>Mr. Wonderbuck</i>&mdash;are going to be the death of me.&rdquo;</p>\n<p>&ldquo;I seriously doubt that,&rdquo; muttered Omicron, disappearing behind his comic.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section12>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>They landed at Chicago O&rsquo;Hare and took a connecting flight to Albuquerque International Sunport, arriving very late. Riya had not slept much on the flights, and as Omicron did not sleep at all, it had been a tedious fifteen-hour journey. She needed a break from the eccentric wizard and insisted they book separate rooms at their motel.</p>\n<p>After meeting up for breakfast in the motel cafeteria the following morning, they headed out to rent a car. Omicron opted for a pink convertible, but Riya vetoed the choice and instead went with a silver Nissan Titan. She figured a pickup truck would traverse the desert landscapes better and jumped at the chance to handle some serious horsepower for a change. Besides, it was going on the company card.</p>\n<p>&ldquo;You still haven&rsquo;t told me what we&rsquo;re doing here,&rdquo; said Riya as they left the city behind and drove north along the motorway toward Santa Fe.</p>\n<p>&ldquo;Saving the world, of course.&rdquo;</p>\n<p>&ldquo;Bit vague.&rdquo;</p>\n<p>&ldquo;Oh, I nearly forgot!&rdquo; Omicron twisted in his seat and pulled something out of Riya&rsquo;s rucksack. &ldquo;I thought m&rsquo;lady would want to have <i>this</i>.&rdquo;</p>\n<p>Riya glanced over from the steering wheel and saw him holding out her holster, the Sig Sauer P226 pistol tucked inside it.</p>\n<p>&ldquo;Bloody hell, Omicron! How did you even get that here? You couldn&rsquo;t have checked it on the plane.&rdquo;</p>\n<p>&ldquo;Not exactly. First, I transformed it into a penny whistle, then I checked <i>that</i> on the plane.&rdquo; He examined the pistol. &ldquo;&lsquo;Tis a good thing security didn&rsquo;t try playing it. If they&rsquo;d whistled a D-sharp the damned thing might have gone off.&rdquo;</p>\n<p>Riya snatched the gun and holster from him and stuffed it hastily back into her bag.</p>\n<p>&ldquo;I&rsquo;d rather we avoided breaking international law on these excursions, if you don&rsquo;t mind,&rdquo; she said, red in the face.</p>\n<p>&ldquo;And I&rsquo;d rather I was still cocooned in clay beneath the earth, sunk brain-deep into dreamless oblivion. But alas, the gods don&rsquo;t always give us what we ask for, and sometimes when they do, we discover &lsquo;tis not at all what we expected.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section13>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>It took five minutes to find a parking space that would fit the Nissan Titan. Riya paid the meter and they set off on foot into the heart of old Santa Fe. Riya leaned on her cane and watched Omicron, his arms crossed behind his back, cloak streaming around his ankles, curls bouncing. He looked very at home in this borough of artists, writers, and spiritualists. They entered the plaza and passed shops selling trinkets of silver and turquoise, native weavings and pottery, and endless supplies of tourist t-shirts.</p>\n<p>&ldquo;You finally gonna tell me what we&rsquo;re doing here, Omicron?&rdquo;</p>\n<p>He stopped beside the grassy plaza to listen to a mariachi band in the pavilion.</p>\n<p>&ldquo;What does m&rsquo;lady know about the Manhattan Project?&rdquo;</p>\n<p>&ldquo;Plenty. I&rsquo;m a history teacher.&rdquo;</p>\n<p>&ldquo;Do you know its connection with this particular city?&rdquo;</p>\n<p>&ldquo;Sure. The American military needed somewhere totally secluded to conduct their nuclear experiments back in the forties. They chose Los Alamos, New Mexico. The only way to make contact with the scientists was to go through&hellip; Hang on. Let me check something.&rdquo; She pulled out her phone, did a quick Google search, then put her findings into the map app. &ldquo;Come on! It&rsquo;s actually just around the corner.&rdquo;</p>\n<p>Riya led them away from the plaza. She looked from her phone to the street, then turned left into an alley. They squeezed past hanging bunches of red chiles, stacks of clay pots, and easels heavy with Catholic icons, and emerged into a tiny courtyard filled with overpriced folk art.</p>\n<p>&ldquo;There. On the wall behind you,&rdquo; Riya said, pointing over Omicron&rsquo;s shoulder. They both looked over at the small rectangle of brass attached to the stucco wall.</p>\n<p>It read:</p>\n<p></p>\n<p><i>All the men and women who made the first atomic bomb passed through this portal to their secret mission at Los Alamos. Their creation in 27 months of the weapons that ended World War II was one of the greatest scientific achievements of all time.</i></p>\n<p></p>\n<p>&ldquo;Wow,&rdquo; breathed Riya. &ldquo;It&rsquo;s amazing to see it in person. Seventy years ago, this was the most secret address on the planet. Does this have something to do with why we&rsquo;re here?&rdquo;</p>\n<p>&ldquo;Aye, m&rsquo;lady.&rdquo; He turned and headed back out of the alley. &ldquo;The atomic bomb certainly was a <i>great achievement</i>, and a dangerous one. And I don&rsquo;t just mean for the poor souls lost in Nagasaki and Hiroshima.&rdquo;</p>\n<p>&ldquo;You seem to know plenty about it yourself.&rdquo;</p>\n<p>&ldquo;You sleep at night. I wikipedia.&rdquo;</p>\n<p>Riya nodded. &ldquo;So what did the American nuclear program have to do with gods and magic?&rdquo;</p>\n<p>The wizard trooped along the pavement, eyes downcast. Overhead, the great bells of the Cathedral Basilica of St. Francis rang out brassily.</p>\n<p>&ldquo;Humanity can&rsquo;t play with a power as profound as nuclear destruction without affecting the Other Side. I believe the explosion at the Trinity Site sent ripples across the realms: a call, an alarm. It is very possible that the scientists unknowingly awoke something, or someone.&rdquo;</p>\n<p>Riya watched pigeons swarming from the cathedral roof to the street and back again. &ldquo;I thought we were looking for entities woken up recently by Arawn and Arianrhod. That explosion happened in 1945.&rdquo;</p>\n<p>&ldquo;The initial resurrection did, aye. But the god and goddess can do more than just breathe life into old corpses. I suspect Arawn is now using the atomic mishap to his advantage, waking up additional old powers, old spirits, old animosities.&rdquo;</p>\n<p>&ldquo;So did the bomb wake up a hero, or a monster?&rdquo;</p>\n<p>Omicron did not answer.</p>\n<p>They approached a shady stretch of pavement against a long building draped in yellow flags. Scores of merchants sat on blankets and folding chairs, their backs against the wall, their legs crossed before the great array of jewelry they were selling. Tourists ambled past, occasionally stooping to examine a necklace or ask the price of a belt buckle.</p>\n<p>Riya realized Omicron was no longer by her side, and peering around, spotted him at the end of the queue. He was squatted in front of a girl of about six who was selling trinkets off a beach towel. Riya approached and lowered herself beside Omicron, looking with him at the jewelry: golden hoops, clay brooches, hand-woven dreamcatchers.</p>\n<p>&ldquo;Good afternoon, child,&rdquo; Omicron said to the girl. &ldquo;These are beautiful. Did you make them yourself?&rdquo;</p>\n<p>The girl was scribbling in a notepad with a blue crayon. She shook her head and did not look up. &ldquo;Auntie makes them.&rdquo;</p>\n<p>&ldquo;I see.&rdquo; Omicron picked up a turquoise carving of a crow with a rat in its beak. &ldquo;Beautiful. Yes, beautiful. And the stones your auntie uses? Where does she find them?&rdquo;</p>\n<p>&ldquo;In the hills,&rdquo; said the girl.</p>\n<p>Omicron nodded. He set down the turquoise crow, reached into his pocket, and pulled out a small ovoid gem. Riya recognized it as the magical piece of petrified wood usually fixed in the Gauntlet of Camelot. Omicron held it up between thumb and forefinger for the child to see.</p>\n<p>&ldquo;What do you think your auntie would make of <i>this</i>?&rdquo;</p>\n<p>The scribbling ceased. The girl lowered her notepad and slowly turned her eyes to look at the gem. Her eyes were like chips of obsidian, dark and sharp and mirrored. She tilted her head to one side, eyeing the ovoid like a curious dog, and for a moment, Riya thought that&rsquo;s what she was&mdash;an animal, bright and inquisitive, disguised as human&mdash;but surely that wasn&rsquo;t right! It was just a trick of the light, a scrap of daydream, a mirage.</p>\n<p>Omicron pocketed the gem. &ldquo;Where can I find your auntie?&rdquo;</p>\n<p>The girl&rsquo;s mouth tightened into a straight line, her lips rolling in on themselves. Picking up the notepad, she scratched a line of writing with the crayon, tore out the page, and handed it to Omicron. As Omicron read the address she had written for him, the girl rolled up her beach towel, stood, and walked on bare feet into the crowd of tourists.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section14>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>The road was a snaking path of pounded dirt and tire marks, slithering through a semi-desert world of pale green plains beneath high red rocks. Piled boulders and low mountains showed stratus bands of colored stone&mdash;rust red, granite gray, chalky white. The parched and cloudless sky stretched on forever, broken here and there by dust devils&mdash;vortexes of wind and sand with swarms of tumbleweed satellites in tow. Except for the road itself, there were no signs of human habitation. No fences. No telegraph polls. Just squat junipers, the rotten remains of pinyon trees, and bald patches of umber sand.</p>\n<p>&ldquo;How much farther?&rdquo; asked Omicron.</p>\n<p>&ldquo;Don&rsquo;t know. My GPS stopped working a half hour ago. But if I remember what it said&hellip; Should be coming up soon, on the right.&rdquo;</p>\n<p>They had left Santa Fe two hours earlier, driving first southwest, then northwest around the Jemez Mountains, and finally true west, away from the national monuments and wilderness study areas, away from the ranches and ghost towns, into the sandy epicenter of nowhere.</p>\n<p>&ldquo;I think that&rsquo;s it,&rdquo; said Riya, pointing ahead at a rusty postbox donning a faded painting of a black crow with a golden eye.</p>\n<p>Riya turned the Titan into the driveway beside the postbox. The truck bounced along the weedy path and up a steep hill.</p>\n<p>She stopped the truck at the top of the hill and gazed out at the remarkable landscape below. The driveway twisted down a slope on the other side to a flat expanse of tan desert. But in the center of the lifeless valley, beside a battered trailer, lay a fenced square of vibrantly green grass, like a shimmering cube of jade in a sandbox.</p>\n<p>&ldquo;Shall we?&rdquo; said Omicron.</p>\n<p>Riya accelerated down the hill, scaring off a roadrunner eating beetles at the edge of the driveway.</p>\n<p>The trailer was fairly pitiful: windows cracked, front porch caving in on one corner, roof tiles mostly missing. There was an outbuilding filled with straw, a Jeep with the bonnet raised, and a shed with an anvil and furnace beside a tool shelf.</p>\n<p>Riya parked the truck, slid down from the high seat, and walked automatically away from the ramshackle home toward the field of lovely green. It looked to be about two acres. Riya leaned against the fence.</p>\n<p>&ldquo;Omicron! Take a look at this!&rdquo;</p>\n<p>He joined her by the fence and they stared through its slats. A bison stood on the other side, munching grass, tail flicking away flies. Riya didn&rsquo;t think she&rsquo;d ever seen anything half so proud or beautiful. It looked almost as big as an elephant&mdash;a mass of wooly muscle, sharp horns, beating hooves, a great furry face more magnificent than a lion&rsquo;s.</p>\n<p>&ldquo;You know,&rdquo; Riya said quietly, &ldquo;they used to stop the trains heading out west, let the passengers out to view the herds of bison. The men would bring out their rifles. They slaughtered these by the hundreds. Just for fun. Like a game.&rdquo;</p>\n<p>&ldquo;I don&rsquo;t like that story,&rdquo; said Omicron.</p>\n<p>&ldquo;Yeah. I don&rsquo;t like it either.&rdquo;</p>\n<p>The screen door on the trailer crashed open with a <i>bang!</i> Riya and Omicron started and spun as cowboy boots clicked across the porch and a voice rang out, &ldquo;Get the hell away from him!&rdquo;</p>\n<p>Omicron smiled. &ldquo;Hello there! Sorry to startle you. We were admiring this fine creature&mdash;&rdquo;</p>\n<p>&ldquo;Get the hell away from Bill.&rdquo;</p>\n<p>&ldquo;Of course. Of course.&rdquo;</p>\n<p>Omicron, Riya a step behind him, left the fence and walked back to the trailer.</p>\n<p>&ldquo;Who are you?&rdquo; asked the woman on the porch.</p>\n<p>Riya stared up at her. The woman was old&mdash;very old&mdash;with a face like cracked leather and two snowy braids that hung almost to her waist. She was dressed in faded denim and there was a tomahawk hooked to her belt, feathers and beads hanging from one end. She held a Winchester rifle&mdash;one of those lever-action carbines with an engraved iron frame like in western movies. <i>The gun that won the west.</i></p>\n<p>&ldquo;I asked who you were,&rdquo; the woman repeated, her golden eyes scanning both of them warily.</p>\n<p>&ldquo;I am called Omicron. This is Riya De Moor. We&rsquo;ve come to help you.&rdquo;</p>\n<p>&ldquo;How&rsquo;d you find this place?&rdquo;</p>\n<p>He held up the page with the crayon writing. &ldquo;Your niece.&rdquo;</p>\n<p>The woman sniffed. &ldquo;She ain&rsquo;t my niece, not really. They just call me <i>Auntie</i>.&rdquo;</p>\n<p>Omicron nodded. &ldquo;I assumed as much.&rdquo;</p>\n<p>She lowered her rifle. &ldquo;I&rsquo;m Sable Crow,&rdquo; she told them, flashing a half-hearted smile. Her teeth were very white, except for one incisor, which was gold. &ldquo;You say you&rsquo;re here to help me? Tell me, girlie, that truck of yours gassed up?&rdquo;</p>\n<p>&ldquo;Yeah,&rdquo; said Riya. &ldquo;I got petrol in Torreon.&rdquo;</p>\n<p>&ldquo;Good. My Jeep&rsquo;s on the fritz. You drive.&rdquo; She set her rifle&rsquo;s barrel over a shoulder, reached into the trailer to retrieve a black fedora, which she tossed crookedly onto her head, and marched for the pickup truck.</p>\n<p>&ldquo;Okay. Er... Sure.&rdquo; Riya walked to the driver&rsquo;s side door, casting Omicron a puzzled look.</p>\n<p>&ldquo;Right to business,&rdquo; said Omicron. &ldquo;I like this old girl.&rdquo;</p>\n<p>Sable Crow set her rifle in the back of the truck and, with an energetic grunt, pulled herself up after it.</p>\n<p>&ldquo;What exactly are we doing?&rdquo; asked Riya, climbing behind the wheel.</p>\n<p>&ldquo;Hunting,&rdquo; said Sable. &ldquo;Now drive.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section15>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>From where they were parked on a ridge about a mile from the trailer, Riya had a clear view of the valley and the distant mesas. She pulled compact binoculars from her rucksack and peered through the open driver&rsquo;s side window.</p>\n<p>&ldquo;If you&rsquo;re shooting for that coyote down on the left,&rdquo; said Riya, &ldquo;it&rsquo;s a good five hundred yards. No way you make a shot like that without a scope. How long is your barrel? Twenty inches? That shot&rsquo;s impossible.&rdquo;</p>\n<p>Sable lay in the back of the truck, one eye open along the barrel of her rifle. &ldquo;I can make it. And I ain&rsquo;t hunting the coyote. Something else is, and <i>that</i>&rsquo;s what I&rsquo;m shooting for.&rdquo;</p>\n<p>Riya scanned the area. &ldquo;I don&rsquo;t see any other predators.&rdquo;</p>\n<p>Omicron, settled in the passenger seat, nudged her elbow and pointed at the sky. Riya adjusted the focus on the binoculars.</p>\n<p>&ldquo;I only see&hellip; What is that? Almost looks like a drone.&rdquo;</p>\n<p>A tiny silver triangle was hovering at an unknown distance, rocking slowly back and forth in the wind. As Riya watched, it dove like a missile toward the desert floor. She struggled to keep it in view as it struck the coyote in an explosion of sand.</p>\n<p>&ldquo;Whoa!&rdquo; cried Riya. &ldquo;That thing just obliterated the coyote! I can&rsquo;t see&mdash;wait. There&rsquo;s the coyote&rsquo;s head. And I think that&rsquo;s the hindquarters over there. And<i> that</i> might be a leg.&rdquo;</p>\n<p>In the Venn diagram vision of the binoculars, Riya watched a great crouched shape trample about the bloody remains, snapping up scraps of bone and meat in a sharp beak. It was a massive bird, or at least that&rsquo;s what it most resembled. Its wingspan had to be at least fifteen feet.</p>\n<p>&ldquo;Looks like some hideous gargoyle statue,&rdquo; Riya thought aloud.</p>\n<p>&ldquo;It&rsquo;s an achiyalatopa,&rdquo; explained Sable Crow. &ldquo;A rockwing, a demon of the air. Its feathers are flint and its beak is obsidian.&rdquo;</p>\n<p>&ldquo;And you can take it down with a firearm?&rdquo; asked Omicron doubtfully.</p>\n<p>&ldquo;It&rsquo;s got a weak point at the neck. Small target though,&rdquo; said Sable, adjusting her aim.</p>\n<p>Riya squinted through the binoculars as Sable fired. <i>Crack!</i> The huge bird twisted and fell into the sand. Riya smelled acrid gunpowder, heard Sable work the lever, saw the achiyalatopa writhe and straighten up onto its long legs. It beat its wings furiously, once, twice, three times. As the rifle boomed a second time in the back of the truck, the achiyalatopa took off in a rush of stone feathers and blown sand.</p>\n<p>&ldquo;Well shit. I gotta upgrade my bullets,&rdquo; grunted Sable, sitting up. &ldquo;Don&rsquo;t just sit there, girlie! Get this truck moving! Now I&rsquo;ve pissed it off.&rdquo;</p>\n<p>Riya threw down the binoculars and started the truck. The achiyalatopa circled once in the cloudless sky, then flew toward the ridge where they were parked.</p>\n<p>&ldquo;Giant demon bird, right,&rdquo; muttered Riya, slamming the stick into reverse and revving the Titan backward at an angle, then forward as fast as it would go.</p>\n<p>In the rearview mirror, through the murky curtain of dust thrown up by the truck, Riya saw the deadly shape of the achiyalatopa closing in. Sable&rsquo;s rifle fired again.</p>\n<p>&ldquo;I can&rsquo;t make a shot with us bouncing all over!&rdquo; Sable shouted.</p>\n<p>Riya didn&rsquo;t answer. The ground was a mess of slick sand, sharp stone, and stunted junipers. She swerved this way and that, shocks straining, engine groaning. The land dead ahead was open and left them vulnerable to attack, so she turned right into a gorge between twenty-foot ledges.</p>\n<p>Omicron was laughing and pulling on his gauntlet. &ldquo;What a ride! Isn&rsquo;t it, m&rsquo;lady?&rdquo;</p>\n<p>&ldquo;If you say so,&rdquo; said Riya.</p>\n<p>&ldquo;We gotta problem!&rdquo; called Sable. &ldquo;I can&rsquo;t see the rockwing!&rdquo;</p>\n<p>Riya twisted in her seat. The sky behind them was empty.</p>\n<p>&ldquo;Where&mdash;&rdquo; she began, turning back to the steering wheel.</p>\n<p>The monstrous bird was in front of them, stone talons extended. It slammed into the bonnet of the truck and smashed its head through the windscreen. Riya screamed and lost control of the steering wheel. The truck veered to the left, scraping along the rock ledge, filling the vehicle with sparks and flying gravel.</p>\n<p>The achiyalatopa whipped its neck back and forth, its razor sharp beak snapping, trying to get ahold of Riya. Riya pressed her body back into the seat, her hand scrambling desperately in the rucksack behind her. As she reached for her pistol, Omicron pushed his way in front of her and punched the bird with his gauntleted fist. The bird was blasted off the bonnet in a shower of glass. It tumbled into the sand and lay quivering.</p>\n<p>Riya swerved to a stop alongside the achiyalatopa. She exhaled, opened her door, and climbed out.</p>\n<p>&ldquo;Oh shit,&rdquo; groaned Riya.</p>\n<p>Sable hopped from the back of the truck. &ldquo;Don&rsquo;t worry. The rockwing can&rsquo;t hurt you no more.&rdquo;</p>\n<p>&ldquo;It&rsquo;s not that. This truck is a bloody rental!&rdquo;</p>\n<p>Omicron climbed down from the far side of the truck and joined them as they approached the achiyalatopa. The bird lay on its back, twitching and kicking. Sable pulled the tomahawk from her belt. It was a beautiful weapon with a dark wood handle and the bowl of a smoking pipe on the back side of the blade.</p>\n<p>Sable brought the tomahawk down between the bird&rsquo;s eyes. It sunk as if into flesh, but when she pulled it free and the achiyalatopa collapsed, the body seemed to transform into a pile of gray stones&mdash;flint feathers, a lumpy boulder head, two sharp rocks where the beak had been.</p>\n<p>&ldquo;You think there are more of these things?&rdquo; asked Riya.</p>\n<p>&ldquo;This is the third I&rsquo;ve seen,&rdquo; said Sable bitterly, &ldquo;this week.&rdquo;</p>\n<p>&ldquo;Then we&rsquo;ve got our work cut out for us,&rdquo; said Omicron.</p>\n<p>&ldquo;Let&rsquo;s get back to the trailer. I&rsquo;ll make some supper,&rdquo; said Sable, hooking the tomahawk back onto her belt.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section16>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>&ldquo;Thanks for dinner,&rdquo; said Riya, squeezing past Sable in her threadbare armchair and setting the dirty dishes in the trailer&rsquo;s sink.</p>\n<p>Sable lifted a beaded purse from the floor. She pulled a thick pinch of tobacco from the bag, tucked it into the silver bowl on her tomahawk, and lit the pipe with a match. The smoke burned Riya&rsquo;s eyes and its earthy smell made her feel both sleepy and nauseous. She moved to where Omicron sat cross-legged on a loveseat, and scooting his knee aside, squeezed herself onto the cushion.</p>\n<p>They sat for several minutes in smoky silence, Omicron examining one of the half-finished pieces of jewelry that lay about the trailer, Sable sucking on her pipe and blowing gray-blue rings, Riya watching the rings roll, stretch, fade, vanish.</p>\n<p>&ldquo;So I take it you&rsquo;re the next resurrected warrior of old,&rdquo; Riya finally said to Sable. Her voice sounded unnaturally loud and intrusive in the still room. &ldquo;What&mdash;er&mdash;what tribe are you from?&rdquo;</p>\n<p>&ldquo;No tribe. Or perhaps, all of them. My time marked the end of the One and the beginning of the Many.&rdquo;</p>\n<p>&ldquo;I&rsquo;m not sure I follow.&rdquo;</p>\n<p>Sable closed her eyes and inhaled deeply, the glow of the burning tobacco intensifying, then released two horns of gray smoke from her nostrils.</p>\n<p>&ldquo;I was born far from here and long ago, Miss Riya De Moor. Warrior? Yes, I was a warrior. But also more. I was the last great huntress and the first great queen of these lands.&rdquo;</p>\n<p>Riya sat up. &ldquo;These lands? Do you mean the Americas?&rdquo;</p>\n<p>&ldquo;That ain&rsquo;t their true name, but yes. That was my life, my fate. And then I died a heroine&rsquo;s death and they lay my body in the ground. My body was warm and dry and comfortable for many ages. And my soul&hellip; Oh my soul. My mind soared over a wide, bright country. But all that ended when the bomb went off on top of my corpse. I heard the boom. I felt a tug like gravity. I was rushed backward, and forward, and inward.&rdquo;</p>\n<p>&ldquo;The energy of the Trinity blast brought you back to life?&rdquo;</p>\n<p>Sable&rsquo;s tobacco had burned away. She sucked at the pipe with a little whistle, spit out a bit of leaf, nodded. &ldquo;I ran from the blast site, across the desert. Found myself lost and alone in the center of a cattle ranch. Got a job with the ranch hands for a while. Then turned to blacksmithing. Bought this place. Just kinda trying to live, you know.&rdquo;</p>\n<p>&ldquo;And how long ago was your previous life?&rdquo; inquired Riya.</p>\n<p>Omicron set aside the jewelry. &ldquo;She is old, Riya. Very, very old. What you&rsquo;d call <i>paleoamerican</i>. She walked the earth ten thousand years ago. Pre-Flood.&rdquo;</p>\n<p>Sable slapped the side of the tomahawk, emptying the bowl into a bucket that served as a garbage bin. &ldquo;What would a European sorcerer from the Middle Ages know about the Flood?&rdquo;</p>\n<p>&ldquo;Perhaps very little,&rdquo; conceded Omicron, &ldquo;<i>if</i> that&rsquo;s truly all he was.&rdquo;</p>\n<p>Riya looked over at Omicron curiously, but already the conversation was moving in a direction all the more strange.</p>\n<p>&ldquo;I was so afraid when my eyes were forced opened,&rdquo; Sable said quietly. &ldquo;All that cruel light and harsh laughter. But when the atomic flames died away, I was just an old woman again.&rdquo;</p>\n<p>&ldquo;So your powers did not awaken with your body?&rdquo; asked Omicron.</p>\n<p>Sable shook her head. &ldquo;Not really. Nor in the decades since. Until&hellip;until quite recently.&rdquo;</p>\n<p>Omicron sat up straighter. &ldquo;Explain.&rdquo;</p>\n<p>&ldquo;Things are changing,&rdquo; said Sable. &ldquo;I first noticed it a month ago. Whispers in the dark. A blossoming energy in my bones, like in the old days. And then I saw the achiyalatopa. And worse.&rdquo;</p>\n<p>&ldquo;I knew it,&rdquo; breathed Omicron. &ldquo;The dark influence of Arawn is emerging, even in this distant, dusty corner of the globe. <i>And</i> the might of Arianrhod.&rdquo;</p>\n<p>&ldquo;Where do you think the achiya&hellip;achi&hellip;the <i>rockwings</i> are coming from?&rdquo; asked Riya.</p>\n<p>&ldquo;I know where they&rsquo;re coming from, girlie. See, I wasn&rsquo;t alone when I woke. Something else was with me. It was weak, too. But now? Now it&rsquo;s strong again. It&rsquo;s using an old spell to make the achiyalatopa. Takes a basalt boulder, bathes it in cold water, roasts it in white flame. They become eggs. Rockwing eggs.&rdquo; She looked at Riya. &ldquo;Witchcraft, girlie.&rdquo;</p>\n<p>Riya had been tense and stiff, but now relaxed, the air leaking from her lungs in a relieved sigh. &ldquo;That&rsquo;s it? The monster we&rsquo;re after is a <i>witch</i>? After a dragon that should be easy.&rdquo;</p>\n<p>Sable chuckled. &ldquo;A dragon is a great dumb brute. A <i>wanagi</i>&mdash;dark spirit&mdash;it is&hellip;something else. Bad things happen around them. There are reports coming in. Park rangers claiming to see unnatural things in the desert. So no, this won&rsquo;t be easy.&rdquo;</p>\n<p>&ldquo;Oh.&rdquo; Riya stood. The trailer was making her feel claustrophobic. &ldquo;I think I need to stretch my legs.&rdquo;</p>\n<p>&ldquo;Bill&rsquo;ll be sleeping. Don&rsquo;t bother him,&rdquo; said Sable.</p>\n<p>&ldquo;Right.&rdquo;</p>\n<p>Riya grabbed her cane and exited the trailer. She limped off the porch and began pacing in the weedy driveway. The sky was pitch-black to the east and oily purple to the west. There was no wind, just the songs of insects and the constant glow of stars and moon.</p>\n<p>What was happening back in St. Pyr right now? It would be early morning there. Her students would be home. They&rsquo;d be waking up soon, showering, preparing breakfast, maybe even doing last minute homework to hand in to the supply teacher. Riya felt an impulsive urge to call Violet Connah and make sure she was coming to the cottage to feed Tom Bombadil, but a glance at her phone showed that there was no signal.</p>\n<p>&ldquo;What am I doing here?&rdquo; she mused aloud.</p>\n<p>Her thoughts began to pinball through the history of her life. She thought of her students, her cottage, her cat. The dragon buried in her garden. The landmine buried by the road in Iraq. Violet. Omicron. Sable Crow. Teaching history. Making history. Slaying monsters.</p>\n<p>She drew a deep breath of desert air, stowed the phone in her pocket, and headed back inside.</p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section17>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>She awoke to the sound of banging and for a terrifying second thought she was back in Iraq, but as she lay curled up on the loveseat in Sable&rsquo;s trailer, Riya realized it was the sound of metal tools outside.</p>\n<p>Sharp morning light burned her eyes as she walked onto the porch. Omicron was nowhere to be seen, but Sable was working at the blacksmith shed, sweat streaming off her ancient face and hardened arms.</p>\n<p>&ldquo;Morning!&rdquo; Sable called, setting down her hammer. &ldquo;Sleep okay?&rdquo;</p>\n<p>&ldquo;Sure,&rdquo; Riya lied, massaging her aching lower back with the knuckles of her right hand.</p>\n<p>Riya approached the shed. Whatever Sable was working on, it wasn&rsquo;t jewelry.</p>\n<p>&ldquo;Are you making a weapon?&rdquo; Riya asked loudly as the hammering resumed.</p>\n<p>&ldquo;Yup. Omicron asked me to make it for him. Custom job. Guess he ain&rsquo;t content with the weaponry of this century.&rdquo;</p>\n<p>Riya looked at the length of battered, hot-red metal Sable was pounding. It was a blade of some kind, short and heavy, and there were several others like it lying nearby. On a desk beside the anvil, she saw a mess of papers covered in Omicron&rsquo;s handwriting with diagrams and measurements, many details scratched out and drawn multiple times.</p>\n<p>&ldquo;Will this weapon be used to kill the witch?&rdquo; Riya asked.</p>\n<p>Sable set the hammer aside, lifted up the blade with a pair of tongs, and engulfed it in a vat of steaming oil. The oil hissed.</p>\n<p>&ldquo;Doubt it,&rdquo; said Sable. &ldquo;But <i>those</i> might.&rdquo;</p>\n<p>She nodded at a shelf to Riya&rsquo;s right. Riya turned and examined a line of golden cartridge cases standing like a row of soldiers.</p>\n<p>&ldquo;Your bullets are missing their bullets,&rdquo; smirked Riya. &ldquo;They&rsquo;re just the rim and casing.&rdquo;</p>\n<p>&ldquo;And pre-sealed with primer and powder. The bullet tips will be magical. In this case, blessed fire. Best way to take down a witch.&rdquo;</p>\n<p>&ldquo;I can&rsquo;t imagine Omicron using a gun.&rdquo;</p>\n<p>&ldquo;<i>I </i>use the gun. He&rsquo;ll use this.&rdquo; She pointed at the short blades piling up.</p>\n<p>&ldquo;Where is he, anyway?&rdquo;</p>\n<p>Sable pointed a soot-blackened finger at the bison&rsquo;s grassy paddock. &ldquo;Bonding with Bill. Your magic colleague is a deer this morning.&rdquo;</p>\n<p>Riya grinned. &ldquo;Nice way to start the day, I guess.&rdquo;</p>\n<p>The older woman approached the younger, wiping her hands on her jeans and staring curiously into Riya&rsquo;s face.</p>\n<p>&ldquo;He&rsquo;s more than he seems, you know,&rdquo; said Sable.</p>\n<p>&ldquo;How do you mean?&rdquo;</p>\n<p>&ldquo;I mean I&rsquo;ve been living in this modern world for more than seventy years. It still feels off. I still feel out of place. But this <i>Omicron</i>? He is right at home. Acclimated. Assimilated.&rdquo;</p>\n<p>&ldquo;Some people handle change better than others, I guess.&rdquo;</p>\n<p>Sable flashed her golden tooth. &ldquo;It&rsquo;s not just that. This ain&rsquo;t his first rodeo.&rdquo;</p>\n<p>She went to stoke the furnace, leaving Riya to ponder her words.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section18>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>They spent the whole of the next three days in Sable&rsquo;s valley. The old woman pounded away with her hammer. The old man wandered in and out of the trailer, muttering and checking maps and &lsquo;seeing&rsquo; with his gauntlet. Riya was positively bored. She gave her pistol a thorough cleaning, then did the same for Sable&rsquo;s rifle. She made a food run to a rundown store on a Navajo service road in the town of Crownpoint. She watched Bill. She waited.</p>\n<p>Sable and Omicron finally divulged their full plan to Riya one night as they sat around a campfire behind the trailer, eating cans of soup heated on the coals.</p>\n<p>&ldquo;A geologist went missing last week at Sheep Springs,&rdquo; Sable said, scraping the last bit of chowder from her can. &ldquo;And yesterday morning two brothers went hiking near White Rock and haven&rsquo;t been seen since. It means <i>she</i> is feeding, and getting stronger each day. We have to act fast.&rdquo;</p>\n<p>&ldquo;How do we find the witch?&rdquo; asked Riya.</p>\n<p>&ldquo;There&rsquo;s a pattern to her movements,&rdquo; Omicron explained, laying out a crinkled map on the sand. &ldquo;We think we know where she&rsquo;ll be each night. The trouble is, this heinous spirit can sense Sable&rsquo;s power, and mine too, probably, and she&rsquo;ll flee if we come near. We&rsquo;ll need someone non-magical to draw her in, keep her busy, and ideally, wound her. Then Sable can sweep in for the kill!&rdquo;</p>\n<p>Riya set down her supper. She thought she knew where this was going. &ldquo;Uh-huh. And what will <i>you</i> be doing during all this, Omicron?&rdquo;</p>\n<p>&ldquo;When the witch knows she&rsquo;s under attack,&rdquo; said Sable, &ldquo;she&rsquo;ll send for her minions to come to her aid. All the remaining achiyalatopas will come tearing down on us. Omicron will deal with them.&rdquo;</p>\n<p>The wizard beamed. &ldquo;It&rsquo;ll give me a chance to test out my new toy.&rdquo;</p>\n<p>A muscle twitched in Sable&rsquo;s cheek. &ldquo;It ain&rsquo;t a damn toy.&rdquo;</p>\n<p>&ldquo;So while Omicron takes out the rockwings, I&rsquo;ll be the non-magical target, right?&rdquo; Riya asked.</p>\n<p>&ldquo;If you don&rsquo;t mind playing bait,&rdquo; said Sable.</p>\n<p>&ldquo;I&rsquo;m restless as hell. Doing anything sounds good to me.&rdquo;</p>\n<p>&ldquo;Right ho!&rdquo; clapped Omicron. &ldquo;We strike tomorrow. We&rsquo;ll drop off m&rsquo;lady at the canyon where the witch is headed, and you&rsquo;ll hike into place. Bring your gun, but don&rsquo;t act conspicuously. You&rsquo;re just another hiker on holiday. Eager, inattentive, delicious. Engage the witch when she accosts you and hold her off long enough for Sable to come in and finish it.&rdquo;</p>\n<p>&ldquo;And Riya,&rdquo; added Sable, &ldquo;be on your guard, you hear. This foe can be deceptive. She&rsquo;ll try to feed your fears, throw you off balance. Don&rsquo;t let her. This ain&rsquo;t gonna be no picnic in the park.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section19>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>As Riya hiked beside the winding roads of Chaco Culture National Historical Park, then up into the mesas, she leaned less on her cane than usual. Her back seemed to be doing better lately. She stared down past the crescent-shaped houses of the ancient Chacoans, past the clicking cameras of tourists, into the xeric scrubland, the canyon bright with blue sagebrush, pale cactus, sunburned stone&mdash;a land fit for jackrabbits, pronghorns, rattlesnakes, and myths.</p>\n<p>The brochure in Riya&rsquo;s rucksack explained that Chaco Canyon had been a major center of trade and culture for centuries, long before European settlers arrived. The sandstone structures had been the largest ever built in North America until the 1800s. The history teacher in her drank in the sights, but the soldier stayed on guard, ready for action.</p>\n<p>When the sun went down, an elderly park ranger with a name tag sporting &ldquo;NEZ&rdquo; told Riya and the other straggling hikers that the park would soon be closing. Riya slipped away into the shadows of some boulders, hiding herself between a tangle of windblown tumbleweeds and a great chunk of tan stone, its surface decorated with ancient petroglyphs: a dagger moon, a left handprint, a shining star.</p>\n<p>When the noises of the park visitors and rangers faded, she crept out from her hiding and wandered around the largest of the ruins. <i>Pueblo Bonito</i>, it was called, <i>beautiful town</i>. Riya thought the name was insufficient on every level.</p>\n<p>The ruined Great House was a massive D-shaped structure of red and yellow bricks. It had originally boasted over eight hundred rooms and their skeletal remains stood in a labyrinth of square doorways, T-shaped windows, and tiny rooms open-roofed to the stars.</p>\n<p>The sky darkened. Even the insects were staying silent.</p>\n<p>Riya shifted her rucksack onto one shoulder so that she could slide a hand inside and grip the handle of her pistol. She kept thinking she saw shapes in the dimness&mdash;here a crouching body, there a writhing snake. A coldness was creeping into the canyon, permeating the stones, closing in on the last quarter moon.</p>\n<p>&ldquo;Hello?&rdquo; came a faint voice.</p>\n<p>Riya started, her breath catching in her throat. She tightened her grip on the gun.</p>\n<p>&ldquo;Hello?&rdquo; the voice called again, an elderly man&rsquo;s voice, trembling, coming from somewhere in the ruins. &ldquo;Is anybody out there? Please. I think I&rsquo;m lost!&rdquo;</p>\n<p>Riya clasped her eyes shut, exhaled through puckered lips, tried to slow the mad thumping in her chest.</p>\n<p>&ldquo;It&rsquo;s not real,&rdquo; she told herself in a whisper.</p>\n<p>&ldquo;Please? I don&rsquo;t know what&rsquo;s happening!&rdquo;</p>\n<p>Riya drew out the gun and let her bag fall to the ground.</p>\n<p>The voice grew more desperate. &ldquo;Someone&rsquo;s in here with me! I don&rsquo;t like her. I think she&rsquo;s gonna hurt me. Please!&rdquo;</p>\n<p>Riya cursed under her breath, trying desperately to remember whether she had seen anyone very old touring the park. The one park ranger was elderly, but surely his colleagues would have told her if he or anyone else had gone missing, wouldn&rsquo;t they? Someone would be looking. It didn&rsquo;t make sense.</p>\n<p>&ldquo;Oh no!&rdquo; croaked the voice. &ldquo;Ouch! No, don&rsquo;t do that! That hurts! Please!&rdquo;</p>\n<p>Riya grunted and ducked into the ruins, pistol in her right hand, cane stiff in her left, limping into the gloom.</p>\n<p>She knew it was a trap. She knew what was waiting for her inside, but the tremulous old voice was crying. Great sobs in the dark, hollow and hopeless.</p>\n<p>&ldquo;Where are you?&rdquo; Riya called out.</p>\n<p>There was no answer. She moved into the next tiny chamber, then the next, scraping her shoulder against the door frames. Her foot hit a step in the dark and she fell, her cane clattering onto rock.</p>\n<p>A howl of anguish echoed through the maze, now more animal than human. Riya pulled herself to her feet, holding out the pistol in both hands. She turned to go back the way she had come, but clouds had blotted out both moon and stars. She reached out in the dark, groping along the sandstone bricks.</p>\n<p>A square room.</p>\n<p>A long chamber.</p>\n<p>And she was out, not in open desert, but a courtyard in the center of the great ruin. She squinted through the dimness. She saw the silhouette edges of broken walls, some scattered bristly shrubs, and a deep circle dug into the earth: a <i>kiva</i>, a Native worshipping chamber.</p>\n<p>The screaming ceased. The man&rsquo;s voice was no more, but there was another sound in the night air: a sound of battle.</p>\n<p>Riya spun and stared up at the crest of a nearby mesa. She could just make out the silhouetted shape of Omicron against the gray clouds, moving this way and that. A strange weapon was in his hand, like something between a sword and a whip, bending, stabbing, slicing, illuminated by its own magical blue light. Sable&rsquo;s weapon, enhanced by the gauntlet. She saw the shapes of the mighty achiyalatopas struggling with the wizard, their winged bodies reduced to scattered stones with each magical attack.</p>\n<p>&ldquo;One less thing to worry about,&rdquo; thought Riya, but the words brought her no comfort. The air had gone deathly cold.</p>\n<p>Riya spun, gasped, fired her gun into the night.</p>\n<p>A woman stood in front of her, mere inches away, lank black hair falling over emaciated shoulders all the way to the sand at her feet. Her eyes were chips of ice, her mouth a wicked slash of broken teeth, her body naked, gaunt, almost skeletal.</p>\n<p>The bullet flew, but the witch did not move. Instead, a wisp of black smoke slithered from where the bullet hole should have been.</p>\n<p>A scrape to her right. Riya twisted, fired again.</p>\n<p>Another witch, the mirror image of the first, walked toward her across the courtyard, hands extended, thin black tongue licking thin black lips.</p>\n<p>Riya fired again, then again, ears ringing, bullets whistling through the ghostly form to crunch into the walls behind her.</p>\n<p>Another witch on her left, two more behind her. There were witches in the ruined windows and balanced on the jagged walls. Skinny bodies, dragging wet hair across sand and stone, their breath like the panting of dogs.</p>\n<p>Palm sweaty over the grip of her gun, Riya spun in place. Her gaze snapped from one hideous body to the next. One had to be real, the rest, projections. She searched for a sign of trueness, the outlier, the one true monster.</p>\n<p>&ldquo;Where the hell is Sable?&rdquo; Riya hissed through clenched teeth.</p>\n<p>A witch leaped forward, bending near the ground as it slipped past Riya&rsquo;s knees like a wind. She fired at it and the bullet sprayed sand into her face. Another witch swept behind her and this time Riya felt broken fingernails scraping across her legs. She twisted, losing her balance and shooting into the air.</p>\n<p>They closed in, inching nearer with lumbering, silent steps.</p>\n<p>Riya&rsquo;s finger flexed but the pistol&rsquo;s slide locked back into place; she was out of ammo. She punched out with the gun, swinging wildly, meeting cold emptiness with each strike.</p>\n<p>Then she was lost in a swirling tangle of black hair, groping fingers, icy gazes. They would hold her down, eat her eyes, chew on her bones until nothing was left.</p>\n<p>Riya shut her eyes, waiting for death.</p>\n<p>The ground trembled. The witches fell back, startled and shrieking. Riya kneeled in the sand and turned her head to watch as a huge shape leaped over a broken wall and galloped toward her.</p>\n<p>It was a colossal bison, hooves beating the ground, horns dipped and eyes glistening. Upon its back, without saddle or reins, sat Sable Crow, her snowy braids bouncing on her shoulders, her Winchester raised in her hands. She fired as she rode, the rifle&rsquo;s sparks lighting up the ruins all around.</p>\n<p>One of the witches to Riya&rsquo;s right shrieked and stumbled. At once, each of the other ghostly bodies vanished into black haze. Sable fired again, the bullet punching through the true witch&rsquo;s protruding ribs. The witch groaned and hobbled backward toward the open kiva. As the bison galloped forward, Sable tossed her rifle to Riya and drew her silver tomahawk. The bison reached the witch and Sable swung her tomahawk into the witch&rsquo;s face. The witch screamed and fell backward into the kiva, her body hitting the ground twelve feet below with a <i>thud</i>.</p>\n<p>Shaking, Riya pulled herself to her feet, rifle in hand, and walked toward the towering bison and its majestic rider. Sable leaned forward, patting her mount&rsquo;s furry neck. Below her, the thin form of the witch writhed in the shadows, cursing in a language Riya did not know or care to ever hear again.</p>\n<p>&ldquo;How did you know which one was the true witch?&rdquo; Riya asked Sable.</p>\n<p>Sable swept aside one of her braids and wiped her face. A drop of black blood had splashed onto her left cheek. &ldquo;When you&rsquo;ve shared a womb with someone, you don&rsquo;t easily forget them.&rdquo; She pulled something from a shirt pocket. &ldquo;Here, girlie! You finish it.&rdquo;</p>\n<p>She flicked a tiny, glowing object to Riya, who caught it. It was one of the golden cartridges Sable made, and it was tipped with a spike of radiant orange, like fire frozen in time.</p>\n<p>Riya pushed the magical bullet into the rifle&rsquo;s loading gate, pumped the lever, and raised the gun. She fired into the kiva and a brilliant vortex of flame bloomed in the night, issuing the hideous scream of the damned. And something else.</p>\n<p>&ldquo;Oh my god! Did you see that?&rdquo; Riya asked, clutching at her chest. &ldquo;The witch changed! Right when the bullet struck! She looked different. Like an old man. An old man screaming. Sable?&rdquo;</p>\n<p>Sable didn&rsquo;t answer at first. She was staring across the landscape.</p>\n<p>&ldquo;The spirit needed a body to possess. It took one when it first awoke.&rdquo;</p>\n<p>Riya&rsquo;s blood went cold. She gazed into the kiva. It was empty but for threads of snaking smoke. &ldquo;So I just&hellip; Sable, did I just&hellip;? Why didn&rsquo;t you tell me it was possessing another&rsquo;s body? Why! I should have known. I would have...&rdquo;</p>\n<p>&ldquo;Would have what? You did nothing wrong. You saved him. You set him free.&rdquo;</p>\n<p>&ldquo;I shot him!&rdquo;</p>\n<p>&ldquo;You did what you had to do. What, you still thinking this is all some grand adventure with a happy ending? All stories end in death, Riya De Moor. Best you remember that.&rdquo;</p>\n<p>Riya turned away from the kiva, eyes wet. Furious, confused, terrified. She retrieved her cane, feeling along the floor in the Great House, then joined Sable. Leaving the ruins to meet up with Omicron, they all departed the canyon without another word.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section20>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>Riya packed the last of her things and loaded the bag into the back of the battered Titan. Omicron had magically repaired the windscreen, but the truck still looked like it had aged a decade in the six days Riya had driven it.</p>\n<p>A light rain was falling, turning the sand red. Omicron stood on the trailer&rsquo;s porch, arms crossed, smiling at Riya.</p>\n<p>&ldquo;M&rsquo;lady did well last night.&rdquo;</p>\n<p>&ldquo;I&rsquo;m just glad it&rsquo;s done. And a bit desperate to get back in my classroom, where battles exist only in books. You sure you want to stay here?&rdquo;</p>\n<p>&ldquo;For a few days, aye. I have research to do with Lady Crow. Amongst other things, we have an idea of how to magically treat that spinal injury of yours.&rdquo;</p>\n<p>&ldquo;I wouldn&rsquo;t say no to that.&rdquo; She took a step toward him, and her worry must have shown on her face. Omicron&rsquo;s expression turned serious and he walked down the steps to join her.</p>\n<p>&ldquo;Is something wrong?&rdquo; he asked.</p>\n<p>&ldquo;It&rsquo;s just&hellip; Sable told me something about the witch. She said it was her twin sister. At least I think that&rsquo;s what she meant. She said something about sharing a womb with the monster.&rdquo;</p>\n<p>&ldquo;Hm. Perhaps they were twins. Or perhaps Lady Crow was merely referring to time spent with the wanagi in Death. Or maybe she meant that creature was once some other part of herself. I do not know, m&rsquo;lady, and I doubt if she will ever divulge the whole truth. That&rsquo;s often how it was in the old days, in the deep past. Beauties beyond comprehension. Terrors no mortal could face. Mysteries best left alone.&rdquo;</p>\n<p>&ldquo;I don&rsquo;t like mysteries I can&rsquo;t solve.&rdquo; She scanned Omicron&rsquo;s wrinkled face, his mismatched eyes, his cryptic smile. &ldquo;She also said that<i> you</i> are more than you say, that your past is more complicated. Is that true?&rdquo;</p>\n<p>&ldquo;Isn&rsquo;t everyone&rsquo;s past complex?&rdquo;</p>\n<p>&ldquo;That&rsquo;s not what I mean, Omicron. If I&rsquo;m going to do this with you, I want the truth. Were you born in the Middle Ages? Was Merlin the first name given to you or were there others, and other lives, in the deep past?&rdquo;</p>\n<p>He stroked his beard. &ldquo;Hm. Well. There were other names, aye. Other times. Other ages.&rdquo;</p>\n<p>&ldquo;Then who are you, really?&rdquo;</p>\n<p>He looked at her then, a pained expression on his ancient face. &ldquo;I&hellip;am Omicron, of course!&rdquo; He laughed but there was no music in the sound.</p>\n<p>&ldquo;So you won&rsquo;t tell me more?&rdquo;</p>\n<p>&ldquo;Not...yet. Does that make it impossible for you to fight by my side?&rdquo;</p>\n<p>She considered, stabbing her cane into the sand. &ldquo;If anything made me walk away, it would be what I saw last night. What I<i> did</i> last night. But no. I can&rsquo;t quit now. If I quit fighting, I&rsquo;d always wonder what tragedies happened because I wasn&rsquo;t there to try and stop them. So...so I&rsquo;m with you, Omicron Wonderbuck, or whatever your true name is.&rdquo;</p>\n<p>&ldquo;Splendid! Then you&rsquo;d best be on your way for now. Don&rsquo;t want to miss that flight! Say hello to Lady Violet for me. I&rsquo;ll see you soon.&rdquo;</p>\n<p>&ldquo;When is <i>soon</i>?&rdquo;</p>\n<p>&ldquo;When I need your help again. Maybe a week. Maybe a month. Only the gods know for sure, and maybe not even them.&rdquo;</p>\n<p>She pulled herself into the driver&rsquo;s seat, wincing as she adjusted her sore back. &ldquo;Cheers.&rdquo;</p>\n<p>&ldquo;Goddess speed, m&rsquo;lady.&rdquo;</p>\n<p>Riya drove south along the nameless road, through gentle rains and blue mists, past mountains, mesas, jagged gorges, back to Albuquerque.</p>\n<p></p>\n<p></p>\n<p></p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section21>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- Episode 3: “Nostos” -->\n<!-- ### -->\n<p>The soldier standing guard inside the interrogation room was almost seven feet tall, a camo-clad statue of muscle with a square chin and bored, beady eyes&mdash;the typecast henchman. The MP-443 Grach pistol at his side looked comically small against his bulk. No doubt he had been chosen for the post because of his cinematic look.</p>\n<p>Riya adjusted her sore wrists in the handcuffs connected to the metal chair. She wanted to lean forward onto the table in the center of the cell and take a nap but the handcuffs prevented it. More than anything, she wanted a shower. There was still blood in her hair, blood soaked into her skin, blood under her fingernails.</p>\n<p>She heard footsteps from the hall and voices bickering in Russian. The door swung inward, startling the guard, who jumped to attention and saluted with such bravado that he smacked himself in the face. A lone man entered and shut the door behind him. Without a word, the man sat stiffly in a chair across from Riya, clicked open the briefcase he was carrying, and began pulling manila envelopes out one at a time and setting them with OCD-precision along the edge of the table. When the last envelope was in place, he snapped the briefcase shut, set it on the floor beside his chair, and opening up the first envelope, began to silently read from a stapled stack of papers.</p>\n<p>Riya exhaled, perhaps louder than was necessary, and examined the newcomer to pass the time. The man couldn&rsquo;t have looked more unlike the burly guard. He was short, gaunt, liver-spotted and sharp-eyed, with a gray goatee that traced his thin lips and weak chin. Clearly a career military man, but whereas the soldier by the door had spent his time at the gym and shooting range, this older man was used to sitting behind desks, reading classified briefings, and making dangerous phone calls.</p>\n<p>After ten minutes of scanning documents and flipping pages, the man cleared his throat&mdash;dislodging a large amount of phlegm, which he swallowed surreptitiously&mdash;and turned back to the first page. He began to read aloud, enunciating each word in very good English, though with a distinct western Russian accent.</p>\n<p>&ldquo;Riya De Moor. Born in St. Thomas Hospital, London, on the twenty-ninth of July, 1983&hellip; Oh my!&rdquo; He looked up from the page at Riya. &ldquo;What are the chances? Today is your birthday, isn&rsquo;t it?&rdquo;</p>\n<p>&ldquo;Happy birthday to me,&rdquo; she said.</p>\n<p>&ldquo;I am afraid the kitchen in this prison is hardly suited for baking, otherwise I might order a cake be made in your honor.&rdquo;</p>\n<p>&ldquo;It&rsquo;s the thought that counts,&rdquo; said Riya, baring her teeth in a mock smile.</p>\n<p>The man cleared his throat again and cast his gaze back onto the page.</p>\n<p>&ldquo;Riya De Moor,&rdquo; he repeated. &ldquo;Born in St. Thomas Hospital, London, on the twenty-ninth of July, 1983. Father: Johannes De Moor. Dutch. An architect. Mother: Faiza Khurmi De Moor. Indian. Formerly a professor of cognitive neuroscience at Imperial College. Currently&hellip;unemployed. And you have a younger sister. Savi. Is that all correct?&rdquo;</p>\n<p>&ldquo;You forgot about the family dog,&rdquo; said Riya. &ldquo;Nanak. He was a German Shepherd.&rdquo;</p>\n<p>He turned the page, carefully creasing the folded corner between thumb and forefinger. Riya decided he definitely had OCD.</p>\n<p>&ldquo;According to our records,&rdquo; he continued, &ldquo;you graduated from University College London in 2005, but rather than using your history degree, you joined the Royal Military Police. Curious. Was it an exciting career?&rdquo;</p>\n<p>Riya shrugged. &ldquo;Not really. Mostly I assisted civilian police forces. Basic crime reduction duties. Lots of paperwork.&rdquo;</p>\n<p>&ldquo;Is that why you volunteered to go to Iraq during Operation Telic in 2007? I see here that you were attached to the Royal Marines. Command 44. You had four confirmed kills. But on your second tour you were injured.&rdquo;</p>\n<p>&ldquo;Wow,&rdquo; said Riya dryly. &ldquo;Your Russian intelligence officers are really something. They&rsquo;ve learned how to use Google.&rdquo;</p>\n<p>He set down the papers and stared at her. &ldquo;I want to know what you did next. You see, in my report it says you retired from the military and settled in Wales to&mdash;&rdquo; he double-checked the paper, &ldquo;&mdash;teach school children.&rdquo;</p>\n<p>&ldquo;That about sums it up.&rdquo;</p>\n<p>&ldquo;<i>But</i>&hellip;you never left the military, did you, Lance Corporal De Moor? Or if you did, it was to join a separate branch of the British government. Secret Intelligence Service?&rdquo;</p>\n<p>&ldquo;You think I&rsquo;m MI6?&rdquo;</p>\n<p>&ldquo;I think you are more than a schoolteacher. After all, why would a schoolteacher crash a speedboat into the Russian coast outside of my city earlier this morning? Why would she be racing across the Black Sea last night, pursued by the Turkish military?&rdquo;</p>\n<p>Riya flexed her lips and blew a puff of air up at her fringe, knocking it sideways to alleviate an itch. &ldquo;Hm. Yeah, when you put it that way&hellip;&rdquo;</p>\n<p>He placed his hands&mdash;skinny fingers like a pale spider, perfectly manicured nails&mdash;on the tabletop and leaned toward her.</p>\n<p>&ldquo;Why were you in Turkey?&rdquo;</p>\n<p>&ldquo;Holiday.&rdquo;</p>\n<p>&ldquo;Tell me, De Moor! It will be easier for you this way. There are other interrogators besides me in this prison. They have other methods than I do. Less pleasant methods.&rdquo;</p>\n<p>Riya adjusted herself in the chair, her handcuffs jingling. &ldquo;What time is it?&rdquo;</p>\n<p>&ldquo;Don&rsquo;t change the subject. We&mdash;&rdquo;</p>\n<p>&ldquo;The time! What is it?&rdquo;</p>\n<p>His face flashed annoyance. &ldquo;What does that have to do with&hellip; Ten in the morning!&rdquo;</p>\n<p>Riya nodded, calculating hours in her mind, estimating flight durations, trying to remember the closest major airport to Tuapse, Russia.</p>\n<p>&ldquo;Ten? Okay then,&rdquo; she said. &ldquo;Guess I&rsquo;ve got time. Why not? Frankly, it&rsquo;s a helluva story. It might be fun to tell someone.&rdquo;</p>\n<p>The interrogator scratched his goatee with a manicured nail. &ldquo;I am glad you will cooperate. Much easier this way. So, in your own words. What happened? Why are you here?&rdquo;</p>\n<p>Riya made sure her expression remained confident while she collected herself. Her police and military training had kept her fear and stress in check during the day&rsquo;s events, but to keep her imprisoners distracted until she was rescued, she would need to call on another type of training. As a history teacher, Riya had learned to take even the most mundane of past events and turn them into compelling stories for her students, and lucky for her, the story she had to tell now was anything but mundane.</p>\n<p>She grinned. &ldquo;It all started with a man who calls himself Omicron, a monster from ancient legend, and the burial mound of Achilles: hero of the Trojan War, who died, was burned and buried, and rose again&hellip;last week&hellip;outside the Turkish village of Erklik&hellip;&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section22>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p><i>Four days earlier&hellip;</i></p>\n<p></p>\n<p>&ldquo;Damnation!&rdquo; cursed Omicron, stamping a foot.</p>\n<p>&ldquo;You know, you really shouldn&rsquo;t wear socks with sandals,&rdquo; said Riya. &ldquo;It&rsquo;s sort of an unwritten rule.&rdquo;</p>\n<p>&ldquo;&lsquo;Tis not the time for jests, m&rsquo;lady!&rdquo;</p>\n<p>The wizard and the schoolteacher stood atop a grassy hill, their backs to the vast, stepped landscape of eastern Turkey&mdash;bone-white rock, milky skies, undulating hills of gold and green. At their feet lay a mound of freshly-turned earth. Clumps of soil, mingled with what looked like dried blood, led down the slope in front of them toward a coniferous woodland. Riya squinted at the shadowy edge of that forest, then turned to survey their lonely surroundings. To the north, the sun shone on the terracotta roofs of the little village of Erklik.</p>\n<p>&ldquo;It must have been frightening for him, waking up out here, alone,&rdquo; said Riya.</p>\n<p>&ldquo;We should have been here! &lsquo;Tis <i>your</i> fault we were late!&rdquo;</p>\n<p>&ldquo;Come off it, Omicron! How do you figure that?&rdquo;</p>\n<p>&ldquo;Because if we hadn&rsquo;t made that pit stop in the Himalayas&mdash;&rdquo;</p>\n<p>&ldquo;That was <i>your</i> idea. You said, to celebrate the end of school term, you&rsquo;d take me on a holiday to that mythic spring!&rdquo;</p>\n<p>&ldquo;Aye, but only to try and magically cure <i>your </i>ruddy back.&rdquo;</p>\n<p>&ldquo;And I appreciate that,&rdquo; said Riya, flexing her torso from side to side, keenly aware of the improvement the magical steamy pool had rendered several days earlier, &ldquo;but you can&rsquo;t blame me for the fact that we showed up here late.&rdquo;</p>\n<p>&ldquo;Hm. Well. Perhaps. Though it still feels preferable to blaming myself.&rdquo;</p>\n<p>Riya rolled her eyes. She knelt and examined the ground.</p>\n<p>&ldquo;Crazy to think he was really here,&rdquo; she mused. &ldquo;The godlike Achilles, digging his way up from the grave.&rdquo;</p>\n<p>&ldquo;Oh, he was here, alright, for almost thirty-two-hundred years! And we missed his awakening by what? Two days perhaps! &lsquo;Twas our duty to be here. <i>My</i> duty.&rdquo;</p>\n<p>&ldquo;No reason to mope,&rdquo; said Riya, standing. &ldquo;We can follow his trail through those woods, though isn&rsquo;t that the area the villagers told us to avoid?&rdquo;</p>\n<p>&ldquo;They say it hasn&rsquo;t been safe for months.&rdquo;</p>\n<p>&ldquo;And you believe them? You really think some cultish terrorist group is operating here, completely off the international radar? This <i>Demir Dua</i> organization sounds more like a local legend.&rdquo;</p>\n<p>Though Omicron&rsquo;s expression remained angry, his lips twitched a smile. &ldquo;M&rsquo;lady has no trouble believing a legendary hero from the Trojan War woke up from death, <i>but</i> the possibility of a terrorist training camp in a Turkish forest is, what, too much to fathom?&rdquo;</p>\n<p>Riya jabbed him in the shoulder. &ldquo;Come on. Let&rsquo;s find this guy before it gets dark.&rdquo;</p>\n<p>Omicron pulled on the Gauntlet of Camelot. &ldquo;We must advance with caution. I sense a great dread in that forest. An old evil, and a new one.&rdquo;</p>\n<p>They moved down the hill, Riya with one hand hovering over the holstered grip of her pistol, Omicron occasionally closing his eyes and reaching out with his gauntleted hand.</p>\n<p>Riya found herself wishing Sable Crow was with them as they moved into the forest. Sable could track better than any human alive, or so she bragged. But the ancient gunslinger was apparently trekking through the Amazon in search of sacred materials to use in her magic bullets. Omicron had told Sable of their destination and was hopeful she would join them in four or five days time. For now, it was just Riya and the wizard against who-knows-what.</p>\n<p>After wandering for twenty minutes through the maze of lofty trees, the trail they were following forked in two. Omicron took the left, instructing Riya to go right. She did so without a quarrel, although the woods made her uneasy. They were too quiet, the trees too still, without any sign of beast or bird or insect.</p>\n<p>&ldquo;Lovely summer holiday, this,&rdquo; she grumbled to herself, ducking below the spiky boughs of a bent tree.</p>\n<p>She came upon a path in the woods. Tire tracks were visible in streaks of dried mud. Riya had no sooner stepped onto the path when she heard the sound of an engine growing louder. She sprinted back into the brush, but a motorbike&mdash;old and rusty and issuing acrid smoke&mdash;had already appeared around a corner in the path.</p>\n<p>Riya&rsquo;s hand darted to the P226 at her side. She drew out the pistol and yanked back the slide.</p>\n<p>The driver of the motorbike stared at her, slowing, then stopping. He was about Riya&rsquo;s age, bearded, with dark eyes and a sweeping scar from one ear to the other, like a throat-cutting gone wrong, like a monstrous smile. An AK-47 hung at his side.</p>\n<p>&ldquo;Shit,&rdquo; Riya hissed, raising her pistol. She felt no desire whatsoever to shoot this man. She wanted him to turn on his motorbike, drive off into the woods, and leave her be.</p>\n<p>His eyes&mdash;coldly curious, hungry&mdash;scanned her where she stood beside the path.</p>\n<p>&ldquo;I&rsquo;m just here to look for someone,&rdquo; Riya told him, her voice calm. &ldquo;Nobody needs to get hurt. Do you understand English?&rdquo;</p>\n<p>He licked his lips, slid off the motorbike, took a step toward Riya. His eyes locked with hers, and she hated what she saw in them. Riya&rsquo;s finger tightened on the trigger.</p>\n<p>A spear sunk into the man&rsquo;s chest. Blood splattered the pine trees and the motorbike. The body fell in a heap on the path. Dead.</p>\n<p>Riya gasped. She turned on her heel, aiming in the direction from where the spear had flown.</p>\n<p>&ldquo;Omicron? Is that&hellip;?&rdquo;</p>\n<p>She could see no one with her in the woods. Turning back to the dead terrorist, she noted that the spear pinning him to the earth was a simple tree branch stripped of bark with its tip whittled to deadly perfection.</p>\n<p>&ldquo;Who would...?&rdquo;</p>\n<p>She tilted her head back to look into the forest canopy. And there he was.</p>\n<p>Achilles was seated in the crook of a tree, as still and silent as a statue. His body blended into the browns and reds of the foliage. Had it not been for the brilliant whites of his eyes, Riya might not have seen him at all, not even at second glance.</p>\n<p>What had Riya expected him to look like? She couldn&rsquo;t remember. But it couldn&rsquo;t have been this. Achilles was tall, muscular, brown as the earth. His whole body was covered in burns: a quilt of scar tissue, wrinkled and blackened. His left leg ended at the calf. He sat poised as a cat, noble as a stallion, seeming to radiate power that made the hair on Riya&rsquo;s neck stand on end.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section23>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>In the prison, the interrogator tapped his fingers irritably on the table.</p>\n<p>&ldquo;Really, De Moor? A wizard and an ancient warrior? Do you take me for the sort of person who enjoys having their time wasted?&rdquo;</p>\n<p>&ldquo;It&rsquo;s the truth,&rdquo; said Riya, adjusting her wrists in the handcuffs. &ldquo;Whether or not you believe it is up to you. Now then, shall I continue?&rdquo;</p>\n<p>The interrogator opened his mouth to protest but the guard by the door blurted out, &ldquo;Why was Achilles burned?&rdquo; in a strong Russian accent.</p>\n<p>Riya smirked. &ldquo;Achilles died when he was shot through the ankle with a poisoned arrow. They burned his body on a ceremonial pyre and buried him beneath a great mound. Only they didn&rsquo;t understand who he really was&mdash;<i>what</i> he really was.&rdquo;</p>\n<p>&ldquo;And that is what?&rdquo; asked the guard.</p>\n<p>&ldquo;The son of a goddess.&rdquo;</p>\n<p>The interrogator moaned and massaged his forehead with the fingers of his right hand.</p>\n<p>&ldquo;As an infant,&rdquo; Riya explained to the guard, &ldquo;Achilles&rsquo; mother, Nereid Thetis, dipped him into the sacred river Styx while holding him by the ankle. His skin was given magical protection, all except his left ankle and foot. When Paris&rsquo; arrow found its mark, Achilles was defeated, but fire could not entirely consume his demigod body. The ankle and foot rotted away with time but the rest of his flesh remained, entombed, until the goddess Arianrhod sent his spirit back to this world, last week.&rdquo;</p>\n<p>&ldquo;Wow,&rdquo; said the guard, nodding his approval. &ldquo;Pretty cool.&rdquo;</p>\n<p>&ldquo;Oh shut up, Egor,&rdquo; said the interrogator.</p>\n<p>&ldquo;You don&rsquo;t find it interesting?&rdquo; asked Riya.</p>\n<p>&ldquo;Certainly not! Though&hellip;I am curious about this terrorist you met in the woods. He was Turkish?&rdquo;</p>\n<p>&ldquo;Dunno. The villagers said the terrorists came from all sorts of places. The Middle East. Europe. Russia.&rdquo;</p>\n<p>&ldquo;And you believed these villagers?&rdquo;</p>\n<p>&ldquo;It wasn&rsquo;t just them. Achilles had been hiding in those woods for two days before Omicron and I arrived, watching the Demir Dua, or <i>Iron Prayer</i>, as the terrorist organization&rsquo;s name translates. He had learned a lot, including information imperative to our mission in Turkey.&rdquo;</p>\n<p>&ldquo;I thought you and the wizard came to find Achilles,&rdquo; said Egor.</p>\n<p>&ldquo;We did,&rdquo; said Riya. &ldquo;But we also came to find, and to kill, something else.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section24>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p><i>Three days earlier&hellip;</i></p>\n<p></p>\n<p>Riya and Omicron had rented a sparsely furnished flat on the second floor of a building on the edge of Erklik. It was the only posted rental in the town, and though the online pics had been misleading and the rooms smelled of rot and cigarettes, Riya was relieved to stay safely inside four walls the day after their misadventure in the woods.</p>\n<p>Achilles, now dressed in clothes Riya purchased in town, sat hunched on a stool by the kitchen window. Riya watched him from the kitchen doorway. He didn&rsquo;t seem to move at all. Not to scratch an itch. Not to sigh. Not even to breathe. It was as if the spirit inside that huge, scarred form had not yet fully latched onto the physical body.</p>\n<p>&ldquo;You hungry yet?&rdquo; she asked him.</p>\n<p>&ldquo;Hunger. Thirst. Exhaustion. What are these?&rdquo;</p>\n<p>His voice was a beautiful growl, dangerous and deep. He had not spoken for the first ten hours after Riya found him in the forest, but when he finally did, it was in perfect English. A panglot, like Omicron. Taught the First Words by his mother.</p>\n<p>&ldquo;You don&rsquo;t like being back, do you?&rdquo; asked Riya.</p>\n<p>&ldquo;I am back. And the fates care not for men&rsquo;s desires. We are always at their will. That is the price.&rdquo;</p>\n<p>&ldquo;Of what? The life of a warrior?&rdquo;</p>\n<p>&ldquo;Of existence.&rdquo; He moved to rub at the stump of his left leg. The movement was stiff, awkward, automaton-esque. &ldquo;I do not like being back, Riya De Moor. Not like this. Not broken. Not ruined.&rdquo;</p>\n<p>&ldquo;Omicron can help you. He helped me. I could barely walk without a cane until a week ago.&rdquo;</p>\n<p>&ldquo;A cane? Look at me! I am shattered. Little more than a corpse. Some men live in their hearts. Some men live in their minds. I lived in my body, in this body, before... I am back, but I am not truly alive.&rdquo;</p>\n<p>They heard the toilet flush and Omicron entered from the hall, whistling and adjusting his belt.</p>\n<p>&ldquo;Oh quit being dramatic, Achilles!&rdquo; called the wizard, sweeping into the kitchen. &ldquo;You heard the lady. I&rsquo;ll help you regain your former strength.&rdquo;</p>\n<p>&ldquo;I cannot fight. I cannot run!&rdquo;</p>\n<p>&ldquo;And you look like beef jerky, but that&rsquo;s hardly the point.&rdquo; Omicron opened the fridge, surveyed its bare interior, and shut it irritably. &ldquo;From what you told me you saw in those woods, we three have plans to make, and fast. Lady Riya and I were too late to greet you upon resurrection, and for that I am sorry, but we may not be too late to deal with the next of Arawn&rsquo;s monsters.&rdquo;</p>\n<p>&ldquo;Where do we start looking for it?&rdquo; asked Riya.</p>\n<p>&ldquo;No need, m&rsquo;lady. We know where it is. Achilles sensed the beast&rsquo;s presence in the woods. He has a keen nose for dread and divine mischief.&rdquo;</p>\n<p>&ldquo;The monster&rsquo;s already awake? It&rsquo;s in the forest?&rdquo; asked Riya, mentally picturing the terrorist on the motorbike, his scarred neck, his icy eyes. &ldquo;Could it be that&hellip;that the terrorist organization <i>is</i> the monster?&rdquo;</p>\n<p>Omicron shook his head. &ldquo;A poetic theory, but nay. Arawn is not a master of subtlety. This is a beast of tooth and horn and claw. But though Iron Prayer is not the monster, they do <i>have</i> the monster. Achilles told me he could hear it crying out the night before last, from the heart of the terrorists&rsquo; compound. They must have discovered and captured it before we got here.&rdquo;</p>\n<p>&ldquo;No!&rdquo; gasped Riya. &ldquo;Quite the coincidence.&rdquo;</p>\n<p>Achilles crossed his long, scarred arms and shook his head. &ldquo;<i>Coincidence</i> is a fool&rsquo;s word.&rdquo;</p>\n<p>Omicron nodded. &ldquo;There is dark magic at work in this place, m&rsquo;lady. Arawn&rsquo;s vile power infected the earth to awaken monsters, but that same power has leaked into the atmosphere. I have felt it since we first arrived. No doubt it has called these wretched men here from around the globe. Whether Arawn intended his beast to fall into Iron Prayer&rsquo;s hands or not, I am sure it is an outcome he would heartily approve of.&rdquo;</p>\n<p>&ldquo;They could release it in a populated area. Helluva terrorist attack,&rdquo; mused Riya. &ldquo;But for now, surely it&rsquo;ll be as dangerous to them as it would be to us.&rdquo;</p>\n<p>&ldquo;Not yet.&rdquo; Achilles shifted on his stool as if to stand, then, remembering that his left foot was no more, slouched back against the window. &ldquo;The beast you seek is a creature most rare. I have never seen one alive, thank fate, but I have seen the ribcage of one, many stars ago.&rdquo;</p>\n<p>Riya looked from Achilles to Omicron and back again, waiting for the reveal. They had defeated a dragon and killed a witch. Whatever this new adversary was, they must be able to handle it. But then why did she feel so cold, so small, so defenseless when Achilles said, &ldquo;<i>Typhon</i>. We are hunting a typhon.&rdquo;</p>\n<p>It took Riya several seconds to think of how to respond. &ldquo;Okay. But isn&rsquo;t that like a world eater? A creature as big as a mountain? The locals would have noticed it by now. And how could a handful of terrorists capture something like that?&rdquo;</p>\n<p>&ldquo;Typhons start out small,&rdquo; said Omicron. &ldquo;No bigger than a chicken egg, if the fairytales hold true, and they usually do, more or less. But &lsquo;tis said they grow fast.&rdquo;</p>\n<p>&ldquo;The skeletal remains I saw in my youth,&rdquo; explained Achilles, &ldquo;were from a typhon slaughtered at only a few years old. They were&hellip;large.&rdquo;</p>\n<p>&ldquo;How large?&rdquo; asked Riya.</p>\n<p>&ldquo;Large enough to be mistaken for a chain of islands. Several cities had been built upon the bones. Great temples. Public houses. Taverns. All stacked up on the mossy corpse of a typhon.&rdquo;</p>\n<p>&ldquo;Charming image,&rdquo; said Riya. &ldquo;But I can&rsquo;t imagine a terrorist start-up, no matter how well funded, being able to house and feed a mythical creature like this. Maybe it&rsquo;ll starve? That would save us some trouble.&rdquo;</p>\n<p>Omicron found a package of dried noodles in a dusty cabinet and set a pot to boil. &ldquo;Typhons feed on pain, m&rsquo;lady. They flourish on a diet of violence and fear. You know how a decapitated hydra will simply grow a new head? A typhon is a bit like that, only exponentially more dangerous. Any attack&mdash;be it spear or bullet or nuclear blast&mdash;will only serve to make a typhon tougher, larger, deadlier. The more you fight it, the more you strengthen it.&rdquo;</p>\n<p>&ldquo;Fan-damn-tastic,&rdquo; said Riya. &ldquo;So we have to annihilate the thing without hurting it? How is that supposed to work? Achilles, do you know how the dead typhon you saw was defeated?&rdquo;</p>\n<p>&ldquo;Poisoned, I believe.&rdquo;</p>\n<p>Omicron splashed the noodles into the boiling water. &ldquo;Well there we go! The beast&rsquo;s insides are vulnerable.&rdquo;</p>\n<p>&ldquo;But that hardly helps us,&rdquo; said Riya. &ldquo;It&rsquo;s locked up in a terrorist compound. What are we to do? Storm the place? Just the three of us?&rdquo;</p>\n<p>Omicron retrieved a bowl and spoon, looking thoughtful. &ldquo;We&rsquo;d need more firepower for that. But aye. We don&rsquo;t have time to wait for Lady Crow. And this will not be the simple monster hunt of our previous missions. This will be a modern battle against heavily-armed soldiers. Prepare yourself for that, m&rsquo;lady. But first, I want to infiltrate this camp of theirs. Demir Dua<i> </i>intrigues me. I think I&rsquo;ll don a buckish guise and return to the woods after my meal. See what I can find.&rdquo;</p>\n<p>&ldquo;And what should we be doing?&rdquo; asked Riya, worried her role would be to sit and wait as it had been during much of their time in New Mexico.</p>\n<p>&ldquo;Achilles must rest. <i>And eat</i>. You won&rsquo;t be half as surly with a full belly, my new friend. Riya, perhaps you could work on acquiring a stash of weapons worthy of storming the compound.&rdquo;</p>\n<p>&ldquo;And how am I supposed to do that?&rdquo; asked Riya. &ldquo;Erklik has a couple restaurants, so fattening up Achilles is easy enough, but I doubt they&rsquo;re hosting any major gun shows.&rdquo;</p>\n<p>&ldquo;Use your contacts,&rdquo; said Omicron. &ldquo;You must have peers from your days as a soldier you can call.&rdquo;</p>\n<p>&ldquo;Nope.&rdquo;</p>\n<p>The wizard strained his pasta and gave Riya a doubtful glance through the rising steam.</p>\n<p>&ldquo;Well, maybe one,&rdquo; Riya admitted. &ldquo;But I am not calling <i>him</i>.&rdquo;</p>\n<p>&ldquo;Oh, of course you are, m&rsquo;lady!&rdquo; beamed Omicron, slurping up a hot noodle and leaving flecks of water in his beard.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section25>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>Two additional soldiers had joined burly Egor by the interrogation cell&rsquo;s door. The three men stood huddled and looking at Riya, taking in each word of her tale. She had stopped addressing the interrogator directly except for occasional glances. The soldiers were a much more keen audience.</p>\n<p>&ldquo;So you had to get weapons?&rdquo; asked Egor. &ldquo;For the wizard and the Greek?&rdquo;</p>\n<p>&ldquo;I got guns for me, mostly,&rdquo; said Riya. &ldquo;At the time I didn&rsquo;t think about weaponry for Achilles. And Omicron fights with a combination of his sorcery, a unique weapon made for him by Sable Crow, and a magical gauntlet.&rdquo;</p>\n<p>The soldiers nodded and <i>ooh!</i>ed appreciatively.</p>\n<p>&ldquo;Where did you get your weapons?&rdquo; asked Egor.</p>\n<p>&ldquo;I made a call to someone I knew from back in Iraq when I fought alongside the Royal Marines. Someone I had thought and hoped I would never have to see again.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section26>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p><i>Two days earlier&hellip;</i></p>\n<p></p>\n<p>Omicron still hadn&rsquo;t returned from his reconnaissance mission in the woods the next afternoon, as Riya stood alone in a field outside Erklik. The atmosphere was alive with a sharp breeze, a cool blue light, insect calls. She could see the distant line of trees where the wizard had no doubt infiltrated the terrorist compound. Concerned as she was for his safety, most of Riya&rsquo;s energy was devoted to stressing about the upcoming meeting.</p>\n<p>She spotted the plane approaching from the southeast. It landed on the flat stretch of wild grass, crunching to a stop just in front of Riya. She stared up at the private jet and sighed. The door swung open, a steep set of stairs descended, and a man about Riya&rsquo;s age came skipping down, two steps at a time. He pushed his sunglasses up to settle into his greased hair, and rolling up his silk sleeves, gave Riya a tactless look over.</p>\n<p>&ldquo;Well, well. Look at you, doll! You&rsquo;re really here. And looking a-okay. Gotta say, you were the last sucker in the unit I ever thought I&rsquo;d see again. Somebody said you&rsquo;d retired or some shit. Teaching school from a wheelchair or something.&rdquo;</p>\n<p>&ldquo;Good afternoon, Bonneville. I assume you have what I asked for?&rdquo; she said curtly.</p>\n<p>&ldquo;Now, now. None of this<i> Bonneville</i> bull. You call me Staff Sergeant Jameson Bonneville. Hah! Just kidding you, doll. Just call me Jock. Neither of us wear the uniform anymore.&rdquo;</p>\n<p>&ldquo;My uniform is back at home in Wales, medals and all,&rdquo; said Riya. &ldquo;Where&rsquo;s yours? Oh wait, when a soldier is court-martialed and dishonorably discharged, they probably take back the uniform, don&rsquo;t they?&rdquo;</p>\n<p>Jock&rsquo;s slick smile flattened out. &ldquo;Whoa, sweetheart. Retirement hasn&rsquo;t made you any more charming, has it? You always were a bit of a&mdash;&rdquo;</p>\n<p>&ldquo;Do you have my weapons or not?&rdquo;</p>\n<p>&ldquo;Yeah, yeah. I got it all. I thought it was a prank when you called me yesterday. <i>Riya De Moor here. Could you bring a couple of crates of killing machines over to Middle-of-Nowhere, Turkey, ASAP?</i> But here I am, as promised, and how do you greet me? Judgment! Sure I got caught selling weapons in a less than legal manner, but guess what, Lance Corporal Doll, today, <i>you&rsquo;re</i> the one buying my products! A royal pain in the arse, and a hypocrite.&rdquo;</p>\n<p>&ldquo;I have my reasons, Jock. Just unload the gear and be on your way.&rdquo;</p>\n<p>&ldquo;Gladly.&rdquo; He walked to the back of the jet and, with the assistance of the pilot, set two crates onto the grass, opening them with a flick of the hand and a salesman&rsquo;s toothy grin. &ldquo;Boo ya! One bloody beautiful L96 sniper rifle with adjustable bipod and static iron sights. You can take out a target from over a thousand meters with this. Two Gen 4 Glock 17 9mm pistols with 17-round magazines. Two SA80 A2 assault rifles. Then all the ammo a growing girl could ask for. And last but not least, your L109s. Lotta bang for your buck with these grenades. Literally! Whatcha planning on doing with all this? You know what, scratch that. I don&rsquo;t wanna know! Ignorance is bliss. That&rsquo;s Jock Bonneville&rsquo;s motto. No questions asked. Everybody&rsquo;s happy.&rdquo;</p>\n<p>&ldquo;Yes. I&rsquo;m positively giddy. Can&rsquo;t you tell?&rdquo; Riya pulled out and inspected one of the assault rifles.</p>\n<p>Jock cleared his throat. &ldquo;So with the guns, the grenades, and my delivery fee...&rdquo;</p>\n<p>She set down the gun and reached into a pocket. &ldquo;Here. It all goes on the company card.&rdquo;</p>\n<p>&ldquo;Company card, eh? Didn&rsquo;t know the Department of Education was paying their teachers so well that&mdash;&rdquo; Jock connected a card scanner to his phone, and before swiping, glanced at the black credit card with the golden scarab etching. He went instantly quiet. She watched him stare at the card, color draining from his cheeks, leaving him gray and sickly. Jock swallowed; his hands were shaking so hard it took him three tries to scan the card.</p>\n<p>&ldquo;S-sorry,&rdquo; he stammered, thrusting the card back at Riya.</p>\n<p>&ldquo;What the hell&rsquo;s up with you?&rdquo; Riya asked, putting the card back into her pocket.</p>\n<p>He shook his head, not meeting her eyes. &ldquo;N-nothing. All good.&rdquo;</p>\n<p>&ldquo;Jock? Have you seen the symbol on that card somewhere before?&rdquo;</p>\n<p>He closed his eyes and shook his head emphatically. &ldquo;No. I haven&rsquo;t&hellip; Seriously! Look, ma&rsquo;am. I don&rsquo;t know anything. I swear.&rdquo;</p>\n<p>&ldquo;<i>Ma&rsquo;am</i>? Really?&rdquo;</p>\n<p>&ldquo;I got the payment. You got the guns. I&rsquo;m gonna roll&mdash;&rdquo;</p>\n<p>He jerked backward to run into the plane, but Riya snatched his arm and pulled him violently back.</p>\n<p>&ldquo;Nope! You&rsquo;re not going anywhere until you tell me what you know.&rdquo;</p>\n<p>&ldquo;I don&rsquo;t know anything, De Moor!&rdquo;</p>\n<p>&ldquo;You recognize the symbol. The scarab beetle. Right?&rdquo;</p>\n<p>&ldquo;Well. Sort of. I&rsquo;ve never actually seen it before. Just heard the stories. You hear a lot of stories in my line of work. Meet a lotta shady people. A guy knows a guy knows a guy who saw something.&rdquo;</p>\n<p>&ldquo;Jock, <i>I</i> don&rsquo;t even know what that symbol means. I mean, I know there&rsquo;s some group that pays for what I&rsquo;m doing, but I don&rsquo;t know anything about them.&rdquo;</p>\n<p>&ldquo;Really? So you&rsquo;re not&hellip;one of <i>them</i>?&rdquo;</p>\n<p>&ldquo;One of who?&rdquo;</p>\n<p>&ldquo;The&hellip;the people in the shadows. The people that, throughout history, have&mdash;you know&mdash;pulled the strings. Started the wars. Ended the wars. Covered it all up.&rdquo;</p>\n<p>Riya rolled her eyes. &ldquo;Seriously? You see a gold scarab on a credit card and jump to Illuminati-level conspiracy BS?&rdquo;</p>\n<p>&ldquo;All I know is, when weird shit goes down&mdash;I mean really, really weird shit&mdash;<i>that</i> symbol turns up. Shit gets covered up. People forget. People disappear. Whatever it is you think you&rsquo;re doing with that bloody card, and those guns, and those new terrorist psychos setting up shop near here&mdash;yeah, I know about Iron Hymn or whatever they&rsquo;re called&mdash;it ain&rsquo;t gonna end well, doll. You&rsquo;ve got yourself caught up in something that&mdash;&rdquo;</p>\n<p>The air surged with noise and light. Riya gasped and stumbled to the side, blasted by a shockwave of hot wind that rolled across the field. She stared, dumbstruck, at the source of the explosion. Above the forest to the north blossomed a miniature mushroom cloud of black smoke and golden flame encircled by threads of white lightning.</p>\n<p>&ldquo;Whoa, shit!&rdquo; squeaked Jock. &ldquo;What the hell was that?&rdquo;</p>\n<p>&ldquo;Omicron,&rdquo; panted Riya.</p>\n<p>&ldquo;Get this damn plane off the ground!&rdquo; Jock shouted at his pilot. &ldquo;I&rsquo;m outta here, De Moor. I was never here! Tell your people, I don&rsquo;t know anything. Not a damn thing!&rdquo;</p>\n<p>Riya stood beside the crates as the jet accelerated and tore into the sky. Her eyes were fixed over the top of the trees. The rolling smoke was rising against the blue, and even at this distance, Riya could hear its crackling, unnatural, electric roar. A smell of chemicals and putrid death reached her.</p>\n<p>&ldquo;It ain&rsquo;t gonna end well,&rdquo; she muttered to herself.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section27>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>The handcuffs were chafing Riya&rsquo;s wrists but she hardly noticed. She was enjoying herself. Besides the sharp-eyed interrogator, Egor, and two curious soldiers, there were now three additional officers and two mop-wielding inmate caretakers in Riya&rsquo;s audience. They leaned against the walls and sat on the edge of the table.</p>\n<p>&ldquo;It was a magical explosion, wasn&rsquo;t it?&rdquo;</p>\n<p>&ldquo;Did the wizard die?&rdquo;</p>\n<p>&ldquo;I love L109s!&rdquo;</p>\n<p>&ldquo;Enough!&rdquo; shouted the interrogator, hands on his head. &ldquo;This isn&rsquo;t story-time!&rdquo;</p>\n<p>Riya snickered. &ldquo;You were the one that asked me how I ended up here.&rdquo;</p>\n<p>&ldquo;Let her finish the story, sir!&rdquo; whined Egor. &ldquo;We want to hear about the storming of the terrorist compound!&rdquo;</p>\n<p>One of the inmates, staring intently over the top of his mop, said, &ldquo;But the explosion&hellip; Didn&rsquo;t the wizard destroy the terrorist&rsquo;s hideout while you were buying the weapons from the Englishman?&rdquo;</p>\n<p>&ldquo;Only half of&mdash;of&mdash;&rdquo; Riya swallowed dryly. &ldquo;Could someone get me a drink?&rdquo;</p>\n<p>&ldquo;No, don&rsquo;t get her a&hellip; Oh, why do I bother!&rdquo; grumbled the interrogator as a soldier lifted a can of Coke to Riya&rsquo;s lips.</p>\n<p>&ldquo;Much better,&rdquo; said Riya. &ldquo;So, when Omicron infiltrated the forest, he discovered that Iron Prayer&rsquo;s compound consisted of two primary structures. The first and foremost, where they held the typhon, was a set of restored ruins; an impenetrable palace of concrete, barbed wire, armed turrets, and security cameras. However, the focus of his little private mission was on a second building in the forest. Situated in an abandoned hospital, Omicron discovered that the terrorists had a team of scientists working on a number of&hellip;unspeakable experiments.&rdquo;</p>\n<p>The Russian crowd leaned forward as one, eyes wide, breath held. Riya reveled in the wondrous power of having a classroom&rsquo;s attention.</p>\n<p>&ldquo;It seems that having a monster to release wasn&rsquo;t their only attack plan,&rdquo; Riya explained dramatically. &ldquo;They had been building something else. An army...of cyborgs.&rdquo;</p>\n<p>Whistles of appreciation followed this revelation.</p>\n<p>&ldquo;Omicron told me that they&rsquo;d come close to perfecting the gadgetry: mechanical devices that plug straight into human flesh, connecting nerves and wires, muscles and machines. But he saved us the trouble from having to fight such a force. His magical explosion saw to that. The wizard leveled that facility, narrowly escaping with his life, and also brought back a souvenir.&rdquo;</p>\n<p>&ldquo;A souvenir?&rdquo; said Egor, a glint of understanding in his formerly dull eyes. &ldquo;A gift, I think, for the Greek?&rdquo;</p>\n<p>Riya smiled. &ldquo;Omicron got back to the village a little after I returned with the weapons. He was shaken up and drained of most of his power, but hellbent on going back into the woods the next day and finishing the job. We had to take out the main building and kill the typhon before the terrorists could use it in an attack. So we got some sleep, woke early, and marched off to battle.&rdquo;</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section28>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p><i>One day earlier&hellip;</i></p>\n<p></p>\n<p>Riya adjusted the scope on her newly purchased L96 sniper rifle. She lay on her stomach in dead leaves, hidden behind a tangle of thorns with Omicron. Through the trees, she studied the revamped ruins they would be attacking. A machine gun turret stood outside a pair of heavy iron doors. She could see eight terrorists patrolling outside the compound.</p>\n<p>Leaving the sniper rifle on its stand, she turned and squinted through her binoculars at the snaking road that led out of the woods and up into the meadow beyond. Soft golden fog blanketed the morning landscape.</p>\n<p>&ldquo;I can&rsquo;t see Achilles anymore,&rdquo; said Riya, sitting up.</p>\n<p>&ldquo;No doubt he&rsquo;s found somewhere to lay low until opportunity strikes. He&rsquo;s like a new man today! Lucky I had the foresight to grab the device before blowing up the hospital.&rdquo;</p>\n<p>Riya stared at the wizard. His curls were tied into a messy bun on the back of his head. His mustache had bits of moss and leaf stuck in the white hairs. His mismatched eyes were bright and battle-ready.</p>\n<p>&ldquo;I need to ask you something, Omicron. The man who sold me these guns yesterday, he said he&rsquo;s heard stories about our&hellip;our patrons. The quote-unquote <i>company</i> that pays for all this.&rdquo;</p>\n<p>Omicron slid his gauntlet onto his right hand and tightened the straps. &ldquo;And?&rdquo;</p>\n<p>&ldquo;And he was scared. He said those people&mdash;if they are people&mdash;have been behind all sorts of atrocities throughout history. Is that true?&rdquo;</p>\n<p>&ldquo;Atrocities? Nay, nay, m&rsquo;lady. I wouldn&rsquo;t worry yourself about any of that. Rumors hover like flies over a corpse after groups like Evershine intercede in the affairs of humankind. Best not to heed them.&rdquo;</p>\n<p>&ldquo;<i>Evershine</i>? Is that what the company&rsquo;s called?&rdquo;</p>\n<p>&ldquo;Apparently. They weren&rsquo;t around back before I was sealed in the obovoid&mdash;I learned about the company when reaching out to old colleagues&mdash;but I&rsquo;ve worked with similar groups in the past. They help people like us. They pay the bills. They keep the secrets. I&rsquo;m happy to spend their cash, but as long as we have things under control, they need not play a larger role in our affairs.&rdquo; Omicron looked up at her, his mouth a tight line. &ldquo;&lsquo;Tis alright, m&rsquo;lady. If you&rsquo;re worried about your place in this war, about the moral stance of our struggle, don&rsquo;t be. Rest assured, you are one of the good guys.&rdquo;</p>\n<p>&ldquo;How can you be sure?&rdquo;</p>\n<p>&ldquo;Because,&rdquo; he said, sighing deeply, &ldquo;I&rsquo;ve been on both sides before. I had a bit of a&hellip;mid-lives crisis, once, long ago. I was tired of fighting for Order. Tired of the endless struggle, the futility of it all. And I switched over, for a time. I did things I am not proud of.&rdquo;</p>\n<p>&ldquo;When was this? As Merlin?&rdquo;</p>\n<p>&ldquo;Nay. Before that.&rdquo;</p>\n<p>Riya didn&rsquo;t know what to say. This was the first time Omicron had spoken openly about his past. She didn&rsquo;t want to jinx it.</p>\n<p>Omicron flexed his fingers in the gauntlet. &ldquo;Some answers in this world don&rsquo;t come easy. But right now? It&rsquo;s you and me and swift-footed Achilles against an army of radical terrorists with a monster that, given the chance, would literally eat your planet. Easy answer, m&rsquo;lady.&rdquo;</p>\n<p>&ldquo;We kick their arses?&rdquo;</p>\n<p>&ldquo;Aye, we kick their arses.&rdquo;</p>\n<p>He nodded to the edge of the woods. &ldquo;Here comes the first vehicle of the day. Let&rsquo;s see if Achilles can pull off his little stunt.&rdquo;</p>\n<p>Riya inserted an orange earplug into each ear and lifted her binoculars. It took her a moment to locate the distant car tearing over the meadow toward them. She let out a low whistle. &ldquo;I&rsquo;ll be damned. Pretty sure that&rsquo;s a Bugatti Chiron. Wow! You have any idea how much a car like that costs? More than my school&rsquo;s budget for a year. But damn, if that isn&rsquo;t a sexy car! But it&rsquo;s gotta be going, what, eighty miles an hour? Can Achilles really&hellip;&rdquo;</p>\n<p>The luxury sports car ripped up a cloud of dust in its wake as it neared the woods. Then the car wasn&rsquo;t alone. A man was running up behind the car, back hunched like a sprinter in the final second of a race. Through the binoculars, Riya could just make out Achilles&rsquo; wild, crooked smile, the sweat gleaming on his brow as he ran&mdash;practically flew&mdash;beside the car, and the sunlight glinting off the chrome plates of his new, mechanical, cyborg left shin and foot.</p>\n<p>&ldquo;Oh. My. Demigod,&rdquo; gasped Riya, watching as Achilles came alongside the driver&rsquo;s door, wrenched it open, and tugged out the driver. Riya saw the terrorist for only a moment as his body tumbled into the dust and was lost from view. Achilles leaped lightly into the speeding car and closed the door behind him.</p>\n<p>&ldquo;Er&mdash;Does he know how to drive?&rdquo;</p>\n<p>&ldquo;Chariots, I suppose,&rdquo; answered Omicron as the car swerved this way and that, engine sputtering. &ldquo;&lsquo;Tis the same principle, I&rsquo;d imagine.&rdquo;</p>\n<p>The car reached the woods. They could hear it banging along the path, though the trees hid it from view. Riya settled herself at the sniper rifle, focusing her gaze through the scope. Most of the terrorists by the front doors seemed oblivious, smoking and talking among themselves, but one man was staring down the road, standing very still. As Riya watched, the man&rsquo;s eyes widened and he lurched to the gun turret. Before he could fire a shot at the speeding car, Riya&rsquo;s rifle jerked on its stand, filling the air with the smell of gunpowder. She adjusted her scope in time to see the man slump forward over his gun. Two more terrorists marched onto the road, rifles raised. Riya pulled back the rifle&rsquo;s bolt.</p>\n<p>As both targets were neutralized by Riya&rsquo;s sniping, the other terrorists scrambled, lifting their weapons as the car barreled toward the compound. At the last moment, Achilles jumped from the driver&rsquo;s side door, skidding across the leaf-strewn ground on his heels as the speeding Chiron collided with the iron doors. The car exploded with a cloud of flame and raining steel, mangling the doors.</p>\n<p>&ldquo;Come on!&rdquo; called out Omicron, leaping from their hiding spot and running toward the chaos. Riya left the sniper rifle on its stand and followed the wizard, cringing at the weight of the two SA80 assault rifles and the chain of grenades she draped over her shoulders.</p>\n<p>As Omicron dashed down the slope in front of her, he readied his weapons. One of the Glock 17 pistols was holstered at his right hip. He had reluctantly accepted the gun from Riya, though she doubted he would use it. His beloved weapon of choice hung at his left hip, a coil of glinting steel attached to a two-handed hilt. He snatched the hilt with his right hand and drew it free. The steel uncoiled, revealing a deadly chain of connected blades that swung whiplike through the air, trailed in blue light from the magic gauntlet. As they ran, Omicron twisted the hilt in his hand and the blades snapped together as one, transforming the weapon into a glowing broadsword.</p>\n<p>Riya flicked the safety catch of one of the SA80s. She hadn&rsquo;t fired one of these since Iraq, and the weight and feel of it in her hands was instantly familiar, exciting and terrifying her in equal measure. The magical improvement to her back, too, was striking. Her spine ached with each step and her progress wasn&rsquo;t as fast as before her injury, but it was thrilling to be running again at all.</p>\n<p>They raced between the final trees and approached the compound. Riya lifted her rifle to fire at a terrorist by the doors, but Achilles got the man first, spinning on the ground like a hurricane and driving the chrome toes of his cyborg foot into the man&rsquo;s head: an instant kill.</p>\n<p>&ldquo;Use the bloody pistol!&rdquo; Riya shouted to Achilles, who, like Omicron, wore a Glock 17 on his hip.</p>\n<p>Achilles ignored her, spinning to kick a flaming tire at a man approaching the gun turret.</p>\n<p>Atop the high walls, men shouted and boots hurried in all directions. Riya, Omicron, and Achilles needed to get inside, fast. The explosion had twisted the heavy front doors, but they remained attached to their hinges and to one another.</p>\n<p>&ldquo;You gonna charm these things open?&rdquo; Riya asked Omicron.</p>\n<p>&ldquo;Might not <i>this</i> be faster!&rdquo;</p>\n<p>Omicron stabbed his magical sword into the center of the doors, twisted, and broke them wide open. As they swung outward, Riya saw two terrorists within, snapping back the bolts on their AK-47s. Her finger flexed on the trigger. Her SA80 thundered. The men fell.</p>\n<p>&ldquo;Inward and onward, friends!&rdquo; cheered Omicron, and they marched inside.</p>\n<p>Riya wondered what these ruins had once been. A castle? A prison? The labyrinthine play-place of a young god? They moved through dim hallways of crumbling stone walls, past windows carved in unholy shapes&mdash;pentagrams, spades, an ankh on its head. Much of the structure was now hidden under the terrorist&rsquo;s recent renovations. Concrete, cinder blocks, and rolls of barbed wire stood out against the ancient architecture, like shiny fillings among gray teeth. They moved deeper into the compound. Some of the rooms and halls were open to the sky, while others had high ceilings of cracked stone, spider webs, and security cameras. Around them rang the sounds of men shouting orders, guns being loaded, and boots pounding earth and stone, but they saw no one for the first minute inside.</p>\n<p>&ldquo;I&rsquo;m getting tired of all these goddess-damned mazes,&rdquo; grumbled Riya, staring down the sights of her rifle.</p>\n<p>&ldquo;This is nothing,&rdquo; said Achilles. &ldquo;You should see the mazes in the lands of Death, the paths to Elysium, Duat, Irkalla. You can wander for an age of the Earth and find no answers.&rdquo;</p>\n<p>&ldquo;No thanks.&rdquo; Riya adjusted the strap of the second SA80. &ldquo;Say, either of you two gonna bother using this bloody heavy gun I got for you?&rdquo;</p>\n<p>&ldquo;I will try out your firearm,&rdquo; said Achilles.</p>\n<p>Riya checked around the next corner, and feeling they were safe for the moment, lowered her weapon to hand the other rifle to Achilles. He weighed it in his hands doubtfully.</p>\n<p>A hidden door, its surface painted like chipped stone, swung open to their left, colliding with Omicron. A terrorist leaped into the hall, a machine gun in his hands and a look of red fury in his eyes. Before Riya had a chance to fire at him, Achilles raised the SA80 like a club and swung it down into the terrorist&rsquo;s collarbone. The man crumpled like a puppet with its strings cut.</p>\n<p>Achilles handed the gun, barrel now bent, back to Riya.</p>\n<p>&ldquo;Good job,&rdquo; said Riya dryly, dropping the broken rifle.</p>\n<p>&ldquo;Let&rsquo;s go through here,&rdquo; said Omicron, indicating the new doorway. &ldquo;It will lead us toward the center of this heinous place. I can sense the typhon there. Can you, Achilles?&rdquo;</p>\n<p>Achilles ducked into the doorway with the wizard. Riya followed, adjusting the heavy grenades draped over her shoulder.</p>\n<p>They moved down a sloped passage, mildewed and molded and smelling increasingly of decay. They turned a corner and headed lower still, past empty cells on either side that might have once held barrels of beer, or monks, or the bones of fallen heroes. Both Omicron and Achilles had gone tense, eyes wide and eager, feet silent as they crept forward.</p>\n<p>Even Riya could sense <i>it</i> now&mdash;primordial evil, like an icy hand at her throat. <i>No, a warm hand.</i> <i>A real hand! </i>She tried to scream, but the hand covered her mouth and another snatched around her arms and torso, preventing her from using her gun. She kicked and tried to spin, but the assailant who had sneaked out from one of the dark cells and seized her was so large and muscular that her struggle came to naught. As she was pulled backward into the cell, she tried to hook her right foot against the wall, but her attacker was too strong.</p>\n<p>She looked back into the hall. Wizard and warrior acted as one, drawing out their Glock 17s and firing. Riya gasped as her attacker hurtled backward. She turned to see the huge terrorist fall dead against the floor of the cell, both his eyes empty pockets of red.</p>\n<p>&ldquo;Well,&rdquo; said Riya, shaking. &ldquo;What a touching moment. Cheers, boys.&rdquo;</p>\n<p>Neither man had time to respond. Three more terrorists rushed toward them from the high end of the passage and another two came screaming from the low end. Riya leaped back into the cell, nearly tripping over the corpse inside. Reaching around the opening into the passage, she fired a deafening flurry of bullets. Two terrorists fell, firing their own rifles into the ceiling. Dust and pebbles rained.</p>\n<p>Omicron dropped his pistol, rolled majestically across the floor, and twisted the hilt of his weapon, switching its function from sword to whip. The final three attackers raised their guns to fire as Omicron&rsquo;s whip seared through their ranks. Three heads rolled and arcs of blood painted the edges of the hallway.</p>\n<p>Then they heard it. A growl. A purr. A scraping of claw against metal.</p>\n<p>&ldquo;In here,&rdquo; said Achilles, jogging to a door at the end of the passage.</p>\n<p>Riya recoiled at the stench as the door was pulled open. She went through and emerged into a round and cavernous room. They were high up on a stone balcony. Steps to their right led down the circular wall. There appeared to be no terrorists here&mdash;not yet. Riya closed the door behind her, and Omicron managed to seal it shut with a strenuous bit of sorcery. They descended the stairs.</p>\n<p>Medieval machines stood about the room, devices of rust and rotted wood, barely recognizable as the instruments of torture they once were. But the cubic cage was different. Shining chrome. Titanium fittings. Bars as thick as Achilles&rsquo; arms. It was made recently and for one purpose.</p>\n<p>Riya lowered her gun and stepped forward.</p>\n<p>The typhon had taken on the shape of its cage, stretched and swollen to fill every inch of space inside and bulge between the bars. It was so squashed and twisted that at first Riya had trouble seeing which body parts were which. There were limbs as broad as an elephant&rsquo;s legs, flat toes with curved claws, a large section of back or belly protected by black plates like a hellish pangolin. Three eyes stared at them through the bars, from three different places. One was black, empty as a shark&rsquo;s eyes. One was chrome. The last was blinking in Riya&rsquo;s direction from a corner of the cage. As large as a dinner plate, this eye was distinctly human.</p>\n<p>The grotesque shape shivered in the cage, groaned, exhaled rancid breath from between locked jaws.</p>\n<p>Riya slid off the chain of grenades and held it in her hands. She had planned to pull a few pins and shove them into the monster&rsquo;s mouth, but there was no room. The typhon couldn&rsquo;t have opened its mouth if it wanted to.</p>\n<p>&ldquo;Well?&rdquo; asked Omicron, glancing nervously toward the sealed door on the balcony.</p>\n<p>&ldquo;I dunno,&rdquo; mumbled Riya, kneeling in front of the cage and trying not to lock gazes with any of the monster&rsquo;s three eyes.</p>\n<p>&ldquo;They&rsquo;re coming,&rdquo; said Achilles. &ldquo;I can hear them.&rdquo;</p>\n<p>The room reverberated with a blast of heat and rubble poured over them. Riya caught half a glance of the demolished doorway over their heads and armed men rushing onto the balcony, then Achilles grabbed her and whisked her around the far side of the cage. She struggled to load a fresh magazine into her SA80 as she squatted between Omicron and Achilles, their backs against the cold steel bars and warm stony plates of the caged typhon. A storm of bullets raged against the cage at their backs and the floor and walls in front of them.</p>\n<p>&ldquo;They&rsquo;re hitting the typhon! They&rsquo;re only going to make it stronger!&rdquo; Riya screamed, but her words were lost in the tumult.</p>\n<p>Blood dripped into Riya&rsquo;s hair. She flinched and looked up. A jagged crack ran down one of the typhon&rsquo;s plates, growing as more and more bullets pierced its flesh. Then the crack burst open, spraying a fine mist of blood and pus. Something raw and red reached up from the wound, branched, darkened. A newborn limb reached from the bars toward the ceiling, letting bullets tear at its exposed bone and muscle. Claws grew from the bullet holes and bits of plate appeared at its joints. In seconds, it was ten feet long and harshly muscled. Riya screamed as the limb swung down to one side, punched the ground, and sent the whole cage rocking onto its side.</p>\n<p>Exposed to their attackers, Riya, Omicron, and Achilles took advantage of the immediate confusion and dashed to the farthest part of the room, where a heavy stone table stood against the curved wall. Achilles flipped the table onto its side with a swift chrome kick. Launching themselves behind it, they peered cautiously at the chaos all around. The typhon&rsquo;s cage was leaning at an angle against the stairs, the new limb grasping desperately for a grip on the bars, searching for a way to escape.</p>\n<p>&ldquo;Oh bloody hell!&rdquo; grunted Riya, patting down her body with her hands. Her grenades were gone. &ldquo;What now?&rdquo;</p>\n<p>&ldquo;Give me your sword,&rdquo; Achilles demanded of Omicron, and when the wizard hesitated, Achilles wrenched it from his grasp and stood.</p>\n<p>Riya screamed at him to get down. Guns roared. Achilles spun the blade in his skilled hands. Sparks flew from the steel, flinging bullets left and right. Achilles bent his legs&mdash;flesh and machine&mdash;and jumped. He shot off the ground and disappeared from her view. She heard him land on the balcony above, heard his guttural battle cry, the swishing of his sword, the gasps of the men he fought, the blast of their guns. A body thumped to the ground. Then a second. Then a third. When the fourth terrorist went silent, Riya chanced a peek over the fallen table.</p>\n<p>Achilles stood upon the balcony, his broad back to her, panting. A thin stream of red ran down the length of Omicron&rsquo;s sword and dripped to the ground. He leaped lightly from the balcony and landed beside the typhon&rsquo;s cage. The monster continued to reach with its ghastly new arm, but all three of its eyes were fixed on Achilles.</p>\n<p>A slow clap sounded from the balcony door. Riya and Omicron stood and watched as a man walked onto the balcony. Just another terrorist? Or something else? The man wore a suit, strangely bulky around the chest, and his hair and beard were dusty and disheveled. Bits of gravel stuck into his right cheek, his hair, his clapping hands.</p>\n<p>&ldquo;Isn&rsquo;t that the guy you threw out of the Bugatti?&rdquo; Riya asked Achilles, then she noticed that the terrorist&rsquo;s right hand was clasped into a fist, holding something.</p>\n<p>&ldquo;Well, well,&rdquo; said the bearded man in accented English. &ldquo;I see you&rsquo;ve met my little pet. Beautiful, isn&rsquo;t she? The size of a dog when my men found her wandering the woods, but by the time we had gotten her into the cage, she had grown to this. And taken out twenty of my men. Good deaths, each of them. Very good deaths.&rdquo;</p>\n<p>Omicron rolled his eyes. &ldquo;Right, right. We get it. Neglected son of an oil tycoon turned death cult leader with a thing for bloodshed. As you can see, we&rsquo;re busy finding a way to destroy this pet of yours. Please keep the monologuing to a minimum.&rdquo;</p>\n<p>&ldquo;Destroy her? I think not, old man. You blew up my hospital yesterday. A shame, that. But today you will not succeed. You will not walk out of these ruins alive. None of us will.&rdquo;</p>\n<p>He undid the buttons of his jacket with his left hand. The jacket fell open to reveal a camo vest lined with blocks of C-4 and complex wiring.</p>\n<p>&ldquo;He&rsquo;s got a suicide vest!&rdquo; called Riya. &ldquo;And a dead man&rsquo;s switch.&rdquo;</p>\n<p>&ldquo;So?&rdquo; said Achilles.</p>\n<p>&ldquo;So if we kill him, he blows up like a barrel of Greek fire.&rdquo;</p>\n<p>The man on the balcony smiled. &ldquo;We were going to release the beast in New York City. Can you imagine the scene? This beauty gobbling up all those fat, infidel tourists! Then come the policemen&rsquo;s bullets, the army&rsquo;s missiles. And my pet grows, and grows, and grows. How long, do you think, before nuclear options would have come into play? How long before the grand plans of Demir Dua would have wrecked the world? Ah, well. You have changed the plan now. It won&rsquo;t have the same shocking beginning, but the end will be the same. My bomb sends me to paradise, all of you to hell, and blasts apart that cage. My pet feasts on our broken bodies, rampages across the countryside. Ankara, then Istanbul, Budapest, Vienna, Berlin. Who knows?&rdquo;</p>\n<p>Riya formulated her plan while he rambled. &ldquo;Say, Achilles,&rdquo; she said under her breath, &ldquo;how about giving that sword back to Omicron. I think it will be <i>the key</i> to getting us out of here. After you do that, just&hellip;hop to it. Swift kick in the backside. Swifter the better.&rdquo;</p>\n<p>Achilles turned to Riya, confusion plain on his scarred face.</p>\n<p>Riya nodded subtly at the balcony. &ldquo;He wants to go out in a blaze of glory. Help him do so.&rdquo;</p>\n<p>Achilles grinned.</p>\n<p>&ldquo;The Iron Prayer will be answered!&rdquo; the terrorist proclaimed, eyes closed, hands upheld. &ldquo;The Iron Armageddon shall begin. All shall end! All shall drown in tides of blood and&mdash;&rdquo;</p>\n<p>Achilles tossed the sword to Omicron, who caught it by the hilt and twisted. The ghostly whip swung back and cracked forward, hooking onto the bars of the typhon&rsquo;s cage. As Omicron yanked on the whip and the metal split apart, Achilles crouched and leaped. Landing beside the preaching terrorist, he spun around and brought his chrome foot into the man&rsquo;s back. The terrorist fell with a sharp intake of breath. The cage burst apart and the typhon pounced upward, unfolding in an instant, stretching limb and claw. Riya watched its hideous form take shape. No tail, but huge plates of green and black over a humped back. Long arms and legs like a lizard&rsquo;s, and the extra arm extending from one shoulder like a sentient tumor. Its head was like a tyrannosaur, barbed with horns and bristled with black feathers. It had an eye on its back, an eye on its chest, and the human eye centered over its jaws.</p>\n<p>The terrorist fell into its open mouth. The monster swallowed him whole&mdash;an appetizer&mdash;then turned its full, terrible attention to Achilles. Achilles did not bother fighting, but stood with arms crossed as the monster stretched its neck for the kill.</p>\n<p>The explosion was muted by the typhon&rsquo;s flesh, but its force shook the room. Blood fountained from between the plates at the monster&rsquo;s neck. Swirls of black smoke escaped through its mouth and nostrils. The eyes bulged. The typhon&rsquo;s roar was strangled into a last squeal of helplessness.</p>\n<p>At its final moment, the monster swelled and grew, sprouting cancerous fingers, feathers, a fourth grotesque eye, this one on its blood-soaked belly. Pale blue limbs sprouted like fungus in timelapse, reaching, grasping, blackening, curling, dying. The eyes burned out, one by one. Bloody plates tore free and clattered to the stone. The typhon hunched, quivered, and toppled forward, shaking the foundations of the ruins as its hideous corpse fell dead.</p>\n<p>Riya wiped typhon blood off her face with the back of a sleeve. &ldquo;Gross.&rdquo;</p>\n<p>&ldquo;Went out in a blaze of<i> gory</i>, more like,&rdquo; said Omicron, chuckling and switching his weapon back to its sword mode.</p>\n<p>Achilles pointed to the blade in Omicron&rsquo;s grasp. &ldquo;Thank you for letting me borrow that. I like the sting of this skorpios.&rdquo;</p>\n<p>&ldquo;Hm. Not a bad name for the weapon,&rdquo; mused Omicron, holding up the bloodied sword.</p>\n<p>&ldquo;Can we please get out of here now?&rdquo; asked Riya.</p>\n<p>And they ran up the steps, through the dim halls, back into the maze of ruins and out the mangled doors.</p>\n<p>&ldquo;Truck! Truck!&rdquo; shouted Riya, pointing to a massive military vehicle parked by the woods.</p>\n<p>Terrorists returning to the compound from the woods shouted at them, fired AK-47s, rushed to find vehicles to make pursuit. Riya climbed into the truck&rsquo;s cabin, found the keys above the driver&rsquo;s side mirror, and waited as Omicron and Achilles joined her in the front seat. She glanced at the wing mirror just in time to see a terrorist raise his gun. His bullet shattered the mirror. Riya stabbed the key into the ignition, gave it a hearty turn, and pounded her foot onto the accelerator.</p>\n<p></p>\n</div></body></html>\n",
        "<html> <head> <style> {font: 12.0px Palatino} </style> </head>\n<body>\n<div class=Section29>\n<!-- generated automatically by preen version 3.4.0 04/29/2019 09:47-->\n<!-- ### -->\n<p>&ldquo;And we drove through the day, first with Iron Prayer on our heels, then later pursued by the Turkish military. Not very fun. We finally reached the northern coast at dusk. Found a boat. Stole the boat. Set off across the Black Sea. That was&hellip; A journey across water can be a powerful thing, you know. The waves. The wind. And at last, distant lights on the Russian coast. A trip like that is somehow both epic and personal. The Greeks had a word for it: <i>nostos</i>. Anyway, I guess we must have crashed into the beach just before dawn and I was knocked unconscious. I don&rsquo;t remember. You all must have gotten to me before Omicron and Achilles, and they had to escape while they could. All I know is, I woke up with a killer headache, handcuffed to a hospital bed in this prison.</p>\n<p>&ldquo;That&rsquo;s the story. You asked. I answered.&rdquo;</p>\n<p>The interrogation room had been cold before she started her story, but the heat from all the bodies packed inside made Riya sweat. Soldiers, officers, clerks, caretakers, and even a handful of inmates sat and stood around the woman handcuffed to the chair. The interrogator himself had left the room some minutes before, overwhelmed.</p>\n<p>&ldquo;Wow,&rdquo; mumbled one soldier. &ldquo;What a story.&rdquo;</p>\n<p>&ldquo;But is not true, right?&rdquo; asked another in broken English. &ldquo;All those bullets flying, missing heroes. All that lucky timing!&rdquo;</p>\n<p>&ldquo;Well, of course there&rsquo;s going to be embellishments!&rdquo; countered a young officer. &ldquo;The lady is a master storyteller.&rdquo;</p>\n<p>&ldquo;Or perhaps,&rdquo; put in Riya, &ldquo;we fought with the goodwill of a goddess, whose blessings lent us divine luck for the day.&rdquo;</p>\n<p>They turned to arguing among themselves in Russian about this interpretation of events.</p>\n<p>&ldquo;Anyone have the time?&rdquo; asked Riya.</p>\n<p>&ldquo;Almost two in the afternoon,&rdquo; a clerk told her.</p>\n<p>Riya nodded. &ldquo;All right then. Here&rsquo;s what&rsquo;s going to happen next. Any minute now, the lights in this prison will suddenly go out. You&rsquo;ll start to hear noises in the halls. Breaking glass. Gunshots. Shouting. Probably an explosion or two as the computer system is obliterated to erase any recording of my confession. Then <i>they </i>will come through that door to rescue me. And it won&rsquo;t just be Omicron and Achilles. Sable Crow will be here, too. Helluva woman, Sable Crow. Now, you could fight back, if you really wanted to, but I think we both know who&rsquo;s going to win the day. One way or another, I will soon be out of here, enjoying a birthday dinner with my comrades. So, anyone care to hasten the inevitable and undo these handcuffs?&rdquo;</p>\n<p>The sea of faces looked at her, some amused, some doubtful, some frightened.</p>\n<p>&ldquo;The, uh&hellip;&rdquo; mumbled Egor, &ldquo;&hellip;the resurrection squad is coming <i>here</i>? For real?&rdquo;</p>\n<p>Riya shrugged, though none of her audience saw the gesture, as just then, the lights went out.</p>\n<p></p>\n</div></body></html>\n"
    ],
	"content": [{"episode": "Episode Title 1","scenes": ["<p>Arianrhod walked across the endless sea, her bare feet scarcely touching the surface of the green waters. Her hair, her gown, and her cheeks shone with windswept beads of moonlight.</p>\n<p>And then she was a bird, drifting on white wings beneath the starry sky. Then a silver wheel, mixing water with darkness as it revolved. At last, a woman again, with flame-colored hair and a jewel-green gown to match her eyes.</p>", "<p>Arianrhod walked across the endless sea, her bare feet scarcely touching the surface of the green waters. Her hair, her gown, and her cheeks shone with windswept beads of moonlight.</p>\n<p>And then she was a bird, drifting on white wings beneath the starry sky. Then a silver wheel, mixing water with darkness as it revolved. At last, a woman again, with flame-colored hair and a jewel-green gown to match her eyes.</p>"]},{"episode": "Episode Title 2","scenes": ["<p>Arianrhod walked across the endless sea, her bare feet scarcely touching the surface of the green waters. Her hair, her gown, and her cheeks shone with windswept beads of moonlight.</p>\n<p>And then she was a bird, drifting on white wings beneath the starry sky. Then a silver wheel, mixing water with darkness as it revolved. At last, a woman again, with flame-colored hair and a jewel-green gown to match her eyes.</p>","<p>Arianrhod walked across the endless sea, her bare feet scarcely touching the surface of the green waters. Her hair, her gown, and her cheeks shone with windswept beads of moonlight.</p>\n<p>And then she was a bird, drifting on white wings beneath the starry sky. Then a silver wheel, mixing water with darkness as it revolved. At last, a woman again, with flame-colored hair and a jewel-green gown to match her eyes.</p>"]}],
    "gfReadingLevel": 7.05,
    "words": 32297
}
